[
    {
        "active": "Y",
        "description": "Le continuous delivery agit comme une ceinture de sécurité pour les développements et la production...  si votre véhicule est un TGV lancé à plein vitesse sur une tracé sinueux, alors CDS - projet opensource développé par OVH - est fait pour vous !\n\nAu travers de workflows et de pipelines, sur des environnements hétérogènes (linux, windows, macos, docker, swarm, openstack, mesos/marathon, ...), gagnez du temps avec CDS sans sacrifier la disponibilité, la robustesse, l'interopérabilité et la sécurité de votre stack de continuous delivery.",
        "event_end": "2017-04-19T12:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T10:00:00",
        "event_type": "Cloud, Devops, Outils",
        "format": "Université",
        "goers": "tobedefined",
        "id": "1146",
        "invite_only": "N",
        "language": "Français",
        "name": "CDS - Le continuous delivery sous stéroïdes",
        "seats": "tobedefined",
        "speakers": "François SAMIN, Yvonnick Esnault, null null",
        "venue": "Track1",
        "venue_id": 1
    },
    {
        "active": "Y",
        "description": "Play with us! Utilisation de plusieurs petits jeux pour découvrir et apprécier la qualité de code, la simplicité, la refactorisation ou encore le tdd.",
        "event_end": "2017-04-19T15:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T13:30:00",
        "event_type": "Agilité, Méthodologie et Tests",
        "format": "Lab",
        "goers": "tobedefined",
        "id": "498",
        "invite_only": "N",
        "language": "Français",
        "name": "Des Lego, des bonnes pratiques et du fun !",
        "seats": "tobedefined",
        "speakers": "Cécile Especel",
        "venue": "Track1",
        "venue_id": 1
    },
    {
        "active": "Y",
        "description": "## TL;DR\n2 clusters `Docker` auto-managés et portés par des clouds publics s'affrontent dans une bataille sans merci. L'un conçu pour résister à toute forme d'attaque. L'autre ayant pour seul objectif de détruire le premier. Qui l'emportera ?\n\n## Version longue\n> La singularité a eu lieu, l'ère des machines a éclos. Bientôt, l'emprise de **Skynet**, l'IA massivement distribuée et son armée de robots s'étendront à travers toute la planète. Heureusement, une armée de grands singes se dresse pour mettre fin à l’hégémonie de métal.\n\n> La bataille s'annonce épique !\n\nDans le rôle de **Skynet**, une plateforme `Docker` totalement automatisée et devenue indestructible, son application cerveau ultra-résilient, et son armée de robots prêts à nous éradiquer. Dans le rôle de l'armée des singes, la Simian Army de **Netflix**.\n\n**Skynet** résistera-t-elle aux assauts incessants de l'armée des grands singes ?\n\nCette session décalée revient en détail sur les aspects d’ingénierie IT mis en œuvre pour arriver à un tel résultat. Résilience, scalabilité, architecture micro-services, plateforme multi-clouds, conteneurs, orchestration, et stockage distribué n'auront plus de secret pour vous !",
        "event_end": "2017-04-19T18:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T16:00:00",
        "event_type": "Cloud, Devops, Outils",
        "format": "Université",
        "goers": "tobedefined",
        "id": "1145",
        "invite_only": "N",
        "language": "Français",
        "name": "Skynet vs Planète des Singes, fight !",
        "seats": "tobedefined",
        "speakers": "Adrien Blind, null null, Laurent Grangeau",
        "venue": "Track1",
        "venue_id": 1
    },
    {
        "active": "Y",
        "description": "Ok, tout le monde est persuadé, les microservices, c’est cool. Moi aussi je le crois, ça fait 5 ans que l'architecture de Clever Cloud est basé là dessus. Mais comme tout les nouveau machin trendy, en fait, c’est pas la panacé, et ça apporte son lot de problèmes. Au rang desquels la gestion de l’authentification en mode distribué, je vais donc lister les quelques possibilités de gestion à ce point là. La gestion de la configuration est également un problème quand on déploie des applications distribué. Le talk sera donc fait pour expliquer le moyen de mettre en place une démarche de microservice dans la vie réelle et de soulever les problèmes qui vont être rencontré, et comment les régler.",
        "event_end": "2017-04-20T11:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T10:30:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "862",
        "invite_only": "N",
        "language": "Français",
        "name": "Les problèmes que l’on rencontre en microservice : configuration, authentification et autre joyeusetés",
        "seats": "tobedefined",
        "speakers": "Quentin ADAM",
        "venue": "Track1",
        "venue_id": 1
    },
    {
        "active": "Y",
        "description": "En trois ans, une équipe avec 30 devs, 5 ops et 10 testeurs a transformé un produit monolithique en une application en microservices uniquement basée sur des API REST utilisant des normes. Elle l'a déployé en mode Cloud ou On Premise, avec du Docker. Au passage, elle s'est structurée en DevOps et Feature Teams. En trois ans sur un tel projet, on apprend beaucoup de choses ! Le dirtech de cette équipe vous en propose un résumé.",
        "event_end": "2017-04-20T12:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T11:30:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "669",
        "invite_only": "N",
        "language": "Français",
        "name": "REX : d'un monolithe à des microservices multitenants en Docker",
        "seats": "tobedefined",
        "speakers": "Jean-Philippe Gouigoux",
        "venue": "Track1",
        "venue_id": 1
    },
    {
        "active": "Y",
        "description": "Chaque jour des développeurs risquent leurs vies et celles de leurs collègues pour vous fournir l'application qui révolutionnera votre façon de vivre. Ce métier trop souvent sous estimé pour sa dangerosité mérite néanmoins qu'on s'attarde sur cet aspect. Nous verrons dans ce talk les risques qui pèsent sur les épaules de ces chevaliers des temps modernes et leurs entreprises, et pourquoi la sécurité informatique doit être prise en compte dans le cycle de développement d'une application.",
        "event_end": "2017-04-20T14:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T13:30:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "410",
        "invite_only": "N",
        "language": "Français",
        "name": "Dev VS Wild",
        "seats": "tobedefined",
        "speakers": "Yoann Ono Dit Biot",
        "venue": "Track1",
        "venue_id": 1
    },
    {
        "active": "Y",
        "description": "Les FPGAs sont des **puces configurables** servant à l'origine à tester des prototypes de puces électroniques. Ils entrent maintenant dans le monde du logiciel en tant qu'**accélérateurs matériels reconfigurables**, bien plus versatiles que les GPUs. Ils sont même proposés par certains fournisseurs de cloud.\n\n**Traitement de trafic, compression, chiffrement, machine learning**, sont des domaines dans lesquels les FPGAs excellent. Des accélérateurs existent qui peuvent être utilisés sans connaissances en électronique, rendant les FPGAs accessibles à tous les développeurs. \n\nLes FPGAs n'imposent aucune architecture matérielle, et offrent un **parallélisme massif** grâce à leurs millions d'éléments (logiques, mémoire) fonctionnant indépendamment. À travers l'exemple du **système anti-DDoS d'OVH**, venez découvrir l'intérêt, les challenges et les solutions pour intégrer des FPGAs dans un environnement logiciel.",
        "event_end": "2017-04-20T15:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T14:30:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1215",
        "invite_only": "N",
        "language": "Français",
        "name": "Qu'apportent les accélérateurs matériels sur FPGA ? L'exemple de l'anti-DDoS d'OVH",
        "seats": "tobedefined",
        "speakers": "Tristan Groléat",
        "venue": "Track1",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "Avec autant de buzzwords dans le titre, laissez-moi expliciter le menu :\n\n* Nous commencerons avec une étude des principes du CQRS et la notion de projection pour construire les modèles de données dédiées à la lecture, le tout avec un datastore traditionnel (relationnel).\n* Nous continuerons avec le concept d’état en programmation fonctionnelle, et comment les gérer au sein d’une application tout en respectant le principe d’immutabilité. Et pourquoi ont-ils transformé la gestion d’états pour la construction d’interface utilisateur??\n* Dans un troisième temps, nous nous intéresserons aux évènements du domaine-métier dans le Domain Driven Design et comment ceux-ci s’intègrent dans la mécanique de construction des projections.\n* Enfin, nous assemblerons toutes ces notions pour faire apparaitre l’«?event sourcing?» comme modèle de persistance pour nos données.\n* Pour clôture, nous verrons les erreurs les plus courantes rencontrées lors de l’implémentation d’un modèle en event sourcing. Et nous terminerons avec une présentation de l’architecture que nous utilisons en interne chez Arpinum pour nos clients.\n\nTake away:\n* Utiliser CQRS (sans event-sourcing) pour simplifier la gestion de la persistance dans son application.\n* Comprendre le modèle d’états derrière Redux (utilisé massivement par la communauté ReactJs).\n* Gérer facilement les évènements-métier au sein d’une architecture DDD.\n* Savoir comment implémenter correctement un système basé sur l’event sourcing.\n* Présentation d’une architecture clef en main pour construire ce type d’application.",
        "event_end": "2017-04-20T17:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T16:00:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1236",
        "invite_only": "N",
        "language": "Français",
        "name": "CQRS, Fonctionel, Event Sourcing & Domain Driven Design",
        "seats": "tobedefined",
        "speakers": "Arnaud LEMAIRE",
        "venue": "Track1",
        "venue_id": 1
    },
    {
        "active": "Y",
        "description": "Ce talk est une démonstration de l'attaque de l'Homme du milieu (Man-In-The-Middle).\nL'objectif est de démystifier le hacking par la pratique (éthique!) et de sensibiliser aux risques que l'on court en permanence (au bureau, à la maison ou dans un café public).\n\nAu programme, le déroulement complet d'une attaque :\n-  écoute réseau\n- vol de mot de passes\n- création de trojan\n- évasion antivirus\n- infection\n- prise de contrôle totale de la cible",
        "event_end": "2017-04-20T17:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T17:00:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Tool in Action",
        "goers": "tobedefined",
        "id": "1154",
        "invite_only": "N",
        "language": "Français",
        "name": "Comment hacker la webcam de ton voisin(e) ?",
        "seats": "tobedefined",
        "speakers": "Charles BOCHET",
        "venue": "Track1",
        "venue_id": 1
    },
    {
        "active": "Y",
        "description": "Au commencement il y avait « l’audit de sécurité » qui était très cadré et très dirigé et donc manquait de vision terrain. Nous sommes ensuite passé au « test d’intrusion », plus réaliste d’une cyberattaque car il permet une plus grande marge de manœuvre pour les consultants tout en permettant l’application des méthodes des pirates. Cependant, le test d’intrusion possède ses limites et face à la généralisation des cyberattaques certains commencent à se demander s’il ne vaudrait pas mieux faire évoluer cette méthodologie…\nLe « Red Team » (qui nous vient tout droit d’outre-atlantique) serait-il LA réponse à cette problématique ? L’objectif de ce talk est donc de présenter cette nouvelle méthodologie qui petit à petit commence à faire son bout de chemin sur le vieux continent.",
        "event_end": "2017-04-20T18:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T17:30:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Tool in Action",
        "goers": "tobedefined",
        "id": "688",
        "invite_only": "N",
        "language": "Français",
        "name": "Le test d’intrusion Red Team : digne successeur de l’audit de sécurité ?",
        "seats": "tobedefined",
        "speakers": "Clément MICHEL",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "1 heure pour apprendre un nouveau langage, c'est court. Et quand il s'agit d'un langage aussi particulier que *Haskell*, ça devient sportif ! Mais qu'à cela ne tienne, tentons le coup !\n\nCommençons par étudier un cas topique : *le parsing de fichiers texte*.",
        "event_end": "2017-04-21T11:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T10:30:00",
        "event_type": "Langages",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "892",
        "invite_only": "N",
        "language": "Français",
        "name": "Haskell for the noobs",
        "seats": "tobedefined",
        "speakers": "Frédéric Menou",
        "venue": "Track1",
        "venue_id": 1
    },
    {
        "active": "Y",
        "description": "Depuis que Groovy a rejoint la fondation Apache, on doit l'appeler Apache Groovy. Bon, OK, mais sinon, quoi de neuf du côté du langage ?\n\nDans cette présentation, Guillaume, committer de longue date sur Apache Groovy, vous montrera les dernières fonctionnalités, les transformations d'AST, les méta-annotations, l'immutabilité, la sérialisation JSON customisable, mais aussi la grande nouveauté avec les \"macros\" et le support de la syntaxe de Java 8.",
        "event_end": "2017-04-21T12:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T11:30:00",
        "event_type": "Langages",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1198",
        "invite_only": "N",
        "language": "Français",
        "name": "Sinon, quoi de neuf côté Apache Groovy ?",
        "seats": "tobedefined",
        "speakers": "Guillaume Laforge",
        "venue": "Track1",
        "venue_id": 1
    },
    {
        "active": "Y",
        "description": "S'il avait vécu à notre époque, Lao-Tseu serait un pur développeur, un vrai de vrai.\n\nLe genre de mec smart, qui connaît les bons principes de la programmation et réfléchit avant d'agir\nCelui que les entreprises cherchent tant à recruter, et qui, OKLM, transmet ses conseils à tous.\n\nTiens d'ailleurs, tu savais que dans son bouquin : \"le livre de la voie et de la vertu\", il parlait du partage de connaissance, des architectures, du testing, des cérémoniaux SCRUM, de backlog, de SOLID, de la programmation réactive fonctionnelle etc.\nHein ? Tu savais pas ? Que c'était quoi ? Un truc de hippies ? Mais non, mon petit lapin ! Pas du tout !\nAllez viens, assis-toi, on va lire des extraits de son livre, et faire l'analogie avec le développement logiciel.",
        "event_end": "2017-04-21T14:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T13:30:00",
        "event_type": "Agilité, Méthodologie et Tests",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "403",
        "invite_only": "N",
        "language": "Français",
        "name": "Lao-Tseu, Software Craftsman",
        "seats": "tobedefined",
        "speakers": "Gautier Mechling",
        "venue": "Track1",
        "venue_id": 1
    },
    {
        "active": "Y",
        "description": "Javaslang est une librairie complètement dédiée au paradigme de programmation fonctionnelle. Elle a la particularité d'aller un peu plus loin que les notions de lambdas, pipelines ou composition de fonctions offertes par Java 8.\n\nDurant cette session nous découvrirons les structures proposées par Javaslang, comme les collections immuables, les values types tels que les Option, les Try, les Either...\n\nNous verrons comment cette librairie gère des aspects plus fonctionnels, à savoir la composition de fonction, le lifting, la memoization ou le currying.\n\nEnfin nous terminerons avec la présentation de la syntaxe offerte pour le pattern Matching et le property checking.",
        "event_end": "2017-04-21T15:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T14:30:00",
        "event_type": "Langages",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "435",
        "invite_only": "N",
        "language": "Français",
        "name": "Et Java 8 devient plus fonctionnel avec Javaslang",
        "seats": "tobedefined",
        "speakers": "Guillaume LOURS",
        "venue": "Track1",
        "venue_id": 1
    },
    {
        "active": "Y",
        "description": "La version 6 de JavaScript aka __“ES6”__ permet de structurer un peu mieux la conception d’applications web.\n\n__TypeScript__, champion de la rigueur développé par le créateur de C# a quant à lui pour vocation d’apporter à JavaScript la maturité des langages objets historiques.\n\nAlors __ES6__ ou __TypeScript__ ?\n\nLors de ce talk 100% live-coding, venez découvrir le développement en parallèle des 2 versions, les limites et avantages de ces 2 technologies afin d’être en mesure de faire le bon choix pour vos futurs projets.",
        "event_end": "2017-04-21T17:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T16:00:00",
        "event_type": "Langages",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "913",
        "invite_only": "N",
        "language": "Français",
        "name": "TypeScript, un ami qui vous veut du bien... ou pas",
        "seats": "tobedefined",
        "speakers": "Vincent Ogloblinsky, BRECHET Matthieu",
        "venue": "Track1",
        "venue_id": 1
    },
    {
        "active": "Y",
        "description": "Découvrez les futures fonctionnalités de CSS4 à travers le développement d’un site static utilisant les modules PostCSS.",
        "event_end": "2017-04-21T17:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T17:00:00",
        "event_type": "Web et mobile",
        "format": "Tool in Action",
        "goers": "tobedefined",
        "id": "1095",
        "invite_only": "N",
        "language": "Français",
        "name": "Plongez au coeur du futur de CSS4 avec PostCSS",
        "seats": "tobedefined",
        "speakers": "Pierrick Turelier",
        "venue": "Track1",
        "venue_id": 1
    },
    {
        "active": "Y",
        "description": "Comment modéliser un processus métier, même complexe, ou encore l’entièreté du panorama applicatif d’une entreprise sans tomber dans le piège d’une analyse sans fin, épuisante et ô combien ennuyante ?\n\nComment maîtriser la complexité d’un projet avec agilité en démarrant de la manière la plus appropriée, et ainsi obtenir une très bonne vue d’ensemble dès le départ ?\n\nL'Eventstorming est une technique d'analyse très accessible qui vise à acquérir une compréhension détaillée de votre domaine métier. Les outils utilisés lors de ces ateliers, sont des post-its, des marqueurs pour tout le monde et de l’espace, beaucoup d’espace !\n\nDans cet atelier pratique, vous apprendrez de manière ludique comment découvrir en profondeur les concepts d’un domaine applicatif grâce à une succession de courtes séances d'une quinzaine de minutes chacune. Vous pourrez non seulement apprendre comment rendre votre domaine explicite, mais vous pourrez aussi pointer les éventuelles incohérences et le manque de connaissance.\n\nA la fin de cet atelier, vous aurez les éléments nécessaires en main pour le rejouer au sein même de votre société !",
        "event_end": "2017-04-19T12:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T10:00:00",
        "event_type": "Agilité, Méthodologie et Tests",
        "format": "Université",
        "goers": "tobedefined",
        "id": "413",
        "invite_only": "N",
        "language": "Français",
        "name": "Atelier Eventstorming",
        "seats": "tobedefined",
        "speakers": "Maxime Sanglan-Charlier",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "L'autonomie est critique pour le mobile et encore plus pour l'IOT.\nAndroid offre des API de mesure permettant de faire des mesures software mais avec le nouveau SDK d'Android pour l'IOt (Android Things) ce n'est pas aussi simple.  Les données constructeurs ne suffissent plus pour faire des estimations, il faut mettre les mains dans le moteur pour mesurer l'énergie. \nDans cette session, je vous montrerai comment utiliser un Arduino Uno pour mesurer la consommation du Raspberry PI 3 avec Android Things \nC'est le moment de voir ce que ce nouveau venu de la famille Android a dans le ventre !",
        "event_end": "2017-04-19T15:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T13:30:00",
        "event_type": "Objets connectés, IoT, Robotique",
        "format": "Université",
        "goers": "tobedefined",
        "id": "735",
        "invite_only": "N",
        "language": "Français",
        "name": "Iot inception : Mesure de l'énergie d'Android Things sur Raspberry 3 avec Arduino Uno",
        "seats": "tobedefined",
        "speakers": "Olivier Philippot",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "Nous avons la chance de travailler régulièrement sur de nouveau produits ce qui nous a amenés à affiner progressivement la façon dont nous développons nos applications en suivant les concepts du Domain Driven Design.\nÀ partir d’un retour d’expérience, nous expliquerons les notions et patterns qui permettent d’exprimer au mieux le métier au sein du code source.?L’occasion de comprendre la philosophie derrière le Domain Driven Design associée a des exemples d’implémentation concrète de ce type d’architecture au sein d’environnements connus comme spring boot.\nNous terminerons avec une rapide présentation de la graine logicielle que nous utilisons en interne.",
        "event_end": "2017-04-19T18:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T16:00:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Université",
        "goers": "tobedefined",
        "id": "1234",
        "invite_only": "N",
        "language": "Français",
        "name": "Domain Driven Architecture",
        "seats": "tobedefined",
        "speakers": "Arnaud LEMAIRE",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "Réaliser le design d'une application sur mobile ne doit pas être si compliqué que ça. Après tout, petit écran = petit design non ? Certainement pas !\n\nCette conférence vous propose de démystifier le design sur Android et iOS. Au travers d'exemples très concrets, vous allez découvrir les demandes parfois farfelues, mais bien souvent légitimes, que nous avons pu recevoir, et comment faire malgré tout un design correct. Cela sera ainsi l'occasion de vous donner quelques clés pour convaincre vos clients de faire les choses correctement.\n\nSi vous en avez assez de créer un design iOS pour vos applications Android, ou pire, de devoir appliquer un pseudo-style bootstrap pour votre app iPad, vous n'êtes pas seul, venez nous voir !",
        "event_end": "2017-04-20T11:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T10:30:00",
        "event_type": "Web et mobile",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "928",
        "invite_only": "N",
        "language": "Français",
        "name": "Le design mobile, c'est pas facile !",
        "seats": "tobedefined",
        "speakers": "Quentin Sallat",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "D’un côté, nous avons la communauté web qui maintient un écosystème riche permettant de construire des interfaces utilisateurs rapidement. De l’autre côté, l’écosystème desktop possède des outils très performants mais qui demandent beaucoup d’investissement. Github s’est retroussé les manches pour tirer le meilleur des deux mondes et a créé Electron ! Electron, c’est la possibilité de construire des applications grâce aux composants web tout en profitant des interactions riches avec la machine d’une application desktop.\n\nAu cours de cette présentation, nous allons revenir sur les raisons du succès grandissant d’Electron et passerons en revue tout ce qu’il offre en matière de packaging, de mises à jour automatiques et de stratégies de testing au travers du livecoding d’une application meme generator.",
        "event_end": "2017-04-20T12:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T11:30:00",
        "event_type": "Backend et Desktop",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "615",
        "invite_only": "N",
        "language": "Français",
        "name": "Développez des applications web desktop avec Electron de Github",
        "seats": "tobedefined",
        "speakers": "Eric Briand, Yvonnick FRIN",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "Moving the heavy lifting of machine learning to the cloud is a great way to get large speed ups. This session will step through this process in detail, so that you'll be ready to scale your own training and prediction services.\n\nTensorFlow is an increasingly popular open source Machine Intelligence library that is especially well-suited for deep learning. The Google Cloud Machine Learning Platform (Cloud ML) lets you do distributed training and serving of your TensorFlow models at scale. \n\nWe start with an introduction to TensorFlow concepts and then walk through how to use Cloud ML to do distributed training and scalable serving of your trained models. We will explore the design decisions available to you in scaling up your machine learning, and talk about their tradeoffs.",
        "event_end": "2017-04-20T14:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T13:30:00",
        "event_type": "BigData, Analytics et Machine Learning",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "728",
        "invite_only": "N",
        "language": "English",
        "name": "Machine Learning at scale: TensorFlow in the Cloud",
        "seats": "tobedefined",
        "speakers": "Yufeng Guo",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "**Keras** est une librairie dédiée au **deep learning** dont les objectifs principaux sont l'expérimentation rapide et la facilité d'utilisation.\n\nDémocratisé ces dernières années avec l'augmentation des capacités de stockage et de calcul, popularisé par les géants du WEB, le deep learning peut apporter des solutions dans des domaines comme la classification d'images, la reconnaissance vocale, l'analyse de texte, la génétique, les chatbots ou même la création artistique.\n\nAprès avoir tenté de définir un peu plus précisément ce qu'est le deep learning et parcouru l'API proposée par Keras, nous verrons lors de cette session que quelques lignes de python peuvent suffire pour implémenter des premiers modèles de **traitement automatique de langage naturel** ou de **classification d'images**.",
        "event_end": "2017-04-20T15:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T14:30:00",
        "event_type": "BigData, Analytics et Machine Learning",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1070",
        "invite_only": "N",
        "language": "Français",
        "name": "Premiers pas en Deep Learning avec Keras",
        "seats": "tobedefined",
        "speakers": "Manuel Verriez",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "Nous présenterons les algorithmes génétiques, appartenant à la famille des algorithmes évolutionnistes. Ils permettent d'obtenir une solution approchée à un problème d'optimisation, lorsqu'il n'existe pas de méthode exacte (ou que la solution est inconnue) pour le résoudre en un temps raisonnable.\n\nL'exécution d'un algorithme génétique passe par les étapes suivantes:\n- Génération aléatoire d'une population initiale\n- Croisement des génomes\n- Mutation\n- Evaluation des individus\n- Vérification des condition de terminaison\n\nDes exemples d'application seront présentés afin d'illustrer leur comportement:\n- les smart rockets, où des fusées tenteront de contourner un obstacle pour atteindre une cible ;)\n- la planification de resources, et notamment l’allocation de salles de conférences pour les intervenants d’une keynote, en fonction de leurs besoins d’équipements, des personnes inscrites, des capacités des dites salles, etc. (respect des contraintes faibles et fortes)",
        "event_end": "2017-04-20T17:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T16:00:00",
        "event_type": "BigData, Analytics et Machine Learning",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "627",
        "invite_only": "N",
        "language": "Français",
        "name": "Les algorithmes génétiques dans tous leurs états",
        "seats": "tobedefined",
        "speakers": "Julien Sebrien",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "RAML est le langage de **description des API RESTful** qui monte et qui gagne à être connu. Ce langage favorise la réutilisation : Don’t Repeat Yourself ! Avec le nombre d’APIs qui augmente constamment, RAML est donc le bienvenu.\n\nNous verrons donc comment décrire très simplement et rapidement une API, factoriser la description et générer une description interactive à publier en ligne ! Nous adresserons également d’autres activités telles que le mocking, les tests automatisés et la génération de code.",
        "event_end": "2017-04-20T17:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T17:00:00",
        "event_type": "Web et mobile",
        "format": "Tool in Action",
        "goers": "tobedefined",
        "id": "1202",
        "invite_only": "N",
        "language": "Français",
        "name": "RAML une autre façon de concevoir vos APIs RESTful",
        "seats": "tobedefined",
        "speakers": "Sébastien LECACHEUR",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "Imaginez un monde parfait dans lequel chaque utilisateur de votre super application web déployée en prod vous remonte chaque erreur rencontrée !\nEn précisant bien sûr tout le détail pour vous aider à reproduire ce bug et à le corriger :-)\n\nCe monde existe (presque) avec Sentry, une plateforme open-source d'agrégation d'erreur en temps-réel et cross-language (JS, Go, Java, Python, ...)\n\nDurant ce REX, je vous présenterais les possibilités offertes par Sentry dans le contexte d'une application JavaScript, pour en finir avec les \"undefined is not a function\".",
        "event_end": "2017-04-20T18:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T17:30:00",
        "event_type": "Web et mobile",
        "format": "Tool in Action",
        "goers": "tobedefined",
        "id": "1033",
        "invite_only": "N",
        "language": "Français",
        "name": "Sentry : la chasse au bug est ouverte !",
        "seats": "tobedefined",
        "speakers": "Nicolas Pennec",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "Développer un site pour plus de 60 millions d’utilisateurs en plusieurs langues et pour plusieurs marques, okay pourquoi pas.\nFaire du déploiement continu sur une partie critique d’un site (les pages de paiement), ça se tente. Maintenant, mixer les deux et là on commence à avoir du challenge !\n\nDurant cette présentation, nous verrons comment nous avons relevé le défi en nous appuyant sur de meilleures pratiques:\n     - Au niveau ops: automatisations, topologies réseaux, mesures et reporting.\n     - Au niveau dev: feature focus testing (plutôt que le découpage classique unitaire / intégration), notre culture du \"test and learn\" avec l'utilisation du A/B testing tant au niveau produit que sur les implémentations.\n\n\nBien entendu, les solutions évoquées seront un mix entre techniques maison et bonnes pratiques que vous pourrez reprendre telles quelles.",
        "event_end": "2017-04-21T11:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T10:30:00",
        "event_type": "Cloud, Devops, Outils",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "532",
        "invite_only": "N",
        "language": "Français",
        "name": "Retour d'expérience: le déploiement continu chez Expedia",
        "seats": "tobedefined",
        "speakers": "Scheibel Guillaume",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "Avec l’émergence des concepts d’Infrastructure as Code (gestion des infrastructure au travers d’API / Configuration Management / Software Defined Datacenter / Technologies de containerisation) viennent de nouvelles façon de gérer les infrastructures dynamiquement et programmatiquement : élasticité, plateformes autoréparantes, chaos monkey, …\nDans ce talk nous explorerons ces nouveaux paradigmes, en nous appuyant sur des exemples essentiellement basés sur des conteneurs Docker.",
        "event_end": "2017-04-21T12:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T11:30:00",
        "event_type": "Cloud, Devops, Outils",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "573",
        "invite_only": "N",
        "language": "Français",
        "name": "Les infrastructures auto-adaptives",
        "seats": "tobedefined",
        "speakers": "Sylvain REVEREAULT",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "Dans le monde Java, il y a traditionnellement deux approches pour développer un logiciel: _mono-repository_ ou _multi-repository_. Dans le premier, un _repository_ Git immense contient tout votre code, et il est possible d'éditer tous les modules simplement... tant que votre IDE tient la charge. Dans le second, votre application est divisée en modules versionnés séparément. Généralement plus propre, cette approche apporte son lot de contraintes : devoir publier des _snapshots_ pour chaque modification, typiquement, ou encore l'impossibilité de refactorer du code disponible dans un module sur lequel on ne travaille pas.\n\nLes builds composites Gradle réunissent le meilleur des deux mondes: quelle que soit votre approche, vous pouvez composer des builds indépendantes comme si elles n'en n'étaient qu'une seule ! Autrement dit, elles permettent de remplacer, dans un graphe de dépendances, une dépendance par ses sources, la transformant en sous-projet local.\n\nCette nouvelle approche va révolutionner votre façon de développer et vous faire gagner un temps précieux. Venez découvrir ses avantages, au delà de cette simple introduction !",
        "event_end": "2017-04-21T14:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T13:30:00",
        "event_type": "Cloud, Devops, Outils",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "881",
        "invite_only": "N",
        "language": "Français",
        "name": "Builds composites : mort aux snapshots !",
        "seats": "tobedefined",
        "speakers": "Cédric Champeau",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "[JHipster](https://jhipster.github.io/) est un générateur d'applications Spring Boot + AngularJS, entièrement Open Source, qui vous permet de démarrer, développer et mettre en production votre projet en un temps record.\n\nLargement utilisé, il possède une importante communauté de développeurs (plus de 260 contributeurs!), et de nombreuses entreprises l'ont choisi comme framework de référence (plus de 120 sociétés sont officiellement listées!).\n\nDans cette introduction,  [Julien Dubois](https://twitter.com/juliendubois) (le créateur et principal développeur de JHipster) présentera les principales fonctionnalités de l'outil, ces cas d'utilisation classiques, et fera un focus particulier sur les nouveautés de JHipster 4.",
        "event_end": "2017-04-21T15:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T14:30:00",
        "event_type": "Cloud, Devops, Outils",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "406",
        "invite_only": "N",
        "language": "Français",
        "name": "Introduction à JHipster 4",
        "seats": "tobedefined",
        "speakers": "Julien Dubois",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "Clic, clic, clic... Les clics dans la UI Jenkins pour administrer les jobs Maven vous hantent même la nuit ? Vous aimeriez gérer vos jobs comme le code de vos projets ?\n\nSi je vous dis qu'avec 3 lignes de Groovy dans un Jenkinsfile vous pouvez gérer tous vos builds Maven, ça vous dit ?\n\nexoCI { dockerImage = ‘exoplatform/ci:jdk8-maven33’ }\n\nAvant d'en arriver là, il y a un certain nombres d'étapes à ne pas négliger pour migrer efficacement vos jobs Maven existants en “Pipeline as Code” pour Jenkins et Docker.\n\nAvec ce retour d’expérience, vous comprendrez pourquoi et comment nous avons réalisé la migration de plus de 300 jobs “standards” Jenkins de la CI d'eXo Platform..\n\nCe talk est l'occasion de revenir sur les problèmes que nous avons eus et les solutions adoptées, et sur quelques bonnes pratiques autour des builds Maven/Gradle/Android dans des containers Docker, le tout piloté par du Pipeline Jenkins 2.",
        "event_end": "2017-04-21T17:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T16:00:00",
        "event_type": "Cloud, Devops, Outils",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "987",
        "invite_only": "N",
        "language": "Français",
        "name": "REX: Migrez efficacement 300+ jobs Maven en Pipeline avec Jenkins 2 & Docker",
        "seats": "tobedefined",
        "speakers": "Maxime GREAU",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "Vu de la fenêtre du développeur la gestion des environnements de développement et de production est souvent vécue comme une tâche complexe et pénible. Pourtant, il est désormais possible de déployer des environnements fonctionnels en quelques minutes grâce aux solutions d’IaC (Infrastructure as Code). \n\nJe vous propose de découvrir comment Ansible peut vous permettre de déployer un environnement de production et de développement en moins de 30 minutes.",
        "event_end": "2017-04-21T17:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T17:00:00",
        "event_type": "Cloud, Devops, Outils",
        "format": "Tool in Action",
        "goers": "tobedefined",
        "id": "405",
        "invite_only": "N",
        "name": "Automatiser la gestion de vos environnements avec Ansible",
        "seats": "tobedefined",
        "speakers": "Fabien PAITRY",
        "venue": "Track2",
        "venue_id": 2
    },
    {
        "active": "Y",
        "description": "Dans le monde de la Data Science, l’expérimentation et la validation d’algorithmes sont encore très souvent détachées de la notion de développement à l’échelle de la production avec des outillages adéquats. Dans cet atelier, nous proposons d’implémenter un algorithme de Machine Learning réaliste et fun à l’aide de Luigi, déjà devenu un standard lorsqu’il s’agit de composer des pipelines de traitement de données. Nous montrerons comment Luigi permet de facilement capitaliser sur la valeur métier de son code tout en fournissant « out of the box » un outillage très complet sur les préoccupations qui peuvent être communes dans le traitement de la donnée.\nNous favoriserons une approche guidée par les tests et une intégration progressive de l’algorithme dans le code. Ainsi, en plus d'apprendre à maîtriser Luigi, nous donnerons un exemple alliant l'exploration scientifique et le développement logiciel, tout en gardant un bonne qualité de code.\nCet atelier est donc parfaitement d’actualité pour n’importe qui s’intéressant au monde de la data, quel que soit l’axe d’amélioration qu’il souhaite acquérir (Machine Learning, Tips & Tricks Luigi, Craftsmanship, comparaison avec Airflow, ...).",
        "event_end": "2017-04-19T12:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T10:00:00",
        "event_type": "BigData, Analytics et Machine Learning",
        "format": "Université",
        "goers": "tobedefined",
        "id": "1204",
        "invite_only": "N",
        "language": "Français",
        "name": "Luigi : le Machine Learning lui dit merci",
        "seats": "tobedefined",
        "speakers": "Sandra Pietrowska, null null",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "Vous avez surement déjà rencontré un RabbitMQ ou un Apache Kafka dans vos projets sans trop savoir ce que vous pourriez en faire de plus, à part ce qui avait été prévu au départ , déplacer un message d'une application A vers une Application B. Sachez que ces serveurs de messages ou MOM sont capables de remplir plus de fonctionnalités et de fournir des solutions distribuées, résiliente et scalable répondant à plusieurs types de besoins. Vous serez étonné des uses cases que vous arrivez à résoudre avec un simple RabbitMQ et la bonne configuration. C'est ce que nous verrons ensemble durant cette présentation, nous finirons avec des REX tirées de nos missions.",
        "event_end": "2017-04-19T15:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T13:30:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Université",
        "goers": "tobedefined",
        "id": "1147",
        "invite_only": "N",
        "language": "Français",
        "name": "Condensé de MOM illustré",
        "seats": "tobedefined",
        "speakers": "Antonio Gomes Rodrigues, safa mabrouk",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "Apache Cassandra est l'une des bases NoSQL les plus populaires grâce à ses excellentes performances, à son impressionnante scalabilité horizontale et à son architecture hautement résiliante. \n\nMaintenir un cluster Apache Cassandra en production demande une bonne compréhension de son fonctionnement, de choisir les bons paramètres, et d'effectuer les opérations de maintenance dans de bonnes conditions pour garantir un fonctionnement sans interruption.\n\nCette université, aborde les éléments essentiels pour faire tourner Apache Cassandra en production. Parmi lesquels :\n\n* Choix et dimensionnement du matériel\n* Choix des principaux paramètres\n* Stratégies de compaction\n* Ajouter, retirer et remplacer des noeuds\n* Mettre à jour le cluster.\n* Travailler avec plusieurs datacenters\n* Les opérations quotidiennes\n    * repair\n    * sauvegardes\n    * monitoring\n* Purger les données\n* Gérer les incidents\n\nForts de notre expérience sur des clusters de toutes tailles, nous partagerons ici les techniques à mettre en œuvre pour assurer une production sereine d'Apache Cassandra au cours d'une discussion à laquelle nous vous invitons à contribuer par vos questions et vos propres retours d'expérience.",
        "event_end": "2017-04-19T18:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T16:00:00",
        "event_type": "BigData, Analytics et Machine Learning",
        "format": "Université",
        "goers": "tobedefined",
        "id": "1132",
        "invite_only": "N",
        "language": "Français",
        "name": "Apache Cassandra en production",
        "seats": "tobedefined",
        "speakers": "Jérôme Mainaud",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "Vous aimez les concepts de haut niveau, comme les fonctions d’ordre supérieur, un système de typage fort, immutabilité par défaut, closures et des génériques réifiés ?\nLa gestion manuelle de la mémoire n’est pas votre fort ; vous ne voulez pas d’un ramasse miette, ni de pauses dans votre application ?\n\nRust est fait pour vous !\n\nC’est un langage de programmation assez récent, développé par Mozilla qui expose des concepts de haut niveau tout en permettant d’atteindre un niveau de contrôle similaire au C/C++.\n\nSa devise est: “Performance, Sécurité, Productivité, choisissez en trois.“ \n\nIl propose une gestion automatique de la mémoire sans ramasse miettes, ni comptage de référence mais les développeur adeptes du bas niveau ne sont pas en reste, avec la possibilité d’en avoir le contrôle. Le langage Rust permet de très bonnes performances via sa gestion de la mémoire faite au niveau du compilateur et une compilation native.\n\nA travers du live coding, nous illustrerons les concepts de Rust: borrowing, ownership, lifetimes, mutabilitée et génériques.",
        "event_end": "2017-04-20T11:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T10:30:00",
        "event_type": "Langages",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "774",
        "invite_only": "N",
        "language": "Français",
        "name": "Introduction à Rust",
        "seats": "tobedefined",
        "speakers": "Olivier Bourgain, null null",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "Un jour, 3 drôles de barbus 🦁🐻🐼 se retrouvent à une terrasse de café:\n\n**ACTE I - Scène première**\n\n- 🐼 : N'empêche que le nom \"Scalafistes\" ça vous va super bien!  `#trollinside`\n- 🦁 : Non. mec, tu prends des raccourcis ...\n- 🐻 : Ah moi j'aime bien aussi, je revendique même!  Je suis un Scalafiste de l'extrême, et Play vaincra!!!\n- 🦁 : Là, mecs,  vous \"vendez\" une vision totalement réductrice du paysage fonctionnel, Il n'y a pas que Scala dans la vie, prend Haskell et la beauté des théories mathématiques associées, l'intelligence du système de types de Rust qui te propose des monades Option en retour de fonction, le ...\n- 🐼 : Vous me faites marrer avec vos types, si tu sais coder, tu peux faire du fonctionnel en JavaScript `#trollinside` `#oupas`\n- 🐻 : MDR 🐼, moi je fais du Play Scala tous les jours pour des cas d'usage de ouf et je suis sûr que avec ton Node tu feras que de la 💩\n- 🐼 : `#defi` est-ce que vous croyez que nous somme capables d'expliquer ces concepts en termes simples?\n- 🐻🦁 : Oh oui!\n- 🐼 : Quelqu'un reprend un 🍷?\n- 🦁🐻 👍",
        "event_end": "2017-04-20T12:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T11:30:00",
        "event_type": "Langages",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1233",
        "invite_only": "N",
        "language": "Français",
        "name": "Dis … Dessine moi une monade",
        "seats": "tobedefined",
        "speakers": "Philippe Charrière, null null, Quentin ADAM",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "Je veux Alexa à la maison! … Mais on m’a dit, là ça suffit, ça ne va pas être possible! (vous savez le “factor acceptance”…) Même pas mal, j’ai recyclé Bob (vous vous rappelez, mon “robot de télé-présence”), et j’ai commencé à créer une version d’Alexa (mais sans Amazon)\n\nPour ce faire, j’ai fait entrer Hubot dans mon RaspberryPi, j’ai utilisé une API de reconnaissance vocale, utilisé 2,3 composants Grove, fixé le RPI sur un pied de lit … Et tada!!! Maintenant, je peux dire “Ok Bob, allume moi la lampe rouge s’il te plaît”.\n\nJe vais vous expliquer tout ce que j’ai fait, et ce sera aussi l’opportunité de vous expliquer comment fonctionne Hubot (et à quoi il sert), mais aussi de reconnaissance vocale, ...\n\nPS: Pour ceux qui ne connaissent pas Hubot, c’est  l'employé le plus productif de Github... (et le moins cher), facile quand on est un bot.",
        "event_end": "2017-04-20T14:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T13:30:00",
        "event_type": "Objets connectés, IoT, Robotique",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1062",
        "invite_only": "N",
        "language": "Français",
        "name": "Hey Bob! Comment ça va?",
        "seats": "tobedefined",
        "speakers": "Philippe Charrière",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "S’il est possible de créer un bot en quelques minutes, construire des assistants interactifs professionnels représente un réel challenge : assez vite, nous voilà confrontés à des patterns de développements avancés, des enjeux d’architecture propres aux API Web. Sans compter les compétences spécifiques au domaine des bots.\n\nAu cours de cette session, nous présenterons le code de bots permettant de gérer des interactions Chat et Voix, et explorerons les défis rencontrés lors de la construction de ces bots : stockage des contextes, approches NLP, scopes OAuth, meta-données.  \nNous présenterons ensuite les tendances actuelles en terme d’architecture : plateformes de bots, exécution de bots sous forme de micro-fonctions / serverless…\n\nDepuis un an, j'interviens sur la mise en place de bots, et ai pu coder un framework de bots en nodejs, et tester quelques framewokrs de bots. Ce talk est un retour d'expérience.",
        "event_end": "2017-04-20T15:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T14:30:00",
        "event_type": "Objets connectés, IoT, Robotique",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1123",
        "invite_only": "N",
        "language": "Français",
        "name": "Créer un bot, pas si simple. Faisons le point.",
        "seats": "tobedefined",
        "speakers": "Stève Sfartz",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "Et il est fort probable que j'arrive à mes 40 ans et que ce soit toujours le cas. Quand j'étais étudiante, on m'a indiqué que je devais être manager ou chef de projet avant 30 ans. En toute honnêteté, je n'ai même pas essayé car ce n'est pas ce que je veux (du moins pour le moment). Y-a-t-il quelque chose qui cloche en moi ?\n\nBrisons les mythes. Dans cette conférence je vous partagerai à travers mes 10 ans d'expérience, les leçons que j'ai apprise et ce que signifie réellement d'être développeur/euse. Je vous donnerai quelques astuces pour vous aider à sortir de votre zone de confort et devenir de vrais crafts(wo)mens du code. Pour qu'un jour nous portions tous et toutes avec orgueil l'insigne de codeur(euse) sur notre veste : Yes we code !",
        "event_end": "2017-04-20T17:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T16:00:00",
        "event_type": "Agilité, Méthodologie et Tests",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "778",
        "invite_only": "N",
        "language": "Français",
        "name": "J'ai raté ma carrière : j'ai plus de 35 ans et je code encore",
        "seats": "tobedefined",
        "speakers": "Katia Aresti",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "**Vizceral** est une librairie développée par Netflix permettant de visualiser le traffic entre différents services dans une architecture microservices complexe. **Vizceral** s'inscrit dans une logique d'**intuition engineering** permettant de **sentir** l'état du système en un coup d'oeil. Vizeral s'intègre facilement dans une application existante en utilisant **React** ou les **WebComponents**.",
        "event_end": "2017-04-20T17:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T17:00:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Tool in Action",
        "goers": "tobedefined",
        "id": "514",
        "invite_only": "N",
        "language": "Français",
        "name": "Feel your data with Vizceral",
        "seats": "tobedefined",
        "speakers": "Mathieu ANCELIN",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "Près de la moitié des français passent sans le savoir par la solution que nous allons vous présenter; mais je vous rassure ça sera finalement assez soft. Nous verrons comment nous avons avec VertX, RxJava et une goute d'Hystrix nous avons implémenté un reverse proxy écrit en Java. Quelles ont été les difficultés et quels sont les avantages d'une telle solution.\nDestinée à générer des clés de cache pour Varnish dans un contexte de Feature Flipping, comment grâce à VertX/Netty et à son Event Loop notre proxy réussi à  effectuer ses traitements en moins d'une milliseconde tout en supportant plusieurs milliers de requêtes par seconde.",
        "event_end": "2017-04-20T18:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T17:30:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Tool in Action",
        "goers": "tobedefined",
        "id": "944",
        "invite_only": "N",
        "language": "Français",
        "name": "Les stars du X : VertX, RX, HystriX : La seule conférence PEGI 18",
        "seats": "tobedefined",
        "speakers": "Gabriel Magniez",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "Au printemps 2016, le premier article de presse sur les \"Panama papers\" a été publié. Il s'agit de la plus grande 'fuites' de l'histoire avec plus de 3T de données brutes.\nCette conférence vous détaillera les technologies que l'ICIJ (International Consortium Of Investigate Journalists) a utilisé pour fournir aux journalistes une interface simple pour leur recherche. \n\nVia une demonstration sur les données des panama papers, je vous présenterai nottament le coeur du syste?me, a savoir la base de données graph Neo4j avec son moteur de requête Cypher.",
        "event_end": "2017-04-21T11:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T10:30:00",
        "event_type": "BigData, Analytics et Machine Learning",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "783",
        "invite_only": "N",
        "language": "Français",
        "name": "Retour sur les panama papers et les bases de donnés graphe",
        "seats": "tobedefined",
        "speakers": "Benoit Simard",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "Lorsque vous injectez des données dans elasticsearch, vous pouvez avoir besoin de réaliser des opérations de transformation assez simples. Jusqu'à présent, ces opérations devaient s'effectuer en dehors d'elasticsearch, avant l'indexation proprement dite.\n\nSouhaitez la bienvenue à `Ingest node` ! Un nouveau type de noeud qui vous permet justement de faire cela.\n\nCe talk explique le concept de `Ingest Node`, comment l'intégrer avec le reste de la suite logicielle Elastic et comment développer son propre plugin Ingest par la pratique en montrant comment j'ai développé le plugin `ingest-bano` pour enrichir des adresses postales et/ou des coordonnées géographiques françaises (pour l'instant).\n\nCe talk parlera également de l'API de réindexation qui peut également bénéficier du pipeline d'ingestion pour modifier vos données à la volée lors de la réindexation.",
        "event_end": "2017-04-21T12:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T11:30:00",
        "event_type": "BigData, Analytics et Machine Learning",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1092",
        "invite_only": "N",
        "language": "Français",
        "name": "Ingest node : (ré)indexer et enrichir des documents dans Elasticsearch",
        "seats": "tobedefined",
        "speakers": "David Pilato",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "Si l'Internet de 2016 déborde de vidéos de chatons trop mignons, dans quelques années, nos réseaux véhiculeront des chats de Shrödinger.\n\nSuperposition d'état, indétermination, intrication ... L'informatique quantique est à nos portes. Elle sort doucement de la sphère théorique pour devenir une réalité de laboratoire, voire de premières solutions industrielles. Loin de pures spéculations, elle permettra de casser la sécurité des infras \"legacy\" de 2016 tout en offrant en contrepartie une sécurité inviolable, même par la NSA. Le tout étant de savoir lequel arrivera en premier.",
        "event_end": "2017-04-21T14:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T13:30:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "850",
        "invite_only": "N",
        "language": "Français",
        "name": "Quand Internet sera gouvernée par les |chats> de Shrödinger",
        "seats": "tobedefined",
        "speakers": "Nicolas De Loof",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "Après la machine virtuelle et le container, Unikernel est arrivé ! Cet OS \"light\" qui n'embarque que les composants essentiels à l'application, rendrait-il déjà les conteneurs has been ? Quelles sont les bases de cette technologie, et qu'apporte t'elle vraiment ? Cette présentation sera aussi l'occasion de déployer ensemble une application packagée au format Unikernel sur VirtualBox.",
        "event_end": "2017-04-21T15:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T14:30:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "926",
        "invite_only": "N",
        "language": "Français",
        "name": "Introduction à Unikernel",
        "seats": "tobedefined",
        "speakers": "Tomas Rodriguez, Jean-Baptiste Claramonte",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "L'agilité n'est pas un luxe dans une startup, c'est question de survie. La valeur doit être délivrée et confrontée au plus tôt au marché et aux clients. L'effet tunnel n'est pas une option. La mort guette régulièrement la vie d'une startup.\n\nNous verrons comment l'équipe produit de Saagie s'est organisé autour de l'approche Kanban pour répondre à ce système fortement contraint. Nous partagerons aussi les erreurs et les leçons apprises.\n\nLa présentation sera agrémentée d'un parallélisme avec un empire qui a eu une croissance de startup : l'empire mongol.\n\n#kanban #leanstartup #noestimates #managertools",
        "event_end": "2017-04-21T17:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T16:00:00",
        "event_type": "Agilité, Méthodologie et Tests",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "760",
        "invite_only": "N",
        "language": "Français",
        "name": "Kanban from the startup warfare",
        "seats": "tobedefined",
        "speakers": "Chéné Youen",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "JOOQ et JOO? sont des solutions open-source permettant d'intégrer proprement votre application Java avec votre base de données. Quoi de nouveau sous le soleil me diriez-vous ? Après tout la problématique de mapping objet-relationnel est au moins aussi vieille que la plateforme Java. Mais depuis Java 8, JOOQ permet d'utiliser l'API Stream du JDK avec le mapping objet-relationnel, ce qui, couplé avec JOO?, a pour effet d'écrire des DAO plus simples et dans un paradigme fonctionnel. Au cours de ce tools in action nous allons vous présenter les avantages que nous pouvons tirer des frameworks JOOQ et JOO?, par rapport à du JDBC pur sucre, JPA sans oublier Spring JDBC Template. Cerise sur le gâteau, nous vous indiquerons comment simplement introduire JOOQ et JOO? dans votre code existant.",
        "event_end": "2017-04-21T17:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T17:00:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Tool in Action",
        "goers": "tobedefined",
        "id": "1137",
        "invite_only": "N",
        "name": "JOOQ et JOO? : Comment écrire du code propre dans vos DAO",
        "seats": "tobedefined",
        "speakers": "Mathieu Gandin",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "### Comment traiter des centaines de millions d'évènements en streaming.\n\nJe vous propose un REX sur la solution mise en place chez PagesJaunes pour la corrélation d'événements en temps réel et des notifications d'alertes instantanées sur près de 300 millions d'événements par jour.\nJe détaillerai la démarche de mise en place de l'architecture Big Data ainsi que le choix des technologies mises en oeuvre.",
        "event_end": "2017-04-19T11:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T10:00:00",
        "event_type": "BigData, Analytics et Machine Learning",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1249",
        "invite_only": "N",
        "language": "Français",
        "name": "Million Dollar Logs",
        "seats": "tobedefined",
        "speakers": "Yann Vanderstockt",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "Apache Spark propose une API Java comme langage principal, mais est-elle aussi puissante que l'API Scala ? Utilise-t-elle toutes les fonctionnalités du langage, comme les lambdas ? Comment intégrer Spark à nos outils de tests unitaires et à notre code base existante ? Nous allons donc plonger dans l'API Java de Spark avec des exemples et du live coding, en couvrant l'usage du cœur de Spark, la gestion des dépendances, les tests unitaires avec JUnit, le lancement à partir d'un IDE et l'intégration du code Spark avec notre code base Java existante. Depuis Spark 2.0, l'API DataFrame unifiée entre les langages rend Spark plus facile à utiliser et plus rapide à exécuter en Java, mais il existe pour l'instant peu de documentation sur des cas d'usages spécifiques, et plusieurs particularités de syntaxe rendent le code Scala difficile à convertir en Java. Les slides et le live coding vont présenter les bons et les mauvais moments que notre équipe de développement Java a rencontrés en utilisant Spark.",
        "event_end": "2017-04-19T12:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T11:00:00",
        "event_type": "BigData, Analytics et Machine Learning",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "923",
        "invite_only": "N",
        "language": "Français",
        "name": "Apache Spark : Deep dive dans l'API Java pour développeur",
        "seats": "tobedefined",
        "speakers": "Alexandre Dubreuil",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "L’essor de l’utilisation des containers a conduit à une réflexion autour du système d’exploitation qui va gérer ses containers. Les distributions Linux actuelles se révèlent souvent embarquer des packages/binaires inutiles dans le cadre de l’utilisation des containers mais aussi potentiellement faillibles.\n\nC’est de ce constat que sont parties les équipes de Core OS pour créer Container Linux OS. Après une description des différentes fonctionnalités de Container Linux OS et les avantages présentés par ceux-ci, nous ferons alors un tour vers les différents outils/services développés autour de cette redéfinition d’une distribution Linux.  Avec ces éléments, les équipes de Core OS développent de fait un écosystème complet autour des containers.",
        "event_end": "2017-04-19T14:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T13:30:00",
        "event_type": "Cloud, Devops, Outils",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1068",
        "invite_only": "N",
        "language": "Français",
        "name": "The Core OS galaxy",
        "seats": "tobedefined",
        "speakers": "Nicolas Diez",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "La DockerCon a lieu _pile_ en même temps que le BreizhCamp, avouez que c'est ballot !\nPas de panique, nous allons vous permettre de suivre les annonces majeures, et sans même devoir débourser le billet d'avion pour Austin TX. \nPeut être même quelques démos si on a le temps de les préparer dans la nuit, effet Bonaldi garanti :D",
        "event_end": "2017-04-19T15:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T14:30:00",
        "event_type": "Cloud, Devops, Outils",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "391",
        "invite_only": "N",
        "language": "Français",
        "name": "La DockerCon comme si vous y étiez",
        "seats": "tobedefined",
        "speakers": "Nicolas De Loof",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "Récemment, Github et Google ont sorti sur BigQuery un énorme dataset avec tout le code open source stocké dans Github, à partir du projet Github Archive.\n\nQu'est-ce que l'on peut apprendre d'un tel dataset ? Dans cette session, nous allons nous focaliser sur des exemples autour de projets utilisant le langage Apache Groovy, l'outil de build Gradle, ou le framework Grails. Quelles sont les dépendances les plus communes ? Quels sont les frameworks les plus utilisés ? Quelles pratiques de code l'on retrouve souvent ? Les exceptions les plus lancées ? Les plugins Gradle les plus fréquents ? Et plus encore.\n\nDès lors que vous aurez vu comment faire, vous pourrez faire vos propres recherches sur d'autres langages ou outils !",
        "event_end": "2017-04-19T17:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T16:00:00",
        "event_type": "BigData, Analytics et Machine Learning",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1199",
        "invite_only": "N",
        "language": "Français",
        "name": "Qu'apprend-on de millions de fichiers dans Github ?",
        "seats": "tobedefined",
        "speakers": "Guillaume Laforge",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "Un incident en production coute en moyenne 115 000€*, comment faire en sorte que des services non critiques soient isolés automatiquement afin d'éviter un impact global sur nos services?\nLa solution? Le circuit-breaker. Nous verrons comment mesurer la santé de nos services (ou ceux de nos partenaires) et comment automatiser leur mise en quarantaine.\nAprès avoir prouvé la nécessité de la mise en place d'un tel dispositif nous détaillerons  la solution technique que nous avons mise en place à base d'annuaire de service (Consul) et de load-balancer logiciel (HAProxy).\n\n\\* _http://www.usine-digitale.fr/editorial/un-incident-informatique-coute-en-moyenne-115-000-euros.N455372 _",
        "event_end": "2017-04-19T18:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T17:00:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "454",
        "invite_only": "N",
        "language": "Français",
        "name": "Circuit-Breaker: Comment disjoncter pour éviter de \"péter les plombs\"",
        "seats": "tobedefined",
        "speakers": "Gabriel Magniez",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "Infrastructure AWS hautement résiliante, architecture blue-green, déploiements entièrement automatisés, application Symfony découplée en microservices gérés par un API Manager... Nous avions tous les outils pour former une équipe Devops performante. Pourtant il nous manquait un ingrédient essentiel: la pratique, qui nous a permis d'améliorer significativement la manière dont nous collaborons !\n\nC'est pourquoi, nous, Pauline, ops, et Aurore, dev, souhaitons revenir avec vous sur un an de projet qui a abouti au lancement de la nouvelle plateforme web de Tarkett, leader mondial du secteur des revêtements de sols. Grâce à des exemples concrets, vous découvrirez nos bonnes idées, aussi bien techniques qu'organisationnelles, mais aussi les erreurs que nous avons commises et comment nous les avons corrigées afin que vous puissiez les éviter.",
        "event_end": "2017-04-20T11:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T10:30:00",
        "event_type": "Cloud, Devops, Outils",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1049",
        "invite_only": "N",
        "language": "Français",
        "name": "Dev rencontre Ops: 1 an après",
        "seats": "tobedefined",
        "speakers": "Aurore Malherbes, Pauline Bourjot",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "Si Docker a produit un engouement fulgurant et accru considérablement la vélocité de production de software, il est très facile de totalement perdre le contrôle de sa production d'images. Un pipeline de gestion des images Docker, comme pour la gestion du cycle de vie d'un software classique est vitale. Si les nouveaux outils amènent de nouveaux paradigmes nous verrons comment les modèles éprouvés peuvent s'appliquer ou non et quels sont leurs impacts sur le cycle de vie du développement logiciel.",
        "event_end": "2017-04-20T12:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T11:30:00",
        "event_type": "Cloud, Devops, Outils",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1080",
        "invite_only": "N",
        "language": "Français",
        "name": "Patterns et antipatterns pour la gestion des cycles de vie des images Docker",
        "seats": "tobedefined",
        "speakers": "Jonathan Roquelaure",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "Fact 1 : ` logger.debug(\"pouet\") ;`\n\nQui n'a jamais écrit ce genre de chose? \nPersonne, ou alors vous êtes vraiment quelqu'un de vraiment ... d'intéressant :)\n\nLes logs font partie de *TOUS* les développements d'apps. Mais très souvent, cela se fait à l'instinct ;  et c'est normal, très peu d'équipes ont codifié cette partie.\n\nFinalement, pourquoi ne pas passer quelques minutes à structurer le logging, comme pour n'importe quelle feature ? Pourquoi, tant que nous y sommes, en faire un élément de notre architecture ?\n\n* Nos apps ont plein de choses à nous dire, et beaucoup de choses passent déjà par les logs\n* Les logs sont partout, des browsers aux data stores, traquant inlassablement les erreurs, les query, les temps de réponses, et les actions des users ...\n* Établir des liens entre tous les modules et micro-services des stacks\n* Avec un peu de méthode, les logs vont fondamentalement changer votre vision produit.\n\nEt puis surtout c'est super simple :)\nPetit feedback des patterns et anti-patterns qui fonctionnent;",
        "event_end": "2017-04-20T14:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T13:30:00",
        "event_type": "Agilité, Méthodologie et Tests",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "557",
        "invite_only": "N",
        "language": "Français",
        "name": "Logging-driven development --  Parce que les \"Logs are NOT JUST logs\"",
        "seats": "tobedefined",
        "speakers": "Guillaume Polaert, null null",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "`Docker` (et le principe des conteneurs en général) est fortement lié à la promesse d’une image unique qui peut tourner partout et que le même artféfact peut être utilisé sur n’importe quel environnement “runtime” (du poste de développement jusqu’en production!) sans avoir à reconstruire une image à chaque fois.\n\nMais comment atteindre cet objectif de manière pratique et efficace tout en étant capable de conserver l’historique de la configuration de vos applications sur les différents environnements?\n\nCette présentation vous propose de voir comment les outils `git` et `confd` peuvent vous aider dans cette mission critique sans perdre la flexibilité nécessaire pour que vos devs et vos ops puissent cohabiter sereinement.\n\nLe bonus: la méthode présentée n’est aucunement liée à Docker (ou à la conteneurisation) et est valable quelque soit le langage utilisé pour développer vos applications!\n\nNote: les démos seront réalisées en s’appuyant sur l’orchestrateur docker “Rancher”",
        "event_end": "2017-04-20T15:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T14:30:00",
        "event_type": "Cloud, Devops, Outils",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "512",
        "invite_only": "N",
        "language": "Français",
        "name": "Containers et configuration: de la promesse au concret avec git et confd",
        "seats": "tobedefined",
        "speakers": "Christophe Furmaniak",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "Il y a bien un moment, j'ai écrit puis lancer un programme.\nDepuis lors, il me regarde, il prend des clichés de mon écron toutes les minutes, les réduit à un timbre postale, et les stocke.\n\nQu'est-ce que je peux apprendre de ses images réduites à 0,1% de mon écran ?  Beaucoup, c'est effrayant à dire !\n\nEt je me retrouve ainsi avec un bien beau projet de DataScience !\n\nA travers cette session, je vais vous montrer les différentes techniques d'apprentissage automatique que j'ai utilisées pour créer plusieurs modèles de mon activité à partir de ces traces minissimes.\nNous aborderons ainsi les bases du Machine Learning à travers une étude de cas appliquée à un contexte réel.",
        "event_end": "2017-04-20T17:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T16:00:00",
        "event_type": "BigData, Analytics et Machine Learning",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1017",
        "invite_only": "N",
        "language": "Français",
        "name": "Je vois avec mes yeux",
        "seats": "tobedefined",
        "speakers": "Jeff Abrahamson",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "__Vue.js__ est entré dans la cour des grands en 2016, 2017 sera son année ! Alors, partons à la découverte de ce framework JavaScript, simple, léger et offrant une excellente alternative à Angular ou React, pour ceux qui souhaitent ne pas investir trop de temps dans l’apprentissage d’un nouveau framework. Lors de ce talk, vous verrez comment construire une web app orientée composants en quelques minutes, que même un dev Java pourrait le faire !",
        "event_end": "2017-04-20T17:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T17:00:00",
        "event_type": "Web et mobile",
        "format": "Tool in Action",
        "goers": "tobedefined",
        "id": "988",
        "invite_only": "N",
        "language": "Français",
        "name": "Vue.js, même un dev Java peut en faire !",
        "seats": "tobedefined",
        "speakers": "Bruno Bonnin",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "L'écriture de tests unitaires est une technique courante de qualité logicielle.\n\nAdossés à des pratiques telles que le **Test Driven Development** ou le **Behaviour Driven Development**, ces tests se retrouvent au coeur de notre travail quotidien de développeur.\n\nAinsi amenés à évoluer, se multiplier, et être maintenus au cours du temps au même titre que le code applicatif, ils peuvent facilement échapper à notre contrôle.\n\n_Comment dès lors évaluer en continu leur pertinence?_\n\nNous vous proposons le concept de **mutation testing** en prenant l’exemple concret de **Humbug**, framework de mutation testing utilisé dans le monde **PHP**.",
        "event_end": "2017-04-20T18:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T17:30:00",
        "event_type": "Agilité, Méthodologie et Tests",
        "format": "Tool in Action",
        "goers": "tobedefined",
        "id": "968",
        "invite_only": "N",
        "language": "Français",
        "name": "Humbug, un framework de mutation testing",
        "seats": "tobedefined",
        "speakers": "Serge HARDY, Nastasia Saby",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "Avez-vous déjà rêvé d'un monde dans lequel votre voix compte ? Dans lequel les échanges sont libres et transparents ? Ce monde est à portée de main, probablement à cet instant dans votre poche. Nous annonçons cette révolution : la **blockchain dans votre smartphone !**\n\n- \"La blockchain dans mon smartphone ? Ca ne marchera jamais !\"\n- Mais qui a dit que la Blockchain devait rester sur nos postes de travail ? Peut-être les *2,21 Gigowatts* de consommation électrique annoncés par certains, mais nous allons vous démontrer le contraire.\n\nAprès une introduction aux Blockchains et en particulier la Blockchain Ethereum, à leurs usages et perspectives, nous vous montrerons comment construire une \"Dapp\" mobile Android Ethereum à l'aide du client Blockchain Geth et de la librairie Ethereum-Java.\n\nSoyez prêts à participer à la phase de test ! ;-)",
        "event_end": "2017-04-21T11:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T10:30:00",
        "event_type": "Web et mobile",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "878",
        "invite_only": "N",
        "language": "Français",
        "name": "Smartphone et blockchain, armes de révolution massive",
        "seats": "tobedefined",
        "speakers": "Damien LECAN, Guillaume NICOLAS",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "Que vous soyez développeur, chef de projet ou autre vous voyez tous les jours des graphiques dans les journaux, on vous demande de faire des jolies courbes pour des reportings. Mais quelles informations mettre dedans ? Les données sont représentées de manière visuelle depuis longtemps, mais comment faire pour les rendre plus efficaces et plus percutantes ? \nJe vous présenterai l'histoire de la datavisualisation et à quel est son objectif. Puis, au travers d'exemples concrets et de démonstrations d'outils, nous verrons quelques \"dark patterns\" et les techniques à mettre en œuvre pour avoir des graphiques qui transmettent les informations de manière efficace.",
        "event_end": "2017-04-21T12:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T11:30:00",
        "event_type": "Web et mobile",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1162",
        "invite_only": "N",
        "language": "Français",
        "name": "La datavisualisation pour les nuls",
        "seats": "tobedefined",
        "speakers": "Thomas Fournaise",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "Faire des interfaces et des expériences, c'est bien. Faire des interfaces et des expériences qui fonctionnent et qui sont trendy, c'est mieux.\nVous êtes UX expert, UI dev, CMO, tech evangelist, ou décideur? Vous faites du desktop, du mobile ou de l'embarqué? Venez découvrir le top 10 des tendances en UX/UI de l'année, pour rester hype.\nNous parlerons d'assets animés, le layout en couches, les micro-interactions, les cards via quelques exemples bien sentis, et nous nous laisserons aller à quelques prédictions concernant les réalités alternatives et le web en 3D.",
        "event_end": "2017-04-21T14:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T13:30:00",
        "event_type": "Web et mobile",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "534",
        "invite_only": "N",
        "language": "Français",
        "name": "Les Trends UX/UI pour 2017",
        "seats": "tobedefined",
        "speakers": "michel Rousseau",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "Notre challenge : refondre une grosse appli Symfony 2 avec 150 bundles  ; très mauvaises performances et le code inmaintenable.\n\nNous allons vous raconter et vous montrer ce qu'on a mis en place avec une équipe de 3 dev back et un intégrateur :\n- API simple en symfony,\n- script de migration pour synchroniser la BDD mysql,\n- un front Isomorphic avec TypeScript et React. \n\nÇa va parler API REST Symfony 3, DDD, Swagger et SQL",
        "event_end": "2017-04-21T15:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T14:30:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "1157",
        "invite_only": "N",
        "language": "Français",
        "name": "REX refonte d'une appli avec un front Isomorphic",
        "seats": "tobedefined",
        "speakers": "Cécile Especel, David Jegat",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "De nouvelles API arrivent afin de permettre d’avoir une vrai expérience offline-first.\n- La cache API permet par exemple de stocker facilement des assets et d’afficher une application web même sans connexion.\n- L’API background sync permet d’enregistrer des actions que l’on pourra exécuter une fois qu’on aura une connexion stable.\n- IndexedDB permet de stocker des données dans une base de donnée locale.\n\nNous verrons comment intégrer ces 3 technologies à une application durant un live coding",
        "event_end": "2017-04-21T17:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T16:00:00",
        "event_type": "Web et mobile",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "854",
        "invite_only": "N",
        "language": "Français",
        "name": "Ici le commandant de bord, on passe en mode avion !",
        "seats": "tobedefined",
        "speakers": "Olivier Leplus, Wassim Chegham",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "La notion d'import/export de modules d'Ecmascript 6 est une fonctionnalité très appréciable et attendue depuis longtemps de manière native dans le langage.\n\n\nLes packageurs \"Webpack 2\" et \"Rollup.js\" comportent une fonctionnalité elle aussi très intéressante appelée \"tree-shaking\". Celle-ci permet d'obtenir un \"bundle\" final plus léger en ne sélectionnant que le code \"utile\" en production.\n\n\nNous allons découvrir dans ce tool in action :\n- les avantages de cette approche par rapport à l'approche traditionnelle de l'élimination de code des optimisateurs de code Javascript comme UglifyJs par exemple.\n- un exemple simple d'utilisation avec Webpack 2 et Rollup.js\n- un autre exemple avec l'utilisation de la librairie lodash ré-écrite en 2015 en Ecmascript 6",
        "event_end": "2017-04-21T17:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T17:00:00",
        "event_type": "Web et mobile",
        "format": "Tool in Action",
        "goers": "tobedefined",
        "id": "387",
        "invite_only": "N",
        "language": "Français",
        "name": "Tree shaking - Déployer moins de code en production",
        "seats": "tobedefined",
        "speakers": "Vincent Ogloblinsky",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "La programmation visuelle, vous connaissez ? \n\nScratch, Blockly, MBlock font partie des langages que nous utilisons avec les enfants pour leur apprendre à programmer. \n\nSi on l'utilise avec les enfants, on peut l'utiliser avec les grands aussi ! \n\nIOT, appels REST, tests fonctionnels... jusqu'où peut-on aller avec ces langages ? Comment sont-ils construits ?\n\nAprès une présentation de quelques outils, nous vous proposons de regarder sous le capot de Blockly et de créer vos propres blocs. Et pourquoi pas créer votre propre DSL pour faire coder à votre place les tests fonctionnels ?",
        "event_end": "2017-04-19T12:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T10:00:00",
        "event_type": "Langages",
        "format": "Lab",
        "goers": "tobedefined",
        "id": "388",
        "invite_only": "N",
        "language": "Français",
        "name": "[LAB] Code like a child",
        "seats": "tobedefined",
        "speakers": "Cécilia Bossard, Jean Paliès",
        "venue": "Track5 (labs)",
        "venue_id": 5
    },
    {
        "active": "Y",
        "description": "Il nous aura fallu attendre 2 ans pour avoir cette nouvelle version du fameux framework de Google. L'objectif est ambitieux: devenir le framework front le plus performant. Nous vous proposons de naviguer sur un projet Angular  pour comprendre ce qui le rend plus rapide. Nous parlerons de ce qui est proposé en natif (détection du changement, lazy loading et pre loading, compilation...) mais aussi de ce que vous pouvez mettre en place (compilation AOT, tree shaking, universal...)",
        "event_end": "2017-04-19T14:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T13:30:00",
        "event_type": "Web et mobile",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "741",
        "invite_only": "N",
        "language": "Français",
        "name": "Angular (2) et performances",
        "seats": "tobedefined",
        "speakers": "cyril balit",
        "venue": "Track5 (labs)",
        "venue_id": 5
    },
    {
        "active": "Y",
        "description": "L'automne 2016 a marqué pour Simplon le lancement de deux promotions en reconversion professionnelle vers le métier de développeur Java.\n\nAprès un brève présentation de Simplon, startup de l'éducation dans le numérique, de ses premiers contacts avec la communauté Java et la création d'un parcours de formation au développement Java, je vous partagerai l'expérience vécue avec une promotion d'apprenants dont la moyenne d'âge dépasse les 50 ans et dont la formation en alternance sur 8 mois terminera en juin.\n\nCurieux de voir la mise en oeuvre de la pédagogie active, de découvrir les compétences que des novices dans le développement (voire dans l'informatique) auront pu acquérir, des questions qu'un dispositif de reconversion professionnelle soulèvent ?\nVenez passer un moment enrichissant en compagnie des formateurs, apprenants, et de l'équipe pédagogique.",
        "event_end": "2017-04-19T15:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T14:30:00",
        "event_type": "Langages",
        "format": "Conférence",
        "goers": "tobedefined",
        "id": "392",
        "invite_only": "N",
        "language": "Français",
        "name": "Si t'es pas développeur à 40 ans ... il n'est pas trop tard !",
        "seats": "tobedefined",
        "speakers": "Eric SIBER",
        "venue": "Track5 (labs)",
        "venue_id": 5
    },
    {
        "active": "Y",
        "description": "Nous calculerons des indicateurs en temps réel depuis kafka pour traiter les données avec spark streaming et enfin les stocker dans Mongo DB.\n\nNous visualiserons les données avec une application web.\n\nPas besoin d'installer toutes ces technologies, une plateforme Saagie sera à disposition. \n\nViens juste avec ton IDE favoris et un langage compatible (java 8 ou Scala)!",
        "event_end": "2017-04-19T18:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-19T16:00:00",
        "event_type": "BigData, Analytics et Machine Learning",
        "format": "Lab",
        "goers": "tobedefined",
        "id": "762",
        "invite_only": "N",
        "language": "Français",
        "name": "Set up a Kappa architecture",
        "seats": "tobedefined",
        "speakers": "Chéné Youen, Aurélien Vandel",
        "venue": "Track5 (labs)",
        "venue_id": 5
    },
    {
        "active": "Y",
        "description": "Venez participer pendant 2h à ce challenge de conception d’intelligence artificielle.\n\nLes règles sont simples :\n* une bataille de personnages médiévaux en un contre un\n* une API REST d’attaque à disposition\n* une application web de visualisation du combat en live\n\nVous n’avez plus qu’à coder votre IA avec votre langage préféré, réagir en conséquence et affronter l’IA du serveur ou d’autres participants de ce lab.",
        "event_end": "2017-04-20T12:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T10:30:00",
        "event_type": "Web et mobile",
        "format": "Lab",
        "goers": "tobedefined",
        "id": "1184",
        "invite_only": "N",
        "language": "Français",
        "name": "Coding Game Challenge",
        "seats": "tobedefined",
        "speakers": "BRECHET Matthieu, null null, Vincent Ogloblinsky, null null",
        "venue": "Track5 (labs)",
        "venue_id": 5
    },
    {
        "active": "Y",
        "description": "Aujourd'hui, les frameworks hybrides imposent leur propre interface (e.g. Cordova et ses dérivés), faisant fi des recommandations de chaque plateforme, ou nécessite d'utiliser des composants Web différents pour cela (e.g. React Native), supprimant ainsi leur principal avantage, la mutualisation du code.\n\n[Cobalt](https://cobaltians.org/), \"Made in Breizh\", propose des composants natifs pour chaque plateforme, accessibles depuis une API Web commune et offre bien plus pour réconcilier développeurs Web et développeurs natifs.\n\nVenez prendre en main ce framework et découvrir ses avantages face aux géants avec les 2 contributeurs principaux du projet\n\nPré-requis:\n\n- Dernière version d'[Android Studio](https://developer.android.com/studio/index.html) et du [SDK Android](https://developer.android.com/studio/intro/update.html#sdk-manager) (Tools, Platform-Tools, Build-Tools, SDK Platform, Android Support Repository et Library) et au moins un simulateur (System Image) ou smartphone/tablette Android 2.3+\n- Pour les possesseurs de Mac qui voudraient tester sur iOS, dernière version d'[Xcode](https://itunes.apple.com/fr/app/xcode/id497799835) et au moins un [simulateur](https://developer.apple.com/library/content/documentation/IDEs/Conceptual/iOS_Simulator_Guide/GettingStartedwithiOSSimulator/GettingStartedwithiOSSimulator.html#//apple_ref/doc/uid/TP40012848-CH5-SW10) iOS 8+",
        "event_end": "2017-04-20T15:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T13:30:00",
        "event_type": "Web et mobile",
        "format": "Lab",
        "goers": "tobedefined",
        "id": "1006",
        "invite_only": "N",
        "language": "Français",
        "name": "Cobalt, l'hybride qui respecte les utilisateurs",
        "seats": "tobedefined",
        "speakers": "Sébastien Vitard, Guillaume Gendre",
        "venue": "Track5 (labs)",
        "venue_id": 5
    },
    {
        "active": "Y",
        "description": "3h … Certaines personnes sortent d’un canyon en 127 heures et avec un bras en moins, nous vous proposons de gardez vos bras pour construire et mettre en place votre SI de demain : du docker, du cluster d’OS et tout les outils nécéssaires à l’automatisation de vos projets pour partir dans le cloud dès le lendemain, et tout ça en 3 heures !",
        "event_end": "2017-04-20T18:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T16:00:00",
        "event_type": "Cloud, Devops, Outils",
        "format": "Lab",
        "goers": "tobedefined",
        "id": "477",
        "invite_only": "N",
        "language": "Français",
        "name": "Emporter votre fabrique de développement",
        "seats": "tobedefined",
        "speakers": "Antoine Stalin, Yan Matagne",
        "venue": "Track5 (labs)",
        "venue_id": 5
    },
    {
        "active": "Y",
        "description": "Les Progressive Web Apps (PWA) combinent le meilleur du web et des apps. Les utilisateurs peuvent s'en servir directement dès qu'ils s'y rendent avec leur navigateur, sans avoir besoin d'installer quoi que ce soit. Et ensuite, à fur et à mesure qu'ils passent du temps sur l'application, celle-ci devient plus puissante : elle charge très rapidement, même sur des réseaux dégradés, envoie des notifications, s'installe sur la page d'accueil du téléphone ou sur le bureau de l'ordinateur, se charge en écran complète sans la barre d'URL et recherche du navigateur... Bref, il offre à l'utilisateur une expérience semblable à une application native.\n\nEt depuis le dernier Google I/O, construire des PWA avec Polymer est devenu un jeu d'enfant ! En utilisant la puissance et la simplicité des composants web et le CLI de Polymer, toutes les étapes fastidieuses de la construction manuelle d'une PWA sont  gommés.\n\nDans ce lab nous vous proposons de créer pas à pas votre première application web progressive, tout en apprenant les bases de Polymer si vous ne les connaissez pas.  Le tout autour d'un sujet qui rassemble, comme c'est la bière, car vous allez créer une application pour gérer une base de données de bières: *pwa-beers*. \n\nEn partant vous aurez créé une PWA utilisable partout, vous aurez compris ce qui rend ces apps si puissantes et intéressantes pour tout développeur web et ou mobile, et en bonus vous aurez les bases pour développer des apps avec des web components en Polymer. Le tout basé sur notre système de tutorials pas à pas qui garanti que vous serez pas perdus en chemin, la bonne humeur et l'accent espagnol en plus...",
        "event_end": "2017-04-21T12:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T10:30:00",
        "event_type": "Web et mobile",
        "format": "Lab",
        "goers": "tobedefined",
        "id": "888",
        "invite_only": "N",
        "language": "Français",
        "name": "Progressive Web Apps avec Polymer",
        "seats": "tobedefined",
        "speakers": "Horacio Gonzalez",
        "venue": "Track5 (labs)",
        "venue_id": 5
    },
    {
        "active": "Y",
        "description": "Essayez de créer un code qui vous ne considérez pas comme étant “legacy”.\n\nJe jouerai le rôle de votre client et j'utiliserai 20 techniques différentes pour vous faire échouer\n\nVous allez échouer.\n\nNous allons débattre les techniques utilisées, comment elles arrivent dans la vraie vie et comment les combattre dans vos projets.\n\nTous les langages sont bienvenus. Vous aurez besoin d'un portable avec votre environment, le hands-on se fera par petites équipes montés sur place.",
        "event_end": "2017-04-21T15:30:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T13:30:00",
        "event_type": "Agilité, Méthodologie et Tests",
        "format": "Lab",
        "goers": "tobedefined",
        "id": "1174",
        "invite_only": "N",
        "language": "Français",
        "name": "Le Kata Kebab: Luttez contre les raisons systémiques de la tristesse de votre code",
        "seats": "tobedefined",
        "speakers": "Romeu MOURA",
        "venue": "Track5 (labs)",
        "venue_id": 5
    },
    {
        "active": "Y",
        "description": "En 15 minutes vous comprendrez pourquoi l'opérateur + de JavaScript semble etre si capricieux ou pourquoi une fonction ne renvoie pas ce que vous attendez. Nous verrons aussi pourquoi parfois la console de votre navigateur favoris vous induit en erreur et quel sont les outils pour bien comprendre ce que fait votre code JavaScript",
        "event_end": "2017-04-20T13:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T12:45:00",
        "event_type": "Langages",
        "format": "Quickie",
        "goers": "tobedefined",
        "id": "414",
        "invite_only": "N",
        "language": "Français",
        "name": "WTFJS!! Comprendre les ambiguïtés de la syntaxe en JavaScript pour éviter les pièges",
        "seats": "tobedefined",
        "speakers": "Grégory Houllier",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "Vendredi 19h, un client  veut réaliser sa clôture comptable dans le week-end et me contacte en urgence : 500 sur l'application Web, 1 service comptable au chômage ! Chaque année, même cirque: le mot de  passe a expiré, il faut le changer. Maurice s'y est collé l'année dernière, mais bien sûr, il n'a rien noté... Admin123*, Password456! ou autre Azerty0000; aucun de mes pattern habituels ne passe ...\n\nVous connaissez __Passbolt__ ? Vous voulez éviter ses situations stressantes et désagréables ? La proposition : centraliser et partager aisément des mots de passe dans une équipe tout en assurant un maximum de sécurité basée sur des standards ouverts ! Sa spécificité : transparence et outillage complet !",
        "event_end": "2017-04-20T13:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T12:45:00",
        "event_type": "Cloud, Devops, Outils",
        "format": "Quickie",
        "goers": "tobedefined",
        "id": "422",
        "invite_only": "N",
        "language": "Français",
        "name": "Quand on change le code, on prévient !",
        "seats": "tobedefined",
        "speakers": "Guillaume Renaudin",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "La ElasticOn est la grand messe de la société Elastic, entre marketing, présentation des nouveautés fonctionnelles et améliorations techniques, la journée de cette année 2016 a été très riche.\n\nLe but de ce quickie est de restituer en un quart  d'heure ce qu'il fallait retenir de cette édition 2016.",
        "event_end": "2017-04-21T13:15:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T13:00:00",
        "event_type": "BigData, Analytics et Machine Learning",
        "format": "Quickie",
        "goers": "tobedefined",
        "id": "441",
        "invite_only": "N",
        "language": "Français",
        "name": "Retour sur la ElasticOn 2016",
        "seats": "tobedefined",
        "speakers": "Maxime Odye",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "Nous sommes tous d’accord ! Le moyen employé par la première version d’AngularJS pour synchroniser les vues avec vos models est un peu archaique. Nous avons par exemple les méthodes $scope.$apply, $scope.$digest… Heureusement, avec Angular2, les choses s’améliore grâce à un nouveau mécanisme, les zones, développé pour l’occasion. Lors de ce talk, je présenterai en détail ce nouveau mécanisme, qui fera peut-être un jour parti du langage JavaScript",
        "event_end": "2017-04-21T13:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T12:45:00",
        "event_type": "Web et mobile",
        "format": "Quickie",
        "goers": "tobedefined",
        "id": "468",
        "invite_only": "N",
        "language": "Français",
        "name": "Entrons dans les zones d'Angular2",
        "seats": "tobedefined",
        "speakers": "Emmanuel DEMEY",
        "venue": "Track4",
        "venue_id": 4
    },
    {
        "active": "Y",
        "description": "Ce talk est une introduction de RxJs, des Observables et Streams. Nous verrons comment exploiter ces concepts pour créer des applications Web dites réactives. Nous expliquerons ces concepts dans le contexte d'Angular et verrons comment ce framework a été battis sur ces concepts réactifs. Venez découvrir pourquoi Angular + RxJS = ??",
        "event_end": "2017-04-20T13:15:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T13:00:00",
        "event_type": "Web et mobile",
        "format": "Quickie",
        "goers": "tobedefined",
        "id": "623",
        "invite_only": "N",
        "language": "Français",
        "name": "Des applications Angular reactives avec RxJS",
        "seats": "tobedefined",
        "speakers": "Wassim Chegham",
        "venue": "Track2",
        "venue_id": 5
    },
    {
        "active": "Y",
        "description": "Après une 3e milestone releasée en novembre dernier, JUnit 5 arrive à grand pas et apporte un lot de nouveautés qui vont être plus que bienvenues ! \n\nDans ce quickie, je vous propose de s'attarder sur quelques unes de ces nouveautés : En premier lieu les tests dynamiques (enfin), et d'autres nouveautés plus mineures mais néanmoins très pratiques comme les tests imbriqués, les assertions multiples, ...",
        "event_end": "2017-04-21T13:15:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T13:00:00",
        "event_type": "Agilité, Méthodologie et Tests",
        "format": "Quickie",
        "goers": "tobedefined",
        "id": "716",
        "invite_only": "N",
        "language": "Français",
        "name": "JUnit 5 : Tests imbriqués dynamiques",
        "seats": "tobedefined",
        "speakers": "Benoit AVERTY",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "JWT devient un vrai standard pour sécuriser et échanger des informations entre nos applicatifs (front / back ou back / back). \n\nSi il devient une pierre angulaire de la sécurité, il est indispensable d'en comprendre le fonctionnement dans sa globalité et ses détails.\n\nNous verrons comment ce mécanisme fonctionne et notamment comment l'implémenter correctement et en toute sécurité",
        "event_end": "2017-04-21T13:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T12:45:00",
        "event_type": "Architecture, Performance et Sécurité",
        "format": "Quickie",
        "goers": "tobedefined",
        "id": "739",
        "invite_only": "N",
        "language": "Français",
        "name": "JWT in depth",
        "seats": "tobedefined",
        "speakers": "Mathieu POUSSE",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "PHP serait-il comme Justin Bieber pour la musique : c'est bien pour les ados, mais quand on grandit, il faut passer à autre chose. \"PHP, c’est de la merde en boite\", \"Le typage faible, c’est pour les noobs\", \"Totalement inconsistant et mal conçu\", \"PHP a vécu bien trop longtemps\". PHP inspire beaucoup d’animosité, et la plupart des arguments sont justifiés. Alors, doit-on encore faire du PHP en 2017 ?",
        "event_end": "2017-04-20T13:15:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T13:00:00",
        "event_type": "Langages",
        "format": "Quickie",
        "goers": "tobedefined",
        "id": "861",
        "invite_only": "N",
        "language": "Français",
        "name": "Doit-on encore faire du PHP en 2017 ?",
        "seats": "tobedefined",
        "speakers": "Frédéric Bouchery",
        "venue": "Track3",
        "venue_id": 3
    },
    {
        "active": "Y",
        "description": "Si toi aussi tu ne comprends plus rien aux dernières mises à jour de Javascript, **alors ce talk est fait pour toi !**\n\nComment ça fonctionne ? Quelles sont les nouveautés ? Pourquoi certaines personnes les utilisent alors que ce n'est pas officiellement sorti ?\nPourquoi j'en entends moins parler ?\n\nDans ce **Quickie** vous aurez réponses à ces questions. Nous allons revoir la façon dont ECMAScript (et donc Javascript) évolue.\nJe vous présenterai quelques nouveautés depuis l'ES6 (ES2015) qui me semblent intéressantes et applicables dès à présent via une comparaison avant/après et du **livecoding**.\n\nJe vous persuaderai que ces nouveautés vous feront gagner du temps et de la lisibilité !",
        "event_end": "2017-04-20T13:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T12:45:00",
        "event_type": "Web et mobile",
        "format": "Quickie",
        "goers": "tobedefined",
        "id": "1039",
        "invite_only": "N",
        "language": "Français",
        "name": "MinuteJS - Les nouveautés Javascript à ne pas rater !",
        "seats": "tobedefined",
        "speakers": "Fabien JUIF",
        "venue": "Track2",
        "venue_id": 5
    },
    {
        "active": "Y",
        "description": "La couture ... Quel rapport avec le développement me direz vous ? A priori aucun. Pourtant construire une application web et coudre une veste sont deux processus bien similaires. D'un côté, il faut choisir son langage, construire l'architecture du projet, coder les features les unes après les autres, refactoriser son code à la fin. De l'autre, il faut choisir le tissu, dessiner le patron, assembler le dos, le devant, les manches, puis faire attention aux finitions. Cette conférence s'armera donc de poésie pour vous montrer que n'importe quel cliché peut être inverser, que les femmes peuvent coder et que vous pouvez tous et toutes les y aider.",
        "event_end": "2017-04-21T13:00:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T12:45:00",
        "event_type": "Agilité, Méthodologie et Tests",
        "format": "Quickie",
        "goers": "tobedefined",
        "id": "1050",
        "invite_only": "N",
        "language": "Français",
        "name": "Couturière de mère en fille",
        "seats": "tobedefined",
        "speakers": "Aurore Malherbes",
        "venue": "Track2",
        "venue_id": 5
    },
    {
        "active": "Y",
        "description": "Le Machine Learning prend de plus en plus de place dans la vie de tous les jours : Google Photos vous permet de chercher des objets dans vos images tandis que Siri joue le rôle d'assistant personnel et répond à vos questions. Tout cela sans compter que l'intelligence artificielle n'arrête plus de faire le buzz.\n\nDans cette session, on vous montrera comment réaliser une application de Machine Learning qui permet de reconnaître avec un Raspberry Pi les pleurs d'un bébé et de lancer une berceuse pour essayer de le calmer avant d'intervenir personnellement. On traitera les aspects techniques liés à la classification de signaux audio et du déploiement d'un modèle de Machine Learning sur Raspberry Pi.",
        "event_end": "2017-04-21T13:15:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-21T13:00:00",
        "event_type": "Objets connectés, IoT, Robotique",
        "format": "Quickie",
        "goers": "tobedefined",
        "id": "1057",
        "invite_only": "N",
        "language": "Français",
        "name": "Parenting 2.1 : calmer son bébé avec du machine learning et un Raspberry Pi",
        "seats": "tobedefined",
        "speakers": "Giulia Bianchi",
        "venue": "Track2",
        "venue_id": 5
    },
    {
        "active": "Y",
        "description": "Décrire les contraintes sur les entrées d'une API et générer la documentation à partir d'une spécification c'est bien.... Mais générer des librairies clientes ainsi que leurs documentations et tests sur mesure c'est mieux !\n\nDans ce talk nous verrons comment un fichier Swagger peut devenir la source de vérité et le coeur de tout l'éco-système — interne et externe — autour de votre SaaS.",
        "event_end": "2017-04-20T13:15:00",
        "event_key": "tobedefined",
        "event_start": "2017-04-20T13:00:00",
        "event_type": "Backend et Desktop",
        "format": "Quickie",
        "goers": "tobedefined",
        "id": "1102",
        "invite_only": "N",
        "language": "Français",
        "name": "Construire et automatiser l'ecosystème de son SaaS grâce à une spécification Swagger",
        "seats": "tobedefined",
        "speakers": "Francois-Guillaume Ribreau",
        "venue": "Track4",
        "venue_id": 4
    }
]
