[ {
  "id" : "f11bdc6d-9d67-4c90-8481-941360f222b4",
  "name" : "Accueil / Café",
  "event_start" : "2024-06-26T09:00:00",
  "event_end" : "2024-06-26T10:00:00",
  "event_type" : "Eat",
  "format" : "Eat",
  "venue" : "Hall",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
}, {
  "id" : "666820",
  "name" : "▣ QR Codes : suivez les points sans vous perdre ! ▣",
  "event_start" : "2024-06-26T10:00:00",
  "event_end" : "2024-06-26T12:00:00",
  "event_type" : "Autre...",
  "format" : "Université",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "Benoît Masson, Sébastien Chédor",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Les QR Codes, tout le monde connaît et les utilise régulièrement. Mais savez-vous vraiment comment ils fonctionnent, pourquoi c'est aussi rapide et fiable, même avec une caméra de faible qualité ou un code abîmé ?\r\n\r\nNous vous proposons de coder ensemble un lecteur de QR Codes en Go, avec un minimum d'outils :\r\n\r\n- capture et analyse de la vidéo issue de la webcam pour détecter la position du code, à l'aide d'OpenCV\r\n- extraction et décodage du contenu, avec correction d'erreur grâce à l'algorithme de Reed-Solomon.\r\n\r\nÀ la fin de cette session, vous devriez être capables de décoder un QR Code à l'oeil nu 🕵️ (et un brouillon…)"
}, {
  "id" : "e6dc0829-a283-4496-8d0f-63b36d2dc6c0",
  "name" : "Pause déjeuner",
  "event_start" : "2024-06-26T12:00:00",
  "event_end" : "2024-06-26T13:30:00",
  "event_type" : "Eat",
  "format" : "Eat",
  "venue" : "Hall",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
}, {
  "id" : "670503",
  "name" : "Parcours initiatique sur l'authentification avec Keycloak",
  "event_start" : "2024-06-26T13:30:00",
  "event_end" : "2024-06-26T15:30:00",
  "event_type" : "Sécurité",
  "format" : "Université",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "Jérôme Marchand, Adrien Wattez",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "On entend souvent parler de SSO (Single-Sign On), OIDC (OpenId Connect) ou encore SAML (Security Assertion Markup Language), on vous propose un parcours initiatique à travers un codelab pour vous expliquer tous ces termes complexes.\r\n\r\nDurant ce codelab vous aurez une architecture microservice, un front et Keycloak qui est devenu un outil incontournable quand on parle d’authentification et d'autorisation. Votre objectif sera de comprendre et mettre en place différentes manières de sécuriser et de s’authentifier sur votre application.\r\n\r\nPourquoi pas aller jusqu'à l'usage de WebAuthN, ce nouveau standard d’authentification sans mot de passe… et gérer des niveaux d’authentification différents en fonction des applications."
}, {
  "id" : "31824c64-a503-4463-bb5a-58ad70edd373",
  "name" : "Pause café",
  "event_start" : "2024-06-26T15:30:00",
  "event_end" : "2024-06-26T16:00:00",
  "event_type" : "Eat",
  "format" : "Eat",
  "venue" : "Hall",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
}, {
  "id" : "666173",
  "name" : "Migration de projets Terraform vers Terragrunt.",
  "event_start" : "2024-06-26T16:00:00",
  "event_end" : "2024-06-26T18:00:00",
  "event_type" : "DevOps",
  "format" : "Université",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "Jérôme Marchand",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Terraform est l'outil des techniciens de l'Empire pour déployer et installer les infrastructures des centres de données au sol et dans les nuages. Il fait parfaitement ce que l'on peut attendre de lui, mais a tout de même quelques limites imposées par une autorité et demande parfois du clonage.\r\nLa nouvelle République, propose l'outil Terragrunt. Ce wrapper, pour Terraform, fournit des outils pour garder les configurations DRY, travailler avec plusieurs modules et gérer les états distants.\r\nAprès une comparaison avec les Workspaces de Terraform, nous verrons par l'exemple :\r\n* comment cet outil peut répondre à vos cas d'usage\r\n* comment migrer un projet existant\r\n* comment faire vivre le projet\r\nPeut être qu'a la suite de cette université, vous voudrez embarquer dans un des vaisseaux qui part construire croiseur galactique."
}, {
  "id" : "659464",
  "name" : "Angular change de logo mais pas que.",
  "event_start" : "2024-06-26T10:00:00",
  "event_end" : "2024-06-26T12:00:00",
  "event_type" : "Web",
  "format" : "Université",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "Florian Allainmat, Imryck N/A",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Angular est entré dans une période de profondes modifications. Cette évolution, plébiscité par la communauté, laisse entrevoir un renouveau pour ce framework qui n'arrivait pas à séduire les nouveaux développeurs.\r\n\r\nCes nouveautés vous font peur ? Nous aussi... au moins au début. Nous proposons de vous accompagner dans cette découverte.\r\n\r\nDu Standalone component en passant par Signals pour finir par le control flow, nous manipulerons tous ces concepts au travers de la réalisation d'une application de paris pour les prochains JO robotics.\r\n\r\nDurant notre ballade nous partagerons nos REX sur ces nouveautés et parlerons de l'avenir du framework."
}, {
  "id" : "664305",
  "name" : "Let's React : 8 ans plus tard !",
  "event_start" : "2024-06-26T13:30:00",
  "event_end" : "2024-06-26T15:30:00",
  "event_type" : "Web",
  "format" : "Université",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "Mathieu Ancelin, Sébastien Prunier",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Il y a longtemps (8 ans), dans une galaxie fort fort lointaine (Rennes), nous passions 2 heures à faire découvrir React à tous les padawans qui voulaient apprendre les bases de la dernière lib front à la mode. Après avoir passé 1h45 à télécharger les 8Gb de dépendances NPM sur une 3G calamiteuse, nous avions enfin un hello world fonctionnel ;)\r\n\r\nNous revenons 8 ans plus tard, au format université cette fois. React est maintenant un incontournable du développement front, a subi plusieurs liftings en profondeur et beaucoup de choses ont changé dans la librairie et dans l'écosystème.\r\n\r\nNous profiterons de cette université pour vous faire découvrir les nouvelles bonnes pratiques ainsi que leurs évolutions, nos  interrogations face aux nouvelles APIs, nos doutes, nos certitudes, et nous répondrons à la question que beaucoup se posent:\r\n\r\nC'est quoi faire du React en 2024 ?\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
}, {
  "id" : "661590",
  "name" : "Automatiser les Tests d'API avec Bruno",
  "event_start" : "2024-06-26T16:00:00",
  "event_end" : "2024-06-26T18:00:00",
  "event_type" : "Web",
  "format" : "Université",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "Alan Duchene",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Cet atelier vous guidera à travers le processus de création de tests automatisés pour vos APIs web en utilisant Bruno, une alternative open source légère et polyvalente aux clients d'API du marché tel que Postman.\r\n\r\nÀ partir de la documentation d'une API web, vous rédigerez des tests pour couvrir les divers services que celle-ci propose.\r\n\r\nVous apprendrez comment:\r\n\r\nconfigurer des environnements de test\r\nécrire des scripts de tests automatisés\r\ndébogguer\r\nexécuter des collections de tests en continu avec des intégrations CI/CD\r\nanalyser les résultats pour assurer la qualité de vos APIs"
}, {
  "id" : "653362",
  "name" : "Voyage au coeur d'Appwrite : le backend open-source qui challenge Firebase 🧳",
  "event_start" : "2024-06-26T10:00:00",
  "event_end" : "2024-06-26T12:00:00",
  "event_type" : "Web",
  "format" : "Université",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Lucas Audart, Mickael Alves",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Bienvenue à bord du grand voyage, destination : l'univers du backend open-source ! Êtes vous prêts pour cette aventure au cœur d'Appwrite, la solution qui défie le géant déjà bien connu Firebase ? 🛫\r\n\r\nAu cours de cette aventure, vous découvrirez les fondamentaux d'Appwrite, de la mise en place de l'environnement à l'exploration de fonctionnalités plus avancées. Nous parcourrons ensemble les différents services de base qui font d'Appwrite l'outil indispensable pour tout développeur à la recherche d'un backend facile à utiliser et performant 🚀\r\n\r\nPrenez votre courage à deux mains et embarquez avec nous pour une expérience inoubliable au cœur de l'écosystème Appwrite ! 👨🏼‍✈️"
}, {
  "id" : "656861",
  "name" : "Fresque de la Data",
  "event_start" : "2024-06-26T13:30:00",
  "event_end" : "2024-06-26T15:30:00",
  "event_type" : "Data",
  "format" : "Université",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Sandra Pietrowska, Franck Cussac",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "La Fresque de la Data est un atelier collaboratif conçu dans le but de familiariser les participants avec les concepts fondamentaux de la Data ainsi que d’identifier et d’évaluer les risques liés à l'utilisation de la donnée.\r\n\r\nTirant son inspiration de la Fresque du Climat, c’est une approche ludique, qui favorise les échanges et encourage la collaboration entre les participants, offrant ainsi une opportunité de s’aligner et renforcer l’esprit d’équipe.\r\n\r\nCe format innovant part du constat que la principale cause de difficultés en Data est le manque de compréhension, d'alignement et de collaboration entre les différents interlocuteurs. Pourtant, les approches classiques d'acculturation à la Data ont trop rarement l'effet escompté.\r\n\r\nLa Fresque de la Data permet ainsi de développer une image mentale des principaux concepts de la Data et de l’IA, et favorise un apprentissage par l’échange et la collaboration."
}, {
  "id" : "657943",
  "name" : "Atelier : 10 tests simples pour améliorer l'accessibilité de votre site",
  "event_start" : "2024-06-26T16:00:00",
  "event_end" : "2024-06-26T18:00:00",
  "event_type" : "Web",
  "format" : "Université",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "François-Xavier Lair, Henri Gauffriau",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Derrière ce titre « clickbait » se cache une vraie méthode basée sur une checklist du W3C.\r\n\r\nElle permet de tester soit même l’accessibilité d’un site en 10 tests simples, même sans avoir un profil technique.\r\n\r\nCette méthode ne remplace pas un « vrai » audit de site, mais elle va permettre de donner une idée générale de l’accessibilité d'un site. Ces tests couvrent une bonne partie des problèmes bloquants d’accessibilité. Les passer avec succès est une base essentielle pour rendre accessible un site.\r\n\r\nIls sont rapides et faciles à faire, tous les intervenants d’un projet peuvent les réaliser : Clients, PO, CP, Dev, UX/UI Designers, etc.\r\n\r\nL’objectif de cet atelier est de présenter ces 10 tests et de les pratiquer en « live » en utilisant divers outils quand c'est nécessaire :\r\n- Extensions navigateurs (Web Developper, Heading Maps, A11y Outline, Stylish, etc.)\r\n- Les outils d'accessibilité des navigateur\r\n- L'inspecteur de code pour les profils les plus techniques\r\n\r\nNous aborderons également les outils d'automatisation de tests qui peuvent être intégrés à vos IDE ou à votre CI/CD.\r\n\r\nS'il reste assez de temps, en fonction de la progression des participants, nous pourrons même aborder des tests \"bonus\" ou jouer un peu avec les lecteurs d'écran."
}, {
  "id" : "668968",
  "name" : "Génération XZ",
  "event_start" : "2024-06-26T10:00:00",
  "event_end" : "2024-06-26T10:55:00",
  "event_type" : "Sécurité",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Mathieu Pousse",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Fin mars, un projet open-source qui propose une bibliothèque de compression, a été compromise par un des 2 développeurs. Il y a introduit un code malveillant permettant, à travers une ingénierie très poussée, d'exécuter du code sur un serveur distant via une simple tentative de connexion SSH 🤯.\r\n\r\nIncroyable, impensable, mais nous venons de passer à côté d’une faille de sécurité qui aurait pu corrompre une grande partie des serveurs du monde entier.\r\n\r\nJe vous propose de voir comment fonctionne cette faille en détail, analyse du code à l’appui, et comment elle a été poussée à l’insu de la communauté.\r\n"
}, {
  "id" : "670842",
  "name" : "Les apps écologiques, c'est pas automatique ?",
  "event_start" : "2024-06-26T11:00:00",
  "event_end" : "2024-06-26T11:55:00",
  "event_type" : "Écoconception",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Johanna Duigou",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Les applications mobiles que vous écrivez peuvent contenir des lignes de code qui ne sentent pas très bon du point de vue de la consommation de batterie et/ou de la longévité des terminaux. Cette conférence vous présente quelques symptômes comparés pour Android et iOS natifs, avant de montrer comment il devient possible de les traiter avec SonarQube, un outil populaire d'analyse automatique de code.\r\n\r\nApport pour la Conférence :\r\nCe talk gardera un focus technique pour apporter aux participants une compréhension profonde des défis techniques liés à l'écoconception logicielle et comment ceux-ci peuvent être surmontés par des pratiques innovantes de DevGreenOps. Les participants pourront repartir avec des stratégies concrètes pour mettre en œuvre le DevGreenOps dans leurs propres environnements de développement, favorisant ainsi le développement d'applications mobiles durables.\r\n\r\n"
}, {
  "id" : "666515",
  "name" : "Les normes de messagerie pour une meilleure expérience e-mail",
  "event_start" : "2024-06-26T13:30:00",
  "event_end" : "2024-06-26T14:25:00",
  "event_type" : "Sécurité",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Antoine G",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Dans une galaxie lointaine, très lointaine...\r\n- Dark Mailer : « DNS, ARC, SMTP, SPF, DKIM, DMARC, BIMI, POP, IMAP et VMC »\r\n- Luck SkyMailer : « c’est le bruit d’un droïde agonisant ? »\r\n- Dark Mailer : « Non, c’est le bruit de la lutte contre l’empire du spam ! Assiste à cette conf et ressort avec plein de détails sur ces acronymes pour crâner au prochain rassemblement de la confédération des BreizhJedi. Et surtout fais le plein d'infos pour envoyer des mails sécurisés… »\r\n\r\nTrêve de plaisanterie :\r\nEn octobre Google et Yahoo ont annoncé des nouvelles restrictions pour les entreprises qui expédient plus de 5000 mails par jour. \r\nL’objectif ? \r\nLutter contre le spam/phishing qui a fait un bond de 600% au moment du Covid. Depuis février cette année, les entreprises doivent avoir implémenté les différents protocoles (SPF, DKIM, DMARC…) aidant à la lutte contre le spam. C’est donc une bonne occasion de les passer en revue pour mieux les comprendre."
}, {
  "id" : "656166",
  "name" : "Cinq critères pour muscler vos échanges HTTP",
  "event_start" : "2024-06-26T14:30:00",
  "event_end" : "2024-06-26T15:25:00",
  "event_type" : "Développement",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Charline Humeau, Nicolas Giraud",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Vous utilisez REST, peut être même SOAP dans des projets plus historiques. \r\nMais connaissez-vous les alternatives à ces modes d'échange ?\r\nGraph QL, gRPC sont des exemples qui ont été adoptés plus récemment et qui enrichissent l'écosystème de nouvelles  possibilités.\r\n\r\nQuelle est la solution la plus appropriée en fonction de votre contexte ?\r\nQuels sont les limites et inconvénients de chacun ?\r\n\r\nCharline et Nicolas, respectivement lead-front et lead-back, vous proposent cinq critères construits au fil de leurs expériences. \r\nCes clés vous aideront à choisir le mode de communication le plus adapté aux problématiques que vous avez à résoudre.  \r\n"
}, {
  "id" : "658467",
  "name" : "Du code source à l'exécutable : plongée dans les entrailles de la compilation en Rust",
  "event_start" : "2024-06-26T16:00:00",
  "event_end" : "2024-06-26T16:55:00",
  "event_type" : "Développement",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Édouard Siha",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Comment le compilateur Rust fait-il pour assurer le respect de la notion d'emprunt ? Pourquoi est-il capable de générer facilement des binaires spécialisés pour une plateforme d'exécution différente de celle de la plateforme de compilation ? Quel genre d'optimisations surprenantes est-il capable de réaliser ? Quelles caractéristiques le différencie des compilateurs utilisés pour le C ? Pour le Java ?\r\n\r\nEmbarquez avec moi pour un parcours didactique où l'émerveillement est de mise !\r\n"
}, {
  "id" : "669619",
  "name" : "Flink vs Kafka Streams : le duel des titans du streaming",
  "event_start" : "2024-06-26T17:00:00",
  "event_end" : "2024-06-26T17:55:00",
  "event_type" : "Data",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Sébastien Coulle",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Imaginez un duel improbable :\r\n\r\n- d'un coté, un écureuil, cet animal si mignon de la famille des sciuridés, à la fois agile et rapide, capable d'amasser et de stocker des grandes quantités de nourriture\r\n- de l'autre côté, une tasse à café, robuste, fidèle et bien connue, avec son fidèle compagnon Kafka Stream qui, depuis des années, nous permet de streamer de la donnée de la plateforme Kafka\r\n\r\nCombat inégal pour certains ou gagné d'avance pour d'autres ? Comment cet écureuil a réussi à chambouler le monde du streaming de données dans Kafka depuis plus d'un an ? Kafka Streams, c'est bien pour les nostalgiques. Apache Flink, c'est pour les pionniers du streaming de données.\r\n\r\nPrêt à basculer ?"
}, {
  "id" : "658620",
  "name" : "Burn Your Idols - Comment devenir un bon rôle modèle ?",
  "event_start" : "2024-06-26T10:00:00",
  "event_end" : "2024-06-26T10:55:00",
  "event_type" : "Autre...",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Magali Milbergue",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "En tant que jeune fille qui aimait la science et voulait apprendre à coder, les seules quelques femmes de la tech que je pouvais trouver étaient les très très très extraordinaires comme Ada Lovelace, Grace Hopper ou Margaret Hamilton. 20 ans plus tard, il y a de grandes chances que si je vous demande de me parler de rôles modèles féminins dans la tech, vous me citiez ces mêmes noms. \r\n\r\nEt ces noms ne sont pas des mauvais noms. Ces femmes sont des rôles modèle. Mais elles sont des rôles modèles GENIAUX. Le genre de rôles modèles auquel il est très dur de s’identifier. Même avec un égo plutôt sain, je ne vois pas comment la plupart des femmes pourraient se dire “je suis la prochaine Ada Lovelace !”. \r\n\r\nCes femmes extraordinaires finissent par avoir l’impact inverse à celui qu’on voudrait qu’elles aient. En n’ayant que des femmes très très extraordinaires comme modèles, nous finissons par nous dire que nous n’avons pas notre place dans la tech comme nous ne sommes pas aussi extraordinaires. Et c’est bien sûr faux, il n’y a pas besoin d’être un génie pour travailler dans la tech. \r\n\r\nAvec cette conférence, je vais essayer de démontrer comment avoir uniquement des femmes très extraordinaires, des génies en rôles modèles est toxique pour les femmes qui n’arrivent pas à s’y retrouver, et donne des excuses à l’industrie pour  mettre la barre très haut en terme de compétences pour les femmes qui veulent y entrer. Ensemble, nous essaierons de trouver une façon d’avoir des modèles qui puissent impacter positivement les femmes de la tech, et nous nous demanderons ce qu’un bon rôle modèle devrait être. "
}, {
  "id" : "658066",
  "name" : "Défier l'entropie : réécrire ses applications ou reprendre le contrôle ?",
  "event_start" : "2024-06-26T11:00:00",
  "event_end" : "2024-06-26T11:55:00",
  "event_type" : "Méthodologie",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Alexandre Jeambrun",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Les applications informatiques font l'objet d'une très forte entropie. Elles subissent plus ou moins vite de nombreuses dégradations jusqu'à les rendre parfois impossibles à opérer, à faire évoluer ou à déployer. \r\nLa décision la plus commune face à cette situation est bien souvent la réécriture. Décision qui porte en elle-même une source majeure d'entropie pour le système d'information. Mais est-ce une fatalité ?\r\nEst-ce qu'à l'instar des indices de réparabilité que l'on trouve maintenant sur les produits grand public, il ne serait pas possible de vraiment designer, créer et maintenir des applications \"réparables\" ? Et pour celles qui foisonnent déjà dans tous les SI du monde, n'est-il pas possible de les remettre sous contrôle  plutôt que de les ré-écrire ? "
}, {
  "id" : "659657",
  "name" : "HTMX - Un retour aux templates ou le futur du front-end ?",
  "event_start" : "2024-06-26T13:30:00",
  "event_end" : "2024-06-26T14:25:00",
  "event_type" : "Web",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Harold Favereau",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "HTMX - Un retour aux templates ou le futur du front-end ?\r\n\r\nAu cours des dernières années, le modèle back-end/front-end dans un framework Javascript s'est imposé comme la norme pour la création d'applications web.\r\n\r\nPourtant, depuis quelques mois, une petite librairie fait de plus en plus parler d'elle : HTMX. Son utilité repose sur un simple questionnement : pourquoi devoir écrire du Javascript pour implémenter des comportements aussi simples que changer le contenu d'une page HTML à la suite d'une interaction utilisateur sans recharger la page ?\r\n\r\nDurant cette présentation, on abordera donc ce que cache cette librairie de 14 kilo-octets, et comment elle promet tant via de simples attributs HTML.\r\nOn verra aussi à quoi ressemble une application web développée avec HTMX, et pourquoi la librairie pourrait être un choix pertinent pour vos prochains projets.\r\nPour concrétiser tout ça, je vous montrerai un petit exemple en Kotlin/Spring Boot."
}, {
  "id" : "663614",
  "name" : "Un code à l'épreuve du temps avec le Supple Design",
  "event_start" : "2024-06-26T14:30:00",
  "event_end" : "2024-06-26T15:25:00",
  "event_type" : "Développement",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Sylvain Decout",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Avec le temps, beaucoup d’applications ont tendance à devenir de plus en plus lourdes, jusqu’à atteindre un point où tout changement devient si coûteux qu'il vous sera impossible de vous adapter aux besoins de vos utilisateurs. C'est le signe d'une conception rigide. L'adoption de Clean Code et des patterns tactiques de DDD peut rendre la situation supportable, mais on reste en surface ; le problème sous-jacent reste présent.\r\n\r\nÇa tombe bien, le Domain-Driven Design propose toute une section, trop souvent oubliée, sur le « Supple Design ». Elle fournit des techniques pour tendre vers une conception flexible, qui pourra s'adapter simplement aux évolutions futures. En somme, un code sur lequel il est, et sur lequel il restera, un plaisir de travailler. \r\n\r\nCes principes qui datent de plus de 20 ans sont-ils toujours d'actualité ? Comment s'articulent-ils avec d'autres concepts qui ont émergé depuis ? En quoi constituent-ils un ensemble cohérent ? Afin de répondre à ces questions, je vous propose un live coding au cours duquel nous passerons en revue chacun des principes du Supple Design en nous appuyant sur des exemples concrets."
}, {
  "id" : "670915",
  "name" : "Et si on ouvre grand les bras aux SIG ?",
  "event_start" : "2024-06-26T16:00:00",
  "event_end" : "2024-06-26T16:55:00",
  "event_type" : "Développement",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Talab Ou Ali Halima",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Si l'on évoque le domaine de la géographie, notre esprit se tourne probablement vers la Terre et ses différents phénomènes physiques, biologiques et humains. Cependant, il existe un autre aspect de la géographie qui est orienté vers l'informatique : le SIG (Système d'Information Géographique). Ce dernier est un outil informatique qui permet la représentation et l'analyse de tout ce qui se trouve sur terre ainsi que les événements qui y surviennent. Grâce à sa grande accessibilité et à ses nombreuses applications, le SIG est de plus en plus sollicité dans notre quotidien. Dans ce talk, nous allons explorer des exemples d'outils et de services offerts par le SIG ainsi que les domaines dans lesquels il est appliqué."
}, {
  "id" : "666590",
  "name" : "RetEx : Optimisation du temps de démarrage d'une application Java Spring.",
  "event_start" : "2024-06-26T17:00:00",
  "event_end" : "2024-06-26T17:55:00",
  "event_type" : "Développement",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Daria Hervieux",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Travaillez-vous sur une application Java Spring implémentant une logique métier complexe, avec une base de code importante ? Le temps de démarrage est-il un défi majeur pour vous ? Venez découvrir quelques méthodes d'optimisation du temps de démarrage ainsi que notre retour d'expérience pour améliorer ce temps."
}, {
  "id" : "6f6534c3-cdcc-4e9a-8278-79bfb4ae7226",
  "name" : "Accueil / Café",
  "event_start" : "2024-06-27T08:00:00",
  "event_end" : "2024-06-27T09:00:00",
  "event_type" : "Eat",
  "format" : "Eat",
  "venue" : "Hall",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
}, {
  "id" : "b0a85db2-5c03-4a79-838b-803c8631f8f5",
  "name" : "Keynote",
  "event_start" : "2024-06-27T09:00:00",
  "event_end" : "2024-06-27T10:00:00",
  "event_type" : "Keynote",
  "format" : "Keynote",
  "venue" : "Amphi C",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
}, {
  "id" : "f5a32e4d-5f28-4723-ba15-826d05709664",
  "name" : "Pause café",
  "event_start" : "2024-06-27T10:00:00",
  "event_end" : "2024-06-27T10:30:00",
  "event_type" : "Eat",
  "format" : "Eat",
  "venue" : "Hall",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
}, {
  "id" : "670894",
  "name" : "Testcontainers : tu ne douteras plus de tes fonctionnalités, jeune Pydawan·e",
  "event_start" : "2024-06-27T10:30:00",
  "event_end" : "2024-06-27T11:25:00",
  "event_type" : "Développement",
  "format" : "Conférence",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "Luc Sorel-Giffo",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "« Avec de vrais tests d’intégration, l’étoile noire n’aurait sans doute pas sauté. Mais il arrive à R2-D2 de faire des erreurs… » disait C3-PO.\r\n\r\nAller au-delà des tests unitaires pour fiabiliser un service numérique se révèle ardu car il faut tenir compte des interactions du code testé avec d’autres briques vivantes : base de données, broker de messages, ou autres services de votre système d’information.\r\n\r\nTestcontainers s’appuie sur la conteneurisation docker pour démarrer les services tiers temporaires requis pour que vos tests puissent couvrir cette fois-ci de vrais périmètres fonctionnels (notamment cette bouche d’aération qui conduit bizarrement au cœur de la base spatiale…) et synchronise l’exécution des tests avec la disponibilité effective de ces containers.\r\n\r\nCe que nous verrons (dans un contexte Python) :\r\n- comment articuler Testcontainers et pytest (fixture, gestionnaire de contexte) pour gérer le cycle de vie de la base de données de test : peuplement minimal de données de test, nettoyage\r\n- comment valoriser un test fonctionnel en générant automatiquement de la documentation sur le code mobilisé par l’exécution du test (avec pydoctrace)\r\n- comment contribuer au projet Testcontainers pour ajouter une technologie aux containers déjà proposés par l'outil\r\n"
}, {
  "id" : "653014",
  "name" : "Il faut sauver le dernier giga de RAM",
  "event_start" : "2024-06-27T11:35:00",
  "event_end" : "2024-06-27T12:30:00",
  "event_type" : "Développement",
  "format" : "Conférence",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "Damien Lucas, Ivan Béthus",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "A l'approche des fortes volumétries de fin d'année, notre client ne peut plus se permettre d'ajouter à nouveau de la RAM sur son environnement de prod. Avec 96Go déjà en place sur le serveur, ça peut se comprendre !\r\n\r\nLe mot d'ordre : réduire la consommation mémoire de notre application.\r\n\r\n- \"On a des metrics ?\r\n- Non.\r\n- Accès à la prod ?\r\n- Non.\r\n- Un composant identifié ?\r\n- Non, plusieurs dizaines.\r\n- Et on a combien de temps ?\r\n- 3 semaines.\"\r\n\r\nA travers ce talk nous vous présentons les outils que nous avons utilisés pour identifier les composants gourmands en RAM (Java Flight Recorder, MemoryAnalyzer, pg_statements, hypersistence-utils ...). Mais aussi comment nous les avons améliorés afin de réduire leur empreinte mémoire.\r\n\r\nLa stack du projet : Java, Spring, PostgreSQL."
}, {
  "id" : "2daae633-36b0-4e2b-8d49-fc33fa010405",
  "name" : "Pause déjeuner",
  "event_start" : "2024-06-27T12:30:00",
  "event_end" : "2024-06-27T13:30:00",
  "event_type" : "Eat",
  "format" : "Eat",
  "venue" : "Hall",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
}, {
  "id" : "669467",
  "name" : "MongoDB en scale-up : comment sortir d’un enfer monolithique",
  "event_start" : "2024-06-27T13:30:00",
  "event_end" : "2024-06-27T14:25:00",
  "event_type" : "Data",
  "format" : "Conférence",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "Alexis \"Horgix\" Chotard, Caroline Becker",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "15 mars 2023, 6h59 : un cluster MongoDB s'écroule. Pas de bol, celui-ci contient 95% des données utilisateur, et est absolument vital à un fonctionnement même minimal de notre application. Facteur aggravant : celui-ci a 7 ans de retard de versions, n'est pas scalable, et à peine observable. Enfin, même le modèle de données ferait rapidement lever les sourcils : des applications qui communiquent entre elles via lecture/écriture dans les mêmes documents MongoDB, des documents qui atteignent la limitation maximum de 16MiB avec des centaines de niveaux d'imbrication, etc. L'incident durera plusieurs jours et résultera en la perte de nombreux utilisateurs. On a vu meilleur portrait.\r\n\r\nVoyons comment PayFit s'est retrouvé dans cette situation infernale, et surtout comment nous nous y sommes pris pour en sortir !\r\n\r\nAu programme : stabilisation technique, détricotage de modèle de données, éclatement d'un SPOF en plusieurs éléments au blast radius plus restreint, transition vers des services managés, amélioration des accès internes, reprise de maîtrise sur les opérations risquées, et finalement, approche d'une migration technique quand celle-ci impacte l'intégralité des équipes de développement."
}, {
  "id" : "663731",
  "name" : "🆘 Mon Elasticsearch a perdu la boule 😵‍💫",
  "event_start" : "2024-06-27T14:35:00",
  "event_end" : "2024-06-27T15:30:00",
  "event_type" : "Data",
  "format" : "Conférence",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "Maxime Odye",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Votre application de recensement des Jedis est en train de perdre la boule 😵‍💫\r\n\r\nElle est basée sur un moteur de recherche Elasticsearch et ce dernier semble complètement délirer.\r\n\r\nAlors que ma recherche devrait me remonter les Jedis les plus populaires de la galaxie, elle me remonte des Siths d'horizons inconnus … Ca n’a aucun sens 😭\r\n\r\nPourtant nous avons vu avec les POs, on a implémenté tout ce qu’ils voulaient: des recherches floues, de la racinisation, ne pas prendre en compte la casse, ni les accents. On ne sait plus ou donner de la tête.\r\n\r\nDans cette présentation, nous soulèverons le capot d’Elasticsearch pour comprendre comment sont réellement exécutées vos requêtes full-text. L’idée est de vous donner tous les trucs et astuces que j’utilise au quotidien pour aider mes clients à comprendre leur soucis de matching et de pertinence dans leurs requêtes.\r\n\r\nOn utilisera intégralement l’API d’Elasticsearch pour aller customiser nos mappings, nos queries, nos algorithmes de scoring pour essayer d’arriver à une solution de search intelligente et efficace 😊"
}, {
  "id" : "4152a32e-6695-482a-8f8c-af00b440a5d6",
  "name" : "Pause café",
  "event_start" : "2024-06-27T15:30:00",
  "event_end" : "2024-06-27T16:00:00",
  "event_type" : "Eat",
  "format" : "Eat",
  "venue" : "Hall",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
}, {
  "id" : "660722",
  "name" : "La force du temp réel : développement d'un jeu mobile de palet breton/vendéen multijoueur",
  "event_start" : "2024-06-27T16:00:00",
  "event_end" : "2024-06-27T16:55:00",
  "event_type" : "Mobile",
  "format" : "Conférence",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "Vincent Ogloblinsky",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Développer un jeu vidéo est déjà un défi de taille, mais aborder la dimension multijoueur équivaut à affronter le boss final de Mario Bros - ça ne s'improvise pas.\r\nDans ce talk, je vous invite à découvrir les challenges auxquels j'ai été confronté lors du développement de ce jeu.\r\nNous explorerons les problématiques liées à la fluidité, à l'interactivité, à l'implémentation des règles du jeu, à la gestion du réseau, avec un soupçon d’isomorphisme et un zeste de DDD pour obtenir une base de code fonctionnant à la fois sur serveur et sur mobile, connecté ou hors ligne."
}, {
  "id" : "658496",
  "name" : "Des batches à moindre coût environnemental !",
  "event_start" : "2024-06-27T17:05:00",
  "event_end" : "2024-06-27T17:30:00",
  "event_type" : "Écoconception",
  "format" : "Tool in action",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "Édouard Siha",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "J'ai souvent un gros batch à exécuter... Il prend environ 1h à chaque fois et mon petit cœur responsable me dit qu'il faut minimiser son empreinte environnementale. Mais comment faire ?\r\n\r\nDécouvrez par la pratique comment avoir un impact mesurable et repartez avec les bons concepts directement applicables (unités de mesure, temporal shifting, spatial shifting, etc.) et les outils à connaître (electricity maps, sdk carbon aware, etc.)."
}, {
  "id" : "654315",
  "name" : "Déverrouiller sa porte en une commande slack 🤖 #iot #diy #cloud",
  "event_start" : "2024-06-27T17:35:00",
  "event_end" : "2024-06-27T18:00:00",
  "event_type" : "IoT Embarqué",
  "format" : "Tool in action",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "Alexis Morelle",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Pendant une belle journée de hackathon, nous nous sommes penché sur une problématique bien concrète et en même temps assez amusante. 👩‍💻\r\n\r\nFatigués de nous lever chaque fois que l'interphone sonne, nous voulions pouvoir ouvrir la porte du bureau en une commande slack. Nous avons donc créé un bot slack qui permet de relâcher la gâche magnétique de la porte d'entrée du bureau. Explorons ensemble la solution, de l'IoT aux cloud-functions, et des considérations de sécurité au coût de la solution. 🔎\r\n\r\nNous avons manipulé aussi bien le fer à souder que différents clouds providers + quelques lignes de script et beaucoup de fun plus tard, nous avions donné naissance à Hodoor... ou Nestdoor... enfin ça on n'a pas encore tout à fait décidé. 😅"
}, {
  "id" : "663080",
  "name" : "D’observateur à responsable : enrayer l’impact des biais racistes dans l'expérience utilisateur.",
  "event_start" : "2024-06-27T10:30:00",
  "event_end" : "2024-06-27T11:25:00",
  "event_type" : "Autre...",
  "format" : "Conférence",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "Marcy Ericka Charollois",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Reconnaissance faciale défaillante, assimilation des noirs aux gorilles sur Google, confusion entre les ombres et les peaux foncées par les smart cars au point d'être percuté… Le racisme dans l'expérience utilisateur peut parfois se manifester de manière spectaculaire.\r\n\r\nCependant, il n'y a pas que dans ces exemples que les préjugés racistes existent : ils s'invitent dans ce que nous produisons tous de manière insidieuse.\r\n\r\nDe la conception à la mise en œuvre et jusque dans l'usage des produits : sans reculer, on peut nuire et créer l'exclusion de certains groupes en perpétuant voire en amplifiant les inégalités.\r\n\r\nC'est aussi au sein des entreprises, et donc chez les salariés du secteur, que l'on retrouve des incompréhensions qui opposent et discriminent la population la plus marginalisée.\r\n\r\nAlors, comment garantir des expériences neutres ou universelles dans un monde où l'UX se veut optimale et inclusive pour tous ?\r\n\r\nJe souhaite partager avec vous une approche à multiples facettes pour résoudre les problèmes systémiques dans l'expérience utilisateur, de la sémantique aux personae, en passant par les histoires personnelles et à travers l'Histoire avec un H majuscule."
}, {
  "id" : "665171",
  "name" : "Une seconde pour traiter un milliard de lignes en java ?",
  "event_start" : "2024-06-27T11:35:00",
  "event_end" : "2024-06-27T12:30:00",
  "event_type" : "Développement",
  "format" : "Conférence",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "Maxime Reynier",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "En janvier 2024 s'est déroulé en ligne le challenge 1BRC (1 billion row challenge), qui consistait à faire le programme java le plus rapide pour traiter un fichier d'un milliard de lignes. \r\n\r\nCette conférence propose de passer en revue les techniques d'optimisation utilisées : algorithmie, format de données, spécificités du langage et de l'environnement d'exécution. \r\n\r\nJusqu'où êtes-vous prêts à aller pour arriver à la seconde ?"
}, {
  "id" : "656552",
  "name" : "Tests JavaScript : reconstituer le puzzle",
  "event_start" : "2024-06-27T13:30:00",
  "event_end" : "2024-06-27T14:25:00",
  "event_type" : "Web",
  "format" : "Conférence",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "Jean-François Greffier",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Jest, Vitest, Cypress, Playwright... Tests unitaires, de composants, d'intégration, visuels, end-to-end. Autant d'outils et de types de tests anciens et nouveaux qui souvent se recoupent.\r\n\r\nDans ce talk, nous verrons l'anatomie d'un framework de test et de ses différents composants. Cela nous permettra de faire un point sur les solutions de test du moment, leurs avantages et leurs défauts.\r\n\r\nSurtout je vous présenterai mes recommandations, avec des alternatives, et les clefs pour choisir votre outillage."
}, {
  "id" : "652330",
  "name" : "La recherche à l'ère de l'IA",
  "event_start" : "2024-06-27T14:35:00",
  "event_end" : "2024-06-27T15:30:00",
  "event_type" : "IA",
  "format" : "Conférence",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "David Pilato",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "La recherche ne se contente plus de l'approche maintenant traditionnelle basée sur la fréquence des termes (TF/IDF ou BM25) mais plus sur la tendance actuelle du machine learning où les nouveaux modèles ont ouvert une nouvelle dimension pour la recherche.\r\n\r\nCette conférence donne un aperçu de :\r\n\r\n* La recherche \"Classique\" et ses limitations\r\n* Qu'est qu'un modèle de machine learning et comment vous pouvez l'utiliser\r\n* Comment utiliser la recherche vectorielle ou la recherche hybride dans Elasticsearch\r\n* Comment ChatGPT d'OpenAI ou les \"large language models\" (LLMs) similaires viennent jouer naturellement avec Elastic\r\n\r\nLa démo principale montre comment générer des embeddings à partir de musiques puis comment trouver la musique qui s'approche le plus d'une musique que nous fredonnons 🎶🎸🎻."
}, {
  "id" : "654458",
  "name" : "La Clean Archi ca marche aussi dans le Front !",
  "event_start" : "2024-06-27T16:00:00",
  "event_end" : "2024-06-27T16:55:00",
  "event_type" : "Web",
  "format" : "Conférence",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "Dorian Lamandé",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Tout le monde pense que la \"Clean Architecture / Architecture Hexagonale\" se fait uniquement côté Back.\r\nDans ce talk, je vais vous montrer que cela fonctionne également côté Front.\r\nEt oui, Redux n'est pas le Silver Bullet des applications front-end.\r\nEt oui, Les Stores ne sont pas toujours obligatoires, mais ceci est une autre histoire !\r\n\r\nLa mise en place d'une \"clean archigonale\" ©️ sur un Front-End en VueJS, m'a sauvé la vie !\r\nPourquoi je structure un minimum mes projets fronts et comment au final, je fais gagner du temps à mon équipe.\r\n\r\nAvec ce talk on va revenir sur l'importance d'isoler son code des dépendances extérieures (axios, vueJS, etc...).\r\nOn verra que l'on peut tester de l'affichage avec des Tests Unitaires, sans forcément passer par du cypress ou du component testing.\r\n\r\nTake away :\r\n\r\nArchitecture\r\nStratégie de Tests\r\nReferences\r\nTalk fait en interne chez OCTO Technology.\r\nSpeaker Principal de la chaine https://www.youtube.com/channel/UCN8ivf_IJFu5l-Zfp9A4WkQ"
}, {
  "id" : "671111",
  "name" : "Présentez avec style grâce à OBS !",
  "event_start" : "2024-06-27T17:05:00",
  "event_end" : "2024-06-27T17:30:00",
  "event_type" : "Autre...",
  "format" : "Tool in action",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "Martin Bahier",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Que ce soit pour des formations internes enregistrées, des vidéos YouTube à visée éducative, ou même pour les plus classiques stream Twitch afin de mettre en avant la tech de votre entreprise, il est de plus en plus courant d'avoir besoin de partager virtuellement un contenu présenté qualitativement. C'est là que l'open-source vient à la rescousse : dites bonjour à OBS !\r\n\r\nOBS est en effet le principal outil de construction de \"scènes\" et transmission live de vidéo, sur lequel nombre de surcouches se basent. C'est le stardard de facto pour l'extrême majorité d'entre nous.\r\n\r\nPour autant, ce n'est pas forcément intuitif au premier abord, et il est aisé de se perdre dans tant d'options et de notions d'encoding vidéo, mixage audio, caméras virtuelles, capture de contenu, etc.\r\n\r\nCe talk est là pour vous aider à appréhender les bases et vous lancer dans l'enregistrement et la diffusion de contenu \"propre\", contrôlé et professionnel (ou streamer professionnel, au choix ;) )."
}, {
  "id" : "671087",
  "name" : "OpenFeature : Vers La normalisation du feature flags",
  "event_start" : "2024-06-27T17:35:00",
  "event_end" : "2024-06-27T18:00:00",
  "event_type" : "DevOps",
  "format" : "Tool in action",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "Morgan Blanloeil",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Les feature flags révolutionnent la gestion des fonctionnalités logicielles en permettant une activation ou une désactivation dynamique. \r\nC'est un peu comme activer et désactiver le bouclier déflecteur sur son étoile de la mort. Promu par l'empereur la CNCF, OpenFeature s’impose comme la nouvelle norme intergalactique du feature flags. \r\nDécouvrons ensemble l'intégration de cette solution sur un projet front et back office. Avec l’aide des différents providers, de la nouvelle norme OFREP (OpenFeature Remote Evaluation Protocol ) et des forces rebelles, nous verrons en quoi OpenFeature permet notamment de briser les chaînes vendor lock-in !\r\n"
}, {
  "id" : "653610",
  "name" : "Model Mitosis : ne plus se tromper entre les microservices et le monolithe",
  "event_start" : "2024-06-27T10:30:00",
  "event_end" : "2024-06-27T11:25:00",
  "event_type" : "Architecture",
  "format" : "Conférence",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Julien Topçu, Josian Chevalier",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Tout comme le développement doit être itératif, le design du logiciel doit changer lorsque le contexte et notre compréhension du problème évoluent. Au fur et à mesure qu'un logiciel se développe pour résoudre plus de problèmes, il devient moins souple dans sa capacité à évoluer. Des tensions apparaissent au sein du modèle métier du logiciel qui peine à rester cohérent.\r\n\r\nFinalement, il atteint une masse critique et devient un monolithe de code en spaghetti... Comment pouvons nous déterminer quand il est temps de modulariser notre logiciel ? Comment prendre la décision de le scinder en plusieurs modules ou services ? Comment gérer la différenciation progressive de nos modèles métiers tout en évitant les couplages inutiles ? Il n'est pas facile de découper son logiciel en deux car déterminer les bonnes frontières peut s'avérer être compliqué.\r\n\r\nDécouvrez avec nous le Model Mitosis, une approche dynamique utilisée pour diviser un modèle métier en plusieurs modèles qui seront façonnés et découplés de manière itérative. Gagnez en flexibilité afin de mieux déterminer quand diviser votre logiciel en plusieurs services tout en évitant de payer les coût d'échelle des microservices ou bien de devenir un monolithe distribué."
}, {
  "id" : "653779",
  "name" : "JSol'Ex : traitement d'images solaires en Java",
  "event_start" : "2024-06-27T11:35:00",
  "event_end" : "2024-06-27T12:30:00",
  "event_type" : "Autre...",
  "format" : "Conférence",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Cédric Champeau",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Le Sol'Ex (\"Solar Explorer\") est un instrument amateur, inventé par Christian Buil, qui permet d'observer le soleil sous différentes longueurs d'ondes. C'est un type de spectrohéliographe, un instrument qui date des années 1890, mais qui était gros et difficile à utiliser. Avec les technologies modernes comme les capteurs CMOS et les imprimantes 3D, nous disposons désormais d'instruments bon marché accessibles à tous les amateurs.\r\nCe qui est cependant intéressant avec cet instrument, c'est qu'il ne produit pas directement une image observable \"à l'oculaire\". En effet, le traitement logiciel est indispensable : il demande la reconstruction d'une image à partir d'une vidéo qui contient une portion du spectre solaire.\r\nLe logiciel officiel pour faire ce traitement s'appelle INTI, est co-écrit par Valérie Desnoux et Christian Buil, en Python. Mais en tant qu'astronome amateur, j'étais habitué à utiliser des logiciels pour le traitement d'images astronomiques, mais pas à en concevoir. J'ai pris l'opportunité de l'utilisation du Sol'Ex pour me lancer dans le challenge d'écrire un logiciel pour le Sol'Ex, mais écrit en Java, qui me permettrait à la fois de comprendre comment cet incroyable instrument fonctionne, mais aussi de me lancer des défis, tels que savoir si j'étais encore capable de lire des papiers académiques.\r\nDans cette session je présenterai donc mon résultat, presque un an après mon premier contact avec un Sol'Ex, et ce qui fait de JSol'Ex un logiciel unique."
}, {
  "id" : "663769",
  "name" : "Playwright : tester vos applications devient un jeu d'enfant",
  "event_start" : "2024-06-27T12:45:00",
  "event_end" : "2024-06-27T13:00:00",
  "event_type" : "Web",
  "format" : "Quicky",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Benjamin Cavy",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Tester unitairement ses composants graphiques c'est bien, tester le bon fonctionnement de toute son application via un navigateur pilotable programmatiquement c'est mieux !\r\n\r\nJe vous propose de vous présenter par la pratique Playwright, un outil permettant de tester les fonctionnalités de vos applications de manière performante dans tous les grands navigateurs du marché.\r\n\r\nJ'ai longtemps été un amoureux de Cypress pour ce genre de cas d'usage, mais j'ai été récemment très séduit par Playwright, qui propose à mon avis une meilleure expérience développeur via un outillage très complet.\r\n"
}, {
  "id" : "670888",
  "name" : "Quelle est la structure d’un virus informatique et quels sont les outils de détection de virus",
  "event_start" : "2024-06-27T13:05:00",
  "event_end" : "2024-06-27T13:20:00",
  "event_type" : "Autre...",
  "format" : "Quicky",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Nailya Bogrova",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Les virus informatiques représentent de graves menaces pour les systèmes et les utilisateurs, notamment la destruction de données, le vol d'identité, la propagation, et bien d'autres encore.\r\n\r\nPour mieux comprendre leur fonctionnement, nous explorerons un exemple de virus simple en Python. \r\nEn comprenant les méthodes utilisées par les créateurs de logiciels malveillants, nous sommes mieux outillés pour d'identifier les vulnérabilités, de développer des outils de détection avancés, de sensibiliser les utilisateurs aux risques, et de concevoir des contre-mesures efficaces.\r\n\r\nL'objectif de cette présentation est d'offrir un aperçu de la structure possible des virus et des méthodes d'analyse pour déterminer si un programme est malveillant ou non."
}, {
  "id" : "666457",
  "name" : "Redis, le plus sous-estimé des plus utilisés !",
  "event_start" : "2024-06-27T13:30:00",
  "event_end" : "2024-06-27T14:25:00",
  "event_type" : "Architecture",
  "format" : "Conférence",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Adrien Wattez, Mickaël Barroux",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Découvrons ensemble les quinze années d'expérience de Redis, offrant une rétrospective riche en usages variés. Explorez comment tirer le meilleur parti de Redis avec des cas d'utilisation innovants, tout en abordant les défis de sa mise en production. De plus, plongeons dans les récentes évolutions de sa licence et comparons-le à ses alternatives telles que KeyDB, Valkey, Dragonfly et Skytable."
}, {
  "id" : "670736",
  "name" : "La bienveillance, (je trouve que) c'est de la 💩",
  "event_start" : "2024-06-27T14:35:00",
  "event_end" : "2024-06-27T15:30:00",
  "event_type" : "Autre...",
  "format" : "Conférence",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Malo Toanen, Luc Sorel-Giffo",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : " Bon, on y est allé un peu fort sur le titre. La bienveillance est souvent revendiquée comme valeur de parents, de médiation, d’entreprise ; mais qu’implique-t-elle comme charge mentale, dissonance cognitive ou étiquette à porter ? Et puis qu’est-ce que ça veut dire être bienveillante ou bienveillant à la fin ?\r\n\r\n La bienveillance peut-elle d’ailleurs vraiment s’appliquer dans le milieu professionnel (travail d’équipe, management) où le rapport de force est souvent asymétrique ? D’ailleurs, est-ce vraiment une notion pertinente dans un débat opposant des intérêts ou des opinions divergentes ?\r\n\r\n La communication non violente est une méthodologie proposée pour la gestion de conflits, petits ou graves ; mais est-elle toujours applicable ? Sur quels fondements repose-t-elle ?\r\n\r\n Alors, allons-nous vraiment vous dire d’arrêter d’être empathique, d’arrêter de dire s’il te plaît, d’arrêter d’écouter attentivement la parole des autres ?\r\n Vous le saurez en venant."
}, {
  "id" : "659416",
  "name" : "Les feature flags : le couteau suisse de votre flow de développement",
  "event_start" : "2024-06-27T16:00:00",
  "event_end" : "2024-06-27T16:55:00",
  "event_type" : "Architecture",
  "format" : "Conférence",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Benjamin Cavy",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Les features flags sont une technique permettant d'activer ou désactiver à la demande certaines fonctionnalités d'une application.\r\n\r\nIls permettent non seulement de rendre les mises en production moins effrayantes, séparant le déploiement du livrable et l'activation des nouvelles fonctionnalités mais aussi de simplifier le flow de développement, en permettant de livrer des features non finalisées.\r\n\r\nAu travers d'exemples, nous verrons comment mettre en place les features flags, ce qu'ils peuvent apporter, mais également les dérives auxquels ils peuvent aboutir les manières de les éviter."
}, {
  "id" : "657061",
  "name" : "C4 model, la solution pour standardiser mes schémas d'architecture ?",
  "event_start" : "2024-06-27T17:05:00",
  "event_end" : "2024-06-27T17:30:00",
  "event_type" : "Architecture",
  "format" : "Tool in action",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Jérôme Gauthier",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "L'accélération des rythmes d'innovation et de transformation, couplée à la diversification des types d'architecture logicielle, entrainent de plus en plus l'abandon des modélisations historiques type UML ou ArchiMate, à la fois riches mais aussi complexes à maitriser et maintenir.\r\n\r\nMais comment garder une forme de standardisation dans les représentations d'architecture, tout en permettant un niveau fin de personnalisation, une bonne collaboration, et une maintenance simple et accessible orientée diagram-as-code ?\r\n\r\nDurant cette session je vous propose de partir à la découverte du C4 Model, en explorant ses concepts et ses limites via un cas pratique avec l'outil Structurizr."
}, {
  "id" : "670850",
  "name" : "SQL Test Kit, ou comment tester unitairement vos requêtes SQL",
  "event_start" : "2024-06-27T17:35:00",
  "event_end" : "2024-06-27T18:00:00",
  "event_type" : "Data",
  "format" : "Tool in action",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Victor Landeau",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "De nos jours, même si les outils et pratiques de tests automatisés sont assez développés dans la plupart des langages de programmation, ce n'est pas le cas dans le monde du SQL. Pourtant, le nombre de bugs et d'erreurs générés quotidiennement dans les entreprises est considérable, les amenant à prendre des décisions basées sur des analyses erronées.\r\n\r\nMalheureusement, la plupart des services cloud tels que Google BigQuery ou Amazon Redshift ne proposent aucun outil permettant aux développeurs de tester leurs requêtes. Au cours de cette conférence, nous présenterons une méthode simple pour tester unitairement vos requêtes SQL sur BigQuery, applicable à tout entrepôt de données et dialecte SQL, en utilisant le package suivant : https://pypi.org/project/sql-test-kit/"
}, {
  "id" : "662469",
  "name" : "Manifeste pour un artisanat logiciel responsable",
  "event_start" : "2024-06-27T10:30:00",
  "event_end" : "2024-06-27T11:25:00",
  "event_type" : "Écoconception",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Cécilia Bossard",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Souvent désigné comme la solution a tous les problèmes, le numérique est loin d'être la \"silver bullet\" attendue aux problèmes actuels.\r\n\r\nSon empreinte environnementale est non négligeable et ne cesse de grandir. Il est également source d'exclusion sociale (problèmes d'accessibilité, de connectivité, de ressources, de discrimination, ...).\r\n\r\nEt si en tant qu'artisans logiciel, nous prenions enfin ces problématiques en compte ?\r\n\r\nJe vous propose de voir ce qu'on entend par numérique responsable et comment l'intégrer dans nos pratiques quotidiennes pour essayer de tendre vers un artisanat logiciel plus responsable.\r\n"
}, {
  "id" : "660870",
  "name" : "Le langage Mojo 🔥: Un nouvel espoir pour l'IA ?",
  "event_start" : "2024-06-27T11:35:00",
  "event_end" : "2024-06-27T12:30:00",
  "event_type" : "IA",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Jean-Luc Tromparent",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Dans notre galaxie où l'innovation en matière d'intelligence artificielle est constamment en lutte avec la fragmentation, alimentée par une diversité de langages et de plateformes d'accélération matérielle, une dualité s'installe : d'un côté, Python règne en maître pour la modélisation et le prototypage, de l'autre, C, C++, Rust sont régulièrement convoqués pour la performance et la fiabilité. Cette dichotomie bride l'innovation, les experts fullstack se retrouvant souvent sous l'emprise de l'empire GAFAM.\r\n\r\nPourtant, un nouvel allié, le langage Mojo 🔥 émerge de l'ombre. Lancé il y a un an par la startup Modular créee par Chris Lattner (LLVM, CLang, Swift...) et désormais libéré en open source, Mojo se profile comme un puissant outil pour façonner l'avenir de l'IA. \r\n\r\nJ'ai voulu approfondir les concepts du langage et évaluer la courbe d'apprentissage en réalisant un benchmark de différentes implémentations d'un use-case de traitement d'image. Je vous raconterai dans ce talk comment après m'être laissé tenté par le coté obscur et connu un échec cuisant, je suis finalement revenu dans la voie du Jedi et obtenu des performances blazing fast."
}, {
  "id" : "652393",
  "name" : "SOPS, Passez un savon à vos secrets en clair !",
  "event_start" : "2024-06-27T12:45:00",
  "event_end" : "2024-06-27T13:00:00",
  "event_type" : "DevOps",
  "format" : "Quicky",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Sylvain Métayer",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Chacun à ses secrets. Vos applications également. Cependant, tout comme nous avons droit à notre jardin secret, nos secrets aimeraient bien avoir leur petit coin ou ils peuvent indiquer leur données sensibles…​ Au vu de tous dans un dépôt Git consultable par toute votre équipe, cela s’annonce compliqué ? Venez voir comment SOPS peut vous aider, et vous pourrez ensuite passer un savon à quiconque pousse des secrets en clair sur vos dépôts !"
}, {
  "id" : "666835",
  "name" : "Introduction aux Threads Virtuels en SpringBoot 3 à travers une démonstration",
  "event_start" : "2024-06-27T13:05:00",
  "event_end" : "2024-06-27T13:20:00",
  "event_type" : "Développement",
  "format" : "Quicky",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Emmanuelle Rouillé",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Les Threads Virtuels ont été releasés en Java 21. Ils apportent une alternative à la programmation réactive pour surmonter les problématiques liées aux traitements synchrones bloquants. Spring Boot 3, de son côté, offre un support en terme de configuration. L’objectif de ce quickie est de faire découvrir leur association à travers une démonstration.\r\nDans une première étape, un test de charge sera réalisé sur une application Spring Boot 3 consommant un service REST de façon synchrone bloquante. Dans une deuxième étape, le même test de charge sera réalisé sur la même application, après activation des Threads Virtuels, permettant ainsi de constater les gains apportés. La gestion des threads « sous le capot » sera évoquée dans chacune des deux étapes, afin d’apporter une explication aux comportements observés."
}, {
  "id" : "669386",
  "name" : "Discuter avec ses articles de journaux : le RAG, kesako ?",
  "event_start" : "2024-06-27T13:30:00",
  "event_end" : "2024-06-27T14:25:00",
  "event_type" : "IA",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Victor Klötzer, Cédric Jézéquel",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Réseau de neurones, LLM, Machine learning, Deep Learning, IA générative... Tous ces acronymes et concepts liés à l'Intelligence Artificielle commencent à s'ancrer dans notre quotidien professionnel et personnel. Le Big Bang qu'a été le lancement de ChatGPT en 2022, agent conversationnel basé sur un Large Language Model (LLM), a mis en lumière le potentiel immense de ces algorithmes.​\r\n\r\nLe RAG (Retrieval-Augmented Generation), système permettant d'utiliser un LLM pour créer des chatbots sur des documents, est l'une de ces nouvelles manières d'utiliser l'IA.​\r\n\r\nQuels sont les briques et concepts sous-jacents au fonctionnement d'un RAG ? Quels sont les challenges pour mettre en place ce genre de système ? Quelles applications pratiques peut-on imaginer ? Vulgarisation scientifique, idées d'amélioration et cas d'usages chez Ouest-France rythmeront cette conférence sur le RAG."
}, {
  "id" : "671001",
  "name" : "De HTTP 1 à 3, pourquoi et comment ?",
  "event_start" : "2024-06-27T14:35:00",
  "event_end" : "2024-06-27T15:30:00",
  "event_type" : "Web",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Alexis Delhelle",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "L'arrivée d'HTTP3 est marquée principalement par le passage de TCP à UDP avec l'utilisation du protocole QUIC.\r\n\r\nMais pourquoi ce besoin ? Quels sont les problèmes à l'origine de changement ?\r\n\r\nC'est ce que l'on va découvrir ensemble, en commençant par le passage de HTTP1 à HTTP2, et limites qui ont poussé vers cette nouvelle version.\r\n\r\nOn parlera aussi des apports/gains de ces nouvelles versions, et de la cohabitation de ces 3 versions dans le web actuel."
}, {
  "id" : "666799",
  "name" : "L'architecture Micro-frontends, un nouvel espoir ?",
  "event_start" : "2024-06-27T16:00:00",
  "event_end" : "2024-06-27T16:55:00",
  "event_type" : "Web",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Gregory Houllier",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Le développement backend à l'approche micro service et depuis plusieurs années les micros frontends semblent devenir une approche permettant la modulation de nos applications web.\r\n\r\nQu'est-ce qui se cache derrière cette architecture ? Peut on mixer de l'Angular avec du React et du Vue? \r\n\r\nCe talk sera l'occasion sous la forme d'un retour d'expérience lors de sa mise en œuvre chez ContentSquare, de voir les avantages et les limites de l'approche micro frontends."
}, {
  "id" : "652394",
  "name" : "asdf, un outil pour toutes vos versions",
  "event_start" : "2024-06-27T17:05:00",
  "event_end" : "2024-06-27T17:30:00",
  "event_type" : "DevOps",
  "format" : "Tool in action",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Sylvain Métayer",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Revenons quelques années en arrière…​\r\n\r\n\r\nAout 2020, sortie de Terraform 0.13, votre nouveau projet saute dessus et l’utilise!\r\n\r\n\r\nJuin 2021, sortie de Terraform 1.0, pile au moment de déployer cette nouvelle infra, c’est parfait ! Pour votre ancien projet par contre, c’est un breaking change, il va falloir installer tfenv pour gérer les 2 versions..\r\n\r\n\r\nAvril 2022, sortie de NodeJS 18, parfait pour démarrer votre side-project ! Dommage pour votre ancienne librairie JS, bloqué en NodeJS 14, il va falloir installer nvm pour gérer les 2 versions, plus de temps pour faire la mise à jour..\r\n\r\n\r\nFatigué de devoir installer 50 outils différents pour changer de version de node/java/terraform/…​ ?\r\n\r\n\r\nVous aimeriez trouver un outil pour gérer de la même façon toutes les versions de vos outils, voir créer vos propres plugin pour gérer les versions de votre nouvel outil ?\r\n\r\n\r\nVenez à la rencontre d’asdf et voyons comment il pourra vous aider au quotidien !"
}, {
  "id" : "666318",
  "name" : "/e/OS, mon smartphone Android sans Google",
  "event_start" : "2024-06-27T17:35:00",
  "event_end" : "2024-06-27T18:00:00",
  "event_type" : "Mobile",
  "format" : "Tool in action",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Benoît Masson",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Vous avez sans doute déjà entendu (ou prononcé) les phrases suivantes :\r\n\r\n> \"Je peux partager mes données, je n'ai rien à cacher\"\r\n> \"Android c'est open-source, mes données sont protégées\"\r\n\r\nSauf qu'en fait, non… votre smartphone sait beaucoup de choses sur vous, et en partage énormément avec Google (Android) ou Apple (iOS). Et même si vous n'avez rien à cacher, vous n'avez pas intérêt à les donner massivement (vie privée, sécurité, dépendance, profilage, …).\r\n\r\nJe vais vous présenter /e/OS (https://e.foundation/), une distribution Android créée pour respecter votre vie privée :\r\n- suppression des services Google intégrés\r\n- applications open-source respectueuses de vos données\r\n- cloud respectueux ou auto-hébergé\r\n\r\nLe tout est facile d'accès, compatible avec un grand nombre de terminaux, et conserve une compatibilité maximale avec tous vos services.\r\n\r\nEt si vous n'avez pas envie de changer de téléphone ou de tout réinstaller du jour au lendemain, on évoquera des pistes pour reprendre progressivement la main sur vos données."
}, {
  "id" : "671149",
  "name" : "Keycloak & Authorization : A New Hope",
  "event_start" : "2024-06-27T10:30:00",
  "event_end" : "2024-06-27T11:25:00",
  "event_type" : "Sécurité",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Sébastien Brousse",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Keycloak, c'est le Jedi des solutions d'identity & Access Management (IAM) : toujours de bons conseils, il permet de mettre en place de l'authentification en Single Sign On (SSO) pour toutes vos applications et en amenant avec lui pleins de fonctionnalités : gestion du mot de passe oublié, du Social Login, de l'authentification via mobile ou Yubikeys (MFA), et même des PassKeys pour se logger sans mot de passe.\r\n\r\nPar contre, pour la gestion des droits et des permissions sur les utilisateurs, c'est plutôt le côté obscur de la Force avec des configurations d'une complexité à faire rougir Darth Maul. \r\n\r\nOn fera un tour d'horizon des concepts liés aux politiques d'autorisations et on montrera comment intégrer un Open Policy Agent pour décrire et centraliser des règles d'autorisation sur des cas d'usage de + en + complexe, et, enfin, ramener l'équilibre dans la Force."
}, {
  "id" : "668071",
  "name" : "Bug Bounty : Révolutionner la détection des vulnérabilités dans votre SI et passer à l'échelle",
  "event_start" : "2024-06-27T11:35:00",
  "event_end" : "2024-06-27T12:30:00",
  "event_type" : "Sécurité",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Florian Girard, Florent Le Borgne",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Rejoignez nous lors d'une conférence où l'univers du Bug Bounty sera démystifié et contextualisé au sein d'un groupe de 5000 collaborateurs. Forts d’une expertise de cinq ans dans la pratique du Bug Bounty, nous vous invitons à explorer l’intégration et l'impact de ces programmes au sein de différentes DSI, dans une structure aux multiples facettes.\r\n\r\nQu'il s'agisse de sites web, d'applications mobiles, d'API ou de progiciels, découvrez comment le Bug Bounty se déploie sur diverses applications pour renforcer la sécurité informatique. Nous partagerons avec vous les clés du succès, les leçons apprises et les défis surmontés, grâce à des témoignages vécus et des retours d'expérience concrets.\r\n\r\nVous êtes curieux des techniques employées? Nous aborderons aussi les différents modes opératoires du Bug Bounty, y compris les approches boîte blanche, grise et noire, et leur pertinence selon les contextes et les objectifs de sécurité.\r\n\r\nCette session promet de vous fournir des perspectives enrichissantes et des stratégies éprouvées pour capitaliser sur le Bug Bounty et transformer la sécurité de votre organisation\r\n\r\n"
}, {
  "id" : "669841",
  "name" : "La Diva 👑, la Rockstar 🎸 et le consultant 💁",
  "event_start" : "2024-06-27T12:45:00",
  "event_end" : "2024-06-27T13:00:00",
  "event_type" : "Autre...",
  "format" : "Quicky",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Antoine Cailly",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "J'ai un temps pensé qu'il suffisait de réunir des personnes compétentes pour qu'un projet fonctionne\r\nEt puis mes expériences dans plusieurs équipes et divers contextes m'ont montré que ce n'est pas si simple.\r\n\r\nIl existe une multitude d'études présentant ce qui fait la qualité d'un équipe ou le succès d'un projet mais pendant ce talk j'aimerais plutôt vous présenter une prise de recul personnelle par rapport à mon vécu.\r\n\r\nOn parlera d'expertise et de la notion de service.\r\nOn parlera aussi de ces petits plus qui font une réputation, d'un cercle vertueux qui donne des ailes, d'une équipe détruite, des risques du plein emploi, etc.\r\n\r\nJ'espère que ca vous sera utile si, comme moi, vous n'êtes pas une rockstar mais appréciez quand ce que vous faîtes tous les jours rend service à quelqu'un."
}, {
  "id" : "671126",
  "name" : "Comment faire une bonne campagne de Green Washing Solutioniste ?",
  "event_start" : "2024-06-27T13:05:00",
  "event_end" : "2024-06-27T13:20:00",
  "event_type" : "Écoconception",
  "format" : "Quicky",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Maxime Dupont",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Préparez-vous à plonger dans l'univers captivant du Green Washing dans la tech ! Découvrez les astuces et les stratégies farfelues pour verdir votre image sans rien faire pour la planète. Rejoignez-nous pour explorer ensemble comment embrouiller les esprits avec des actions écolos qui ne sont que de la poudre aux yeux. Préparez-vous à apprendre comment surfer sur la vague verte sans jamais vraiment mouiller le maillot ! Ne manquez pas cette occasion unique d'apprendre l'art subtil du green washing dans la tech, car après tout, c'est bon pour la planète, non ?"
}, {
  "id" : "662102",
  "name" : "Loi de Conway : Lorsque votre conception produit se fâche avec votre organisation",
  "event_start" : "2024-06-27T13:30:00",
  "event_end" : "2024-06-27T14:25:00",
  "event_type" : "Méthodologie",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Julien Topçu",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Bien que vous suiviez les bonnes pratiques, le logiciel construit s'écarte souvent de la vision produit, technique et parfois même des besoins de l'utilisateur ?\r\n\r\nEt si on vous disait qu'il existe une force qui a une influence certaine sur ce que vous produisez ? \r\n\r\nVenez découvrir la Loi de Conway qui a un pouvoir sur ce que vous construisez quelque soit votre métier. Nous verrons ses impacts sur les différents aspects du logiciel et nous apprendrons comment l'apprivoiser."
}, {
  "id" : "665161",
  "name" : "5 ans avec Flutter",
  "event_start" : "2024-06-27T14:35:00",
  "event_end" : "2024-06-27T15:30:00",
  "event_type" : "Développement",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Youen Garel, Can Yalin",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Flutter est le framework simple et rapide pour développer des IHMs web, mobile et desktop. Il est utilisé par BMW, SNCF, Toyota, Philips... et nous depuis juillet 2019. En 5 ans, nous avons vu le gain de productivité et les avantages, nous avons atteint des limites et nous sommes tombés dans quelques pièges.\r\nLors de ce talk, nous te racontons tout ça, et ton projet Flutter tu réussiras."
}, {
  "id" : "654007",
  "name" : "Est-il (encore) possible d'héberger son propre serveur de messagerie ?",
  "event_start" : "2024-06-27T16:00:00",
  "event_end" : "2024-06-27T16:55:00",
  "event_type" : "Autre...",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Hugues Lepesant",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "La messagerie électronique c'est 300 milliards de messages par jour, mais savez-vous ce qui se passent quand vous cliquez sur \"Envoyer\" ?\r\n\r\nDepuis son invention jusqu'à nos jours, re-découvrez l'histoire de la messagerie, et des moyens de luttes contre le SPAM et le phishing.\r\n\r\nDans cette présentation, j'explique le fonctionnement de SMTP, l'importance de DNS.\r\n\r\nEt je fais un retour d'expérience sur l'hébergement de mon propre serveur de messagerie, depuis le début et les configurations mises en place avec l'arrivée des nouvelles techniques de lutte contre le SPAM adoptées par les grands acteurs de la messagerie électronique.\r\n\r\nAinsi je détaille les points à ne pas oublier pour que vos mails arrivent dans la boite de vos destinataires."
}, {
  "id" : "670834",
  "name" : "Exegol : Le Hacking à base de conteneurs",
  "event_start" : "2024-06-27T17:05:00",
  "event_end" : "2024-06-27T17:30:00",
  "event_type" : "Sécurité",
  "format" : "Tool in action",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Antoine Mayer",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Plongez dans l'univers de la sécurité et du hacking avec Exegol, un outil qui vous fera rapidement oublier votre bonne vieille VM kali pour laisser place à la flexibilité et la rapidité des conteneurs Docker !\r\n\r\nNous découvrirons comment cet outil peut être utilisé pour renforcer la sécurité d'une infrastructure, détecter les vulnérabilités ou optimiser les pratiques de hacking éthique.\r\n\r\nUne installation d'Exegol sera faite avant de passer à la pratique avec un challenge CTF, conçu pour simuler des scénarios réalistes et explorer les fonctionnalités de l'outil dans le cadre d'un test de pénétration."
}, {
  "id" : "662583",
  "name" : "Compose to Kube, Episode IV: Un nouvel espoir",
  "event_start" : "2024-06-27T17:35:00",
  "event_end" : "2024-06-27T18:00:00",
  "event_type" : "DevOps",
  "format" : "Tool in action",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Nicolas De Loof",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Kubernetes est le standard _de facto_ dans notre industrie pour orchestrer des applications conteneur-izées en production. Les développeurs apprécient pourtant toujours autant la simplicité et la compacité du modèle proposé par Docker Compose, au moins pendant le développement. Une demande qui revient donc en boucle concerne une traduction auto-magique du compose.yaml en fichiers kube.yaml.\r\n\r\nCette fonctionnalité a été proposée par de nombreux outils, avec des approches diverses, y compris par Docker avec “Compose on Kubernetes” qui a finalement été déprécié. Nous avons eu une expérience similaire avec les \"Cloud Integrations\" et le traduction de Compose vers Amazon ECS.\r\n\r\nDans cette session, nous explorerons notre héritage pour comprendre les raisons de ces échecs, avant de vous présenter la nouvelle génération d'outil \"Compose to Kube\" sur laquelle nous travaillons, qui veut combiner la simplicité pour un développeur à déployer son application compose.yaml sur k8s, and la flexibilité pour les équipes plateforme de contrôler et d'adapter la conversion pour correspondre aux solutions techniques déployées sur leur cluster."
}, {
  "id" : "cd511483-779b-4674-b86e-07ff4bc0f47c",
  "name" : "Keynote",
  "event_start" : "2024-06-27T18:05:00",
  "event_end" : "2024-06-27T18:50:00",
  "event_type" : "Keynote",
  "format" : "Keynote",
  "venue" : "Amphi C",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
}, {
  "id" : "f4e09f05-8253-4b02-a382-da9b4b07d51e",
  "name" : "Meet'n Greet",
  "event_start" : "2024-06-27T18:50:00",
  "event_end" : "2024-06-27T23:00:00",
  "event_type" : "Eat",
  "format" : "Eat",
  "venue" : "Hall",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
}, {
  "id" : "1f0f8bd1-9192-441e-b1fa-0da65a8db338",
  "name" : "Accueil / Café",
  "event_start" : "2024-06-28T08:00:00",
  "event_end" : "2024-06-28T09:00:00",
  "event_type" : "Eat",
  "format" : "Eat",
  "venue" : "Hall",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
}, {
  "id" : "d45a40a7-ee98-40fd-930c-79f4d3762729",
  "name" : "Keynote",
  "event_start" : "2024-06-28T09:00:00",
  "event_end" : "2024-06-28T09:30:00",
  "event_type" : "Keynote",
  "format" : "Keynote",
  "venue" : "Amphi C",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
}, {
  "id" : "43ddb221-7ad3-44f3-9fe3-b69f35ddb3fe",
  "name" : "Pause Café",
  "event_start" : "2024-06-28T10:00:00",
  "event_end" : "2024-06-28T10:30:00",
  "event_type" : "Eat",
  "format" : "Eat",
  "venue" : "Hall",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
}, {
  "id" : "656887",
  "name" : "Racine carrée, bit-shifting et paracétamol",
  "event_start" : "2024-06-28T10:30:00",
  "event_end" : "2024-06-28T11:25:00",
  "event_type" : "Autre...",
  "format" : "Conférence",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "Audren Burlot",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "\"i  = 0x5f3759df - ( i >> 1 ); // what the f*ck? \"\r\nCette ligne de code, vous la connaissez peut-être, elle est en prod depuis 1999.\r\nElle permet à elle seule de rendre l'exécution du programme 3 fois plus rapide.\r\nCe programme, c'est Quake 3, un des jeux-vidéos les plus connus et optimisés de l'histoire.\r\nTout ceci vous parait bien mystérieux ? C'est normal.\r\nVous vous dites que c'est n'importe quoi et que ça n'a rien à voir avec le thème ? Vous n'avez pas tort.\r\nVous acceptez de venir décortiquer et enfin comprendre l'un des bouts de code les plus célèbres des 20 dernières années ? Alors c'est parti mon Wookiee !"
}, {
  "id" : "664942",
  "name" : "BackToBasics: texte et numÃ©rique",
  "event_start" : "2024-06-28T11:35:00",
  "event_end" : "2024-06-28T12:30:00",
  "event_type" : "Développement",
  "format" : "Conférence",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "Guillaume Collic",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Le texte est incontournable, mais il nous amène parfois quelques surprises. En tant qu'utilisateur·ice ou en tant que professionnel·le du numérique, vous avez probablement déjà rencontré un problème dit d'encodage, comme un e accent aigu qui a été remplacé par \"Ã©\". Nous allons retourner aux fondamentaux, et expliquer de 'a' à 'z' en passant par 'Ã©' comment le numérique considère le texte, quels points d'attention cela amène, pour démystifier ce sujet."
}, {
  "id" : "bdad07f8-41b7-441d-919a-dcba2045cbe2",
  "name" : "Pause déjeuner",
  "event_start" : "2024-06-28T12:30:00",
  "event_end" : "2024-06-28T13:30:00",
  "event_type" : "Eat",
  "format" : "Eat",
  "venue" : "Hall",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
}, {
  "id" : "666197",
  "name" : "Optimisation de performance bénéfice ou sacrifice ?",
  "event_start" : "2024-06-28T13:30:00",
  "event_end" : "2024-06-28T14:25:00",
  "event_type" : "Écoconception",
  "format" : "Conférence",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "Emmanuel-Lin Toulemonde",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Plus le code est rapide, plus le code est bon. Au-delà de cette phrase tarte à la crème, ce talk propose de voir quand il faut optimiser du code, comment s'y prendre, et à quel moment s'arrêter.\r\nLes premières optimisations relèvent des bonnes pratiques que tout le monde devrait savoir faire, les suivantes sont sacrificielles : elles dégradent la lisibilité, la maintenabilité du code. \r\nPensé comme une déclinaise concrète de la loi de Eroom proposé par Tristan Nitot, ce talk, commencera avec un exemple de code bien mal codé comme nous l'avons tous déjà fait, puis au fil des optimisations, nous verrons bénéfices et sacrifices à faire pour aller toujours plus vite."
}, {
  "id" : "668905",
  "name" : "L’open-source n’est pas (déjà) mort",
  "event_start" : "2024-06-28T14:35:00",
  "event_end" : "2024-06-28T15:30:00",
  "event_type" : "Autre...",
  "format" : "Conférence",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "Alexandre Brianceau",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Est-ce que le meilleur de l’open-source est derrière nous ? Lorsque l’on voit les changements de licences d’Elastic, MongoDB ou Hashicorp ; ou l’arrivée de CentOS Stream et l’arrêt de distribution sans restrictions des sources par Redhat, on peut se poser la question.\r\n\r\nCette conférence résume les principaux bouleversements et propose d’enquêter sur les raisons de ces changements ainsi que d'étudier leurs impacts. Après avoir raconté l’historique, les licences BSL, SSPL et dérivées sont expliquées concrètement pour comprendre les enjeux.\r\n\r\nDestinées à combattre l’avidité des Cloud Providers et les GAFAM qui ne contribuent pas assez, il n’empêche que ces nouvelles licences ne sont pas open-source.\r\n\r\nQu’est-ce que ces hybridations entre open-source et propriétaire impliquent ? Pourquoi ces entreprises passent par ces mesures ? Est-ce qu’on ne verrait pas les limites de l’open-source ?"
}, {
  "id" : "911c3138-78c6-4380-8082-4fb65c78d4f1",
  "name" : "Pause Café",
  "event_start" : "2024-06-28T15:30:00",
  "event_end" : "2024-06-28T16:00:00",
  "event_type" : "Eat",
  "format" : "Eat",
  "venue" : "Hall",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
}, {
  "id" : "663259",
  "name" : "Apache Software Foundation, comment ça marche ?",
  "event_start" : "2024-06-28T16:00:00",
  "event_end" : "2024-06-28T16:55:00",
  "event_type" : "Autre...",
  "format" : "Conférence",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "JB Onofré",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Qu'est-ce que la foundation Apache, comment ça marche ? C'est quoi un contributeur, un committeur, un PMC ? Et quid de ASF member, board et compagnie ?\r\nEn temps que directeur de la foundation cette année, JB présentera la foundation en détail."
}, {
  "id" : "658493",
  "name" : "De l'IA dans mon API Gateway ??? Mais pour quoi faire ?",
  "event_start" : "2024-06-28T09:35:00",
  "event_end" : "2024-06-28T10:00:00",
  "event_type" : "IA",
  "format" : "Tool in action",
  "venue" : "Amphi A",
  "venue_id" : "1",
  "speakers" : "Mathieu Ancelin",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Dans un monde où l'intégration de l'intelligence artificielle devient la norme, rejoignez-nous pour une exploration fascinante du potentiel de l'IA dans les API Gateways, pierre angulaire des applications modernes. Très orientée démo, cette présentation se concentrera sur des cas d'utilisation variés où l'IA transforme radicalement la productivité des développeurs, la sécurité et les interactions avec les utilisateurs finaux dans le contexte de son utilisation dans une API Gateway.\r\n\r\nNous verrons en détails comment l'IA peut vous éviter de leaker des informations sensibles, vous aider à boostraper votre nouvelle idée géniale très simplement ou encore vous permettre de détecter des anomalies dans vos appels d'API, tout ça via une configuration en langage naturel . Nous verrons également comment adresser les défis de la souveraineté de vos données et des changements de providers.\r\n\r\nCette présentation mettra en lumière l'importance croissante de l'IA dans le développement d'applications moderne. Que vous soyez un développeur, un architecte, ou simplement passionné par les dernières innovations technologiques, cette session vous fournira des insights précieux sur les avantages pratiques de l'IA dans le domaine des API Gateway."
}, {
  "id" : "669460",
  "name" : "Alerte, tout brûle ! Comment gérer des incidents techniques",
  "event_start" : "2024-06-28T10:30:00",
  "event_end" : "2024-06-28T11:25:00",
  "event_type" : "Méthodologie",
  "format" : "Conférence",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "Alexis \"Horgix\" Chotard",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Chez PayFit, malgré le côté \"licorne scale-up\", tout est loin d'être rose et plein de paillettes : en moyenne, sur les 6 derniers mois, nous avons un incident par jour — de gravité différente bien sûr.\r\n\r\nVenez découvrir comment, en l'espace d'un an, nous sommes passé d'une culture où le mot \"incident\" n'existait même pas et où les problèmes soudains étaient cachés dans des board Jira obscurs, à aujourd'hui où nous nous sommes outillés et organisés pour les gérer sereinement et s'en servir comme leviers d'une démarche d'amélioration continue et de réduction de la dette technique.\r\n\r\nAu programme :\r\n- Évaluer la sévérité d'un incident\r\n- Communiquer en interne\r\n- Communiquer publiquement\r\n- Mitigations, troubleshooting, et autre\r\n- Outillage & automatisation\r\n- Post-mortems\r\n- Un mot sur l'astreinte\r\n\r\nVous ressortirez de ce talk avec un retour d'expérience concret sur la manière dont nous gérons nos incidents chez PayFit, et le chemin que nous avons parcouru pour en arriver à une approche saine et constructive, incluant bien sûr des idées et tips que vous pourrez appliquer chez vous si besoin !"
}, {
  "id" : "654521",
  "name" : "Cracking the Quantum Code: Découvrons la révolution quantique !",
  "event_start" : "2024-06-28T11:35:00",
  "event_end" : "2024-06-28T12:30:00",
  "event_type" : "Autre...",
  "format" : "Conférence",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "Laurent Grangeau",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Depuis le début de l'année, les annonces concernant les ordinateurs quantiques se multiplient. L'informatique quantique promet une puissance de calcul sans précédent, révolutionnant des domaines allant de la science des matériaux et de la découverte de médicaments à la modélisation financière et à la cryptographie. Mais qu'est-ce que l'informatique quantique et comment fonctionne-t-elle ? Cette conférence plonge dans le monde fascinant de la mécanique quantique pour dévoiler le fonctionnement interne des ordinateurs quantiques, en explorant des éléments tels que les qubits, les portes quantiques, les circuits quantiques, les algorithmes quantiques, les hardwares quantiques et en montrant comment nous pouvons simuler et exécuter un programme quantique !"
}, {
  "id" : "662959",
  "name" : "Révolutionner la CI/CD avec Dagger: Au-delà des Limites du YAML",
  "event_start" : "2024-06-28T13:30:00",
  "event_end" : "2024-06-28T14:25:00",
  "event_type" : "DevOps",
  "format" : "Conférence",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "Dimitri Quenault",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "La CI/CD, c'est vital, mais quelles sont les limites que l'on peut atteindre ? \r\nPremièrement une grosse usine de tests et de déploiement continu écrite en yaml cela devient vite ingérable et intestable.\r\nIl suffit de prendre des pipelines gitlab-ci avec des conditions, si telle partie de mon code est modifiée et pas une autre, ou alors, je désire effectuer des actions différentes sur mes branches de features ou sur ma branche main. \r\nComment je teste tout ça ? Je crée un commit poubelle en général (fix ci) puis un autre et encore un autre et ainsi de suite…\r\nEt j'attends que mon pipeline passe (ou pas) pour ensuite pouvoir valider mon pipeline. \r\nEt si je pouvais faire cela différemment ? Exécuter d'abord tout cela localement, de surcroît en écrivant mes pipelines dans le langage de mon choix et me limiter au minimum de yaml ?\r\nPour cela, voici Dagger, par Solomon Hykes (entre autres), le précurseur du meilleur outil permettant de gérer du conteneur, pour les développeurs, un paradigme qui va permettre de révolutionner nos pipelines de CI/CD."
}, {
  "id" : "666547",
  "name" : "Stockage web : le guide galactique",
  "event_start" : "2024-06-28T14:35:00",
  "event_end" : "2024-06-28T15:30:00",
  "event_type" : "Web",
  "format" : "Conférence",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "Anthony Le Goas",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Cookie, Web Storage API, Cache, IndexedDB... Il existe bien des méthodes pour stocker des données du côté obscur de la force !\r\nCe talk offre une vue d'ensemble des possibilités disponibles dans les navigateurs en abordant notamment les considérations de sécurité et de performances inhérentes à chaque solution. Que vous soyez un jeune padawan ou un jedi chevronné, ce guide vous permettra de prendre des décisions éclairées lors de la conception d'applications web."
}, {
  "id" : "662478",
  "name" : "Unleashing the Force of Spring Boot 3",
  "event_start" : "2024-06-28T16:00:00",
  "event_end" : "2024-06-28T16:55:00",
  "event_type" : "Web",
  "format" : "Conférence",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "Guillaume Yan",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Dans une galaxie où la technologie évolue à la vitesse de la lumière, Spring Boot 3 est l'arme ultime pour conquérir les défis du développement logiciel. Rejoignez-moi pour explorer les nouvelles fonctionnalités de Spring Boot 3, telles que les puissantes capacités des images natives de GraalVM, la configuration automatique pour l'observation sans effort, le déploiement simplifié avec Testcontainers et spring-boot-docker-compose, ainsi que la maîtrise de la construction d'images Docker."
}, {
  "id" : "669651",
  "name" : "Gleam, un langage né sous une bonne étoile",
  "event_start" : "2024-06-28T09:35:00",
  "event_end" : "2024-06-28T10:00:00",
  "event_type" : "Développement",
  "format" : "Tool in action",
  "venue" : "Amphi B",
  "venue_id" : "2",
  "speakers" : "Pascal Le Merrer",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Imaginez un langage facile à apprendre, avec une syntaxe plutôt familière. Un langage généraliste, mais  si minimaliste qu'il n'aurait pas de IF.\r\n\r\nImaginez que le compilateur de ce langage vous protège de nombreuses erreurs, tout en vous indiquant clairement celles que vous faites et ce qu'il faut faire pour les corriger.\r\n\r\nImaginez que les applications créées avec ce langage fonctionnent sur la même machine virtuelle qu'Erlang et Elixir, bénéficiant ainsi de sa gestion de la concurrence et de la scalabilité, et vous ouvrant l'accès aux librairies de ces langages.\r\n\r\nImaginez que ces applications puissent aussi fonctionner sur NodeJS, vous permettant de vous appuyer sur les libraires du monde Javascript.\r\n\r\nCe langage existe.\r\n\r\nIl est né sous une étoile rose, dans une galaxie très proche de chez vous.\r\n\r\nIl s'appelle Gleam.\r\n"
}, {
  "id" : "664979",
  "name" : "Linguist : Détecter les langages de 400+ millions de dépôts Git",
  "event_start" : "2024-06-28T10:30:00",
  "event_end" : "2024-06-28T11:25:00",
  "event_type" : "IA",
  "format" : "Conférence",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Paul Chaignon",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Linguist est la bibliothèque logicielle utilisée par GitHub et Gitlab pour détecter les langages sur l'ensemble des plus de 400 millions de dépôts Git existants. Avec un mélange d'heuristiques et de techniques simples de machine learning, Linguist classifie chaque fichier parmi les 720 langages supportés. Cette classification permet ensuite d'appliquer la coloration syntaxique, de calculer des statistiques de langage et de décider des fichiers à cacher dans les diff. Linguist est un projet open source (y compris les données d'entraînement) de GitHub.\r\n\r\nCette présentation expliquera le fonctionnement de Linguist et les principales contraintes qui ont guidé sa conception. Les alternatives envisagées (ex. Pygments, ANNs) seront présentées pour illustrer les contraintes de Linguist. La présentation tâchera de répondre aux questions les plus courantes : comment corriger les résultats dans vos propres dépôts ? comment la décision d'ajouter un langage est prise ?"
}, {
  "id" : "666967",
  "name" : "Comment s’assurer de perdre des données avec Apache Kafka !",
  "event_start" : "2024-06-28T11:35:00",
  "event_end" : "2024-06-28T12:30:00",
  "event_type" : "Data",
  "format" : "Conférence",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Ludovic Boutros, Adam Souquieres",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Apache Kafka, c’est un fantastique système distribué permettant de diffuser et stocker de l’information, des événements techniques ou métiers. Il est extrêmement performant et tolérant aux pannes. Bien entendu, vos données y seront stockées durablement. \r\n\r\nVraiment ? En êtes-vous certains ?\r\n\r\nDurant cette session, nous rappellerons brièvement les concepts principaux d’Apache Kafka et nous enchainerons sur les différents points importants à vérifier afin que vous ne perdiez pas de données avec votre plateforme de streaming de données. Notamment, les différentes architectures possibles et les configurations indispensables pour atteindre vos objectifs en termes de RPO et RTO. \r\nSi ces deux termes sont encore des principes obscurs pour vous, pas de problème, bien au contraire, vous devriez repartir de ce talk avec la connaissance de ces deux notions.\r\n"
}, {
  "id" : "668255",
  "name" : "Le côté obscur des pull requests et comment lutter",
  "event_start" : "2024-06-28T12:45:00",
  "event_end" : "2024-06-28T13:00:00",
  "event_type" : "Méthodologie",
  "format" : "Quicky",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Hadrien Mens-Pellen",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Ce n’est pas la pratique que vous recherchez. La pull request est le mode par défaut d'un nombre incroyable d’équipe. \r\n\r\nPourtant c’est particulièrement inefficace et inadapté à de nombreux contextes. Le votre en fait probablement partie.\r\n\r\nDans ce quicky d’hérétique, je vous propose de regarder le côté obscur de cette pratique et comment vous pouvez repasser du coté clair de la force. "
}, {
  "id" : "663247",
  "name" : "Dédramatisons l'accessibilité",
  "event_start" : "2024-06-28T13:05:00",
  "event_end" : "2024-06-28T13:20:00",
  "event_type" : "Web",
  "format" : "Quicky",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Charline Humeau, Céline Merand",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Parce que l’accessibilité ce n’est pas seulement pour les aveugles\r\nParce que l’accessibilité ce ne sont pas que des interfaces moches\r\nParce que l’accessibilité ça coûte trop cher seulement si on y pense à la fin\r\n\r\nCéline et Charline vous projettent dans des situations concrètes auxquelles vous  serez très certainement, vous-même confrontés un jour. Elles vous donneront quelques clés pour mettre un pied dans un concept pas si inaccessible.\r\n\r\nLaissez-vous convaincre par la nécessité d’adopter l’accessibilité sur vos projets, existants ou à venir. Et si finalement c’était avant tout des bonnes pratiques au quotidien?"
}, {
  "id" : "669638",
  "name" : "Des IA industrialisées à La Poste",
  "event_start" : "2024-06-28T13:30:00",
  "event_end" : "2024-06-28T14:25:00",
  "event_type" : "IA",
  "format" : "Conférence",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Nicolas Payneau, David Mazin",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Venez découvrir comment La Poste a industrialisé en production le réentrainement de ses intelligences artificielles et comment elle les supervise pour améliorer le tri du courrier et du colis en France"
}, {
  "id" : "658654",
  "name" : "Green AI : comment éviter que la potion magique de l'IA ne se transforme en poison ?",
  "event_start" : "2024-06-28T14:35:00",
  "event_end" : "2024-06-28T15:30:00",
  "event_type" : "IA",
  "format" : "Conférence",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Reynald Rivière, Charles Vivoix",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Si on parle de sauvegarde de notre planète à un Data Scientist, il est probable qu’il s’imagine utiliser son savoir pour développer des algorithmes capables d’optimiser l’utilisation de nos ressources pour régler une bonne fois pour toute le problème du réchauffement climatique. \r\nMême si l’IA a très probablement son rôle à jouer sur ce point, elle reste une source de pollution comme une autre. La démarche Green AI ne se veut pas dénonciatrice de notre profession mais vise à la rendre plus écoresponsable. \r\n\r\nLes vrais génies de l'IA sont ceux qui comptent aussi les économies en tonnes de CO2 évitées, pas uniquement en zéros ajoutés au compte en banque ! \r\n\r\nL’IA, c'est pas juste du code et un modèle, c'est aussi un code de conduite. Et coder vert, c'est comme trier ses déchets. \r\n"
}, {
  "id" : "671066",
  "name" : "La quête de la réactivité : L'odyssée des Signals",
  "event_start" : "2024-06-28T16:00:00",
  "event_end" : "2024-06-28T16:55:00",
  "event_type" : "Développement",
  "format" : "Conférence",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "Stéphane Spassevitch",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Explorons ensemble comment SolidJS, Angular, Svelte ou Vue utilisent la force des Signals. L'enjeu est majeur pour dominer la bataille des frameworks front-end, l'empereur React s'apprête à utiliser une nouvelle arme pour contrer la fédération des frameworks utilisant les Signals. Le futur de l'univers du développement web va se jouer sur le front de la réactivité. Les signals vont-ils faire basculer le destin des frameworks front-end ?"
}, {
  "id" : "670097",
  "name" : "Gérer une partie de votre dette technique avec Renovate",
  "event_start" : "2024-06-28T09:35:00",
  "event_end" : "2024-06-28T10:00:00",
  "event_type" : "Développement",
  "format" : "Tool in action",
  "venue" : "Amphi C",
  "venue_id" : "3",
  "speakers" : "David De Carvalho",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "La \"dette technique\" est une thématique très bien connue des développeurs et pas facile à gérer.\r\nLa dette technique recense beaucoup de choses.\r\nUne partie non négligeable est d'être le plus à jour possible dans les versions de nos dépendances de librairies (notamment pour des problématique de sécurité très important depuis quelques mois).\r\nRenovate est là pour nous aider, et faire le job à notre place. En effet c'est un bot qui va mettre à jour nos dépendances à notre place, travail qui est un peu pénible, chronophage et pas très intéressant :p\r\nVenez découvrir un ReX sur le sujet et voir comment le mettre en place rapidement avec des tips&tricks en bonus."
}, {
  "id" : "664924",
  "name" : "JPA ne serait-il pas finalement quantique ?",
  "event_start" : "2024-06-28T10:30:00",
  "event_end" : "2024-06-28T11:25:00",
  "event_type" : "Architecture",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Alexandre Thomazo",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Vous vous êtes souvent demandé comment JPA pouvait à la fois être si rapide à prendre en main mais en même temps demander autant de temps quand les problèmes arrivent ? Ou bien être à la fois si simple à utiliser mais si magique ?\r\n\r\nJe reviens avec vous sur 15 ans d'utilisation de JPA (et d'Hibernate) pour reprendre les concepts de bases de l'outil afin de comprendre la magie, d'avoir les bonnes pratiques pour éviter les travers ainsi que des moyens de sauver la production lorsque les perfs s'écroulent."
}, {
  "id" : "662787",
  "name" : "Cartographier l'Univers de Star Wars avec Neo4j",
  "event_start" : "2024-06-28T11:35:00",
  "event_end" : "2024-06-28T12:30:00",
  "event_type" : "Data",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Thomas Martin, Mickaël Barroux",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Rejoignez-nous dans une galaxie pas si lointaine au cœur de Neo4j, la base de données graphe qui améliore notre compréhension des constellations de données. Lors de cette conférence, nous tracerons notre route à travers les étoiles en suivant ce plan de vol :\r\nComprendre les concepts fondamentaux qui sous-tendent les bases de données graphes.\r\nApprendre à représenter l'univers Star Wars en termes de systèmes et planètes au sein de Neo4j.\r\nMaîtriser le langage de requête Cypher pour interroger et manipuler notre galaxie de données.\r\nDécouvrir les outils qui facilitent le travail avec Neo4j, permettant de visualiser et d'interagir avec nos données spatiales.\r\nIdentifier ce qui distingue Neo4j des bases de données traditionnelles et pourquoi elle est idéale pour cartographier des relations complexes.\r\nQue la Force des graphes soit avec vous pour explorer les liens cachés entre les systèmes et planètes de notre propre galaxie de données !"
}, {
  "id" : "665064",
  "name" : "Le developement embarqué, c'est pour vous aussi !!!",
  "event_start" : "2024-06-28T12:45:00",
  "event_end" : "2024-06-28T13:00:00",
  "event_type" : "IoT Embarqué",
  "format" : "Quicky",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Damien Hackett",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Nous, développeurs embarqué, sommes souvent décriés (à tort) ou idolâtrés (à raison ;) ) par les autres développeurs.\r\n\r\nLe but de ce talk est de démystifier un peu le domaine du développement embarqué pour montrer qu'il n'est pas archaïque et même en avance sur de nombreuses tendances comme le \"Green IT\".\r\n\r\nPas besoin de compétences particulières, juste besoin d'être un peu curieux : venez comme vous êtes !!!\r\n\r\nN.B: Il est possible quand même que l'on vérifie que vous n'avez pas de fuite mémoire à la fin du talk (question d'habitude). Nous nous excusons pour la potentielle gène occasionnée."
}, {
  "id" : "666600",
  "name" : "Pourquoi devriez vous toujours utiliser une pagination par curseur ?",
  "event_start" : "2024-06-28T13:05:00",
  "event_end" : "2024-06-28T13:20:00",
  "event_type" : "Web",
  "format" : "Quicky",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Sébastien Chédor",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Avec l'arrivée du scroll infini, de plus en plus de providers utilisent une pagination par curseur.\r\nPourquoi passer d'une pagination en LIMIT + OFFSET à une pagination par curseur ? Nous verrons dans ce talk plusieurs raisons.\r\nLa première est une raison de performance, y compris sur une seule table indexée correctement.\r\nD'autres motivations, peuvent aussi intervenir, comme le partage via une url fixe, ou bien le fait de ne pas rater de données lors d'un parcours itératif."
}, {
  "id" : "663729",
  "name" : "APIs ❤️ HTML",
  "event_start" : "2024-06-28T13:30:00",
  "event_end" : "2024-06-28T14:25:00",
  "event_type" : "Web",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Benoit Averty",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Et si nos APIs REST retournaient directement du HTML plutôt que du JSON ? Dans ce talk j'ai l'ambition de vous convaincre que c'est en effet une bonne idée dans beaucoup de cas.\r\n\r\nCette approche offre de nombreux avantages : \r\n \r\n- Une utilisation réduite du JS côté front (bonjour les perfs !)\r\n- Un choix plus libre de la techno côté back (On peut faire du front si on est dev java, oui oui)\r\n- La possibilité de faire du vrai REST et du vrai HATEOAS\r\n\r\nCe talk sera un résumé de mes lectures et réflexions (ainsi qu'un retour d'expérience) sur la hype HTMX mais surtout sur le sujet qui va avec : le concept d'API Hypermedia.\r\n\r\nEt si HTML était LA techno low-code qu'on cherche tous pour le front-end ?"
}, {
  "id" : "658043",
  "name" : "Rendre le cloud \"carbon-aware\"",
  "event_start" : "2024-06-28T14:35:00",
  "event_end" : "2024-06-28T15:30:00",
  "event_type" : "Écoconception",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Olivier Bierlaire",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "# \"J'ai toute mon infrastructure dans le cloud, donc je n'émets pas de CO2\"\r\n\r\nLe Cloud cache un vilain secret : il génère autant de gaz à effet de serre que des pays entiers comme la France ou le Royaume-Uni ([IEA, 2021](https://www.iea.org/reports/data-centres-and-data-transmission-networks)). Et ça ne fait qu'empirer, le [cloud vient de dépasser les émissions de l'aviation](https://thereader.mitpress.mit.edu/the-staggering-ecological-impacts-of-computation-and-the-cloud/) !\r\n\r\nLes équipes Infra & Cloud ont l’opportunité d’atténuer ce problème. Tout commence par une simple décision : choisir la bonne région chez son hébergeur favori (GCP, Azur, AWS..). Et devinez quoi ? Ce choix peut diviser vos émissions par 10, voire 20 ! Selon la météo, un pays comme l’Irlande a une intensité carbone de 400 gCO2eq/kWh quand le réseau français peut descendre à 20 g. Et ils y a bien d'autres moyens d'actions!\r\n\r\nJe vais donc montrer comment on peut mesurer et réduire drastiquement ces émissions : rendre son cloud “carbon-aware”.\r\n\r\n# Structure du talk\r\n\r\nDans cette présentation, je vais :\r\n\r\n- C'est quoi le problème ?\r\n- On peut mesurer les émissions du cloud ?\r\n- Comment on peut réduire l'empreinte de mon cloud?\r\n- Qu'est ce que le concept de \"carbon-awareness\"?"
}, {
  "id" : "667155",
  "name" : "🗄️Et si vous mettiez à disposition vos jobs de CI/CD sur une étagère ?",
  "event_start" : "2024-06-28T16:00:00",
  "event_end" : "2024-06-28T16:55:00",
  "event_type" : "DevOps",
  "format" : "Conférence",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Jean-Philippe Baconnais, Jules Agostini",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "La CI/CD fait partie de notre quotidien. Que l’on soit développeur·euse, ou bien Ops, nous avons forcément passé du temps à créer ou modifier des scripts de CI/CD.\r\n\r\nUn nouveau script de CI/CD ? Pas de soucis, nous savons où trouver un exemple et utilisons la force de frappe d’un bon vieux “copier / coller” pour avoir un pipeline de CI tout beau tout propre sur notre projet.\r\n\r\nPourquoi ne pas migrer vos stages et vos jobs dans des “catalogues de CI/CD” pour avoir l’ensemble de vos scripts à disposition sur une étagère ?\r\n\r\nAprès vous avoir présenté cette approche, je vous détaillerai la manière de la mettre rapidement en place dans GitLab. Nous verrons ses avantages et inconvénients et terminerons par parler de la solution R2DevOps qui a depuis plusieurs années créé leur solution en se basant sur cette notion de catalogue."
}, {
  "id" : "664116",
  "name" : "Android ♥ Kotlin, une folle histoire d'amour",
  "event_start" : "2024-06-28T09:35:00",
  "event_end" : "2024-06-28T10:00:00",
  "event_type" : "Développement",
  "format" : "Tool in action",
  "venue" : "Amphi D",
  "venue_id" : "4",
  "speakers" : "Caroline Mouden",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Cinq ans après l'annonce Kotlin First au Google I/O, Kotlin est désormais le langage favori des développeurs Android. Et pour cause, ce petit nouveau a tout pour plaire.\r\n\r\nNéammoins une question se pose: pourquoi donc Kotlin est si peu connu alors qu'il est devenu un indispensable dans le monde mobile ?\r\n\r\nPour tenter de répondre à cette question, suivez moi dans le temps pour découvrir l'histoire d'amour entre Android et Kotlin."
}, {
  "id" : "671274",
  "name" : "Ce que j'aurais aimé savoir avant que ma JVM n'explose en prod",
  "event_start" : "2024-06-28T10:30:00",
  "event_end" : "2024-06-28T11:25:00",
  "event_type" : "Développement",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Hugo Metivier",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Une JVM, c'est pratique, on ne gère que peu l'allocation de la mémoire, et encore moins sa désallocation. La JVM le fait pour nous. Sa configuration par défaut est même suffisante pour une petite application.\r\nMais tous les problèmes ne sont pas gérés pour autant.\r\nDans ce talk, nous essayerons d'avoir une vue globale sur l'utilisation de la mémoire d'une application reposant sur une JVM, en parlant de heap bien sûr, mais pas que.\r\nNous verrons comment configurer sa heap, en prenant en compte l'application elle-même, et la machine ou le conteneur dans lequel elle tournera.\r\nNous évoquerons le garbage collector, son fonctionnement, le choix d'un garbage collector selon le but recherché, ainsi que leurs limites.\r\nCe qui nous amènera à aborder les dysfonctionnements de l'utilisation de la mémoire, les mesures à prendre pour les anticiper, et les moyens à disposition pour les analyser a posteriori.\r\nLe tout saupoudré d'un REX d'explosion de prod à cause de tout ça."
}, {
  "id" : "663726",
  "name" : "Construire son framework d’entreprise au dessus de Spring boot",
  "event_start" : "2024-06-28T11:35:00",
  "event_end" : "2024-06-28T12:30:00",
  "event_type" : "Développement",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Maxime Odye, Alexandre Baron",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Les projets se multiplient dans votre entreprise et vous avez du mal à uniformiser vos pratiques et choix techniques ? \r\n\r\nDans tous vos projets, vous ré-implémentez votre façon de gérer vos logs, votre observabilité, la configuration de vos plugins maven, votre authentification … avec à chaque fois des subtilités. L’ensemble n’est pas homogène et sa maintenabilité et son suivi de production se compliquent.\r\n\r\nC’est l’enfer mais vous n’êtes pas les seuls !\r\n\r\nSpring boot fut créé pour pallier cette problématique, permettant de faciliter la mise en place de Spring via la gestion centralisée des versions de dépendance, de l'auto-configuration et plus encore.\r\n\r\nMais est-ce vraiment suffisant ? Spoiler alert: non ! Il ne peut pas s’adapter ni uniformiser les spécificités techniques de chaque entreprise. \r\n\r\nVoyons comment nous pouvons construire un framework non intrusif et transparent “on-top of Spring Boot” pour votre entreprise. Deep dive dans les entrailles de Spring Boot et des builds maven au menu !"
}, {
  "id" : "667292",
  "name" : "Comment j'ai trouvé le sens de la vie grâce à WebAssembly",
  "event_start" : "2024-06-28T12:45:00",
  "event_end" : "2024-06-28T13:00:00",
  "event_type" : "Web",
  "format" : "Quicky",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Théo Gianella",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Qui d'entre nous n'a jamais traversé une période de doute existentiel..? \"Pourquoi est-ce que je me lève chaque matin ?\" \"Quel est le sens de mon passage sur Terre ?\" Voici le genre de questions qui peuvent nous assaillir. Quand elles se font trop pressantes, il faut prendre le taureau par les cornes et faire en sorte d'y répondre. C'est ce que j'ai fait, et de façon inattendue, j'ai trouvé le sens de la vie... grâce à WebAssembly !\r\n\r\nDans ce talk, je vais vous raconter ma découverte du monde du développement au travers d'un sujet fascinant, le Jeu de la vie, que j'ai tenté d'implémenter durant ma reconversion. Automates cellulaires, émergence et enjeux de performance, venez découvrir avec moi les défis relevés pendant cette implémentation !"
}, {
  "id" : "664925",
  "name" : "Les brouteurs d'IA",
  "event_start" : "2024-06-28T13:05:00",
  "event_end" : "2024-06-28T13:20:00",
  "event_type" : "Autre...",
  "format" : "Quicky",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Nicolas Ledez",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Alors, je dois vous avouer, j’ai une grande passion. C’est me faire arnaquer.\r\nComme cela, je comprends mieux le pourquoi et le comment de certaines duperies.\r\n\r\nEt il y a quelques années, j’ai été contacté par de “charmantes jeunes femmes de ma région”.\r\nEt comme j’avais un peu de temps à perdre, j’ai cherché l’amour.\r\n\r\nBien entendu, je l’ai trouvé. 3 fois !\r\n\r\nTout cela m’a permis de bien comprendre certaines demandes, et les différentes mécaniques mises en place dans ces escroqueries. D’une certaine manière, je fais du reverse engineering d’arnaques.\r\n\r\nEt l’IA dans tout ça ? Il faudra venir me voir pour savoir :)\r\n\r\nEt pourquoi je parle de tout ça dans une conférence technique ? Déjà parce que c’est marrant. Mais aussi parce que cela permet d’illustrer pas mal de choses au niveau de la sécurité."
}, {
  "id" : "662651",
  "name" : "Elasticsearch Query Language: ES|QL",
  "event_start" : "2024-06-28T13:30:00",
  "event_end" : "2024-06-28T14:25:00",
  "event_type" : "Développement",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "David Pilato",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Elasticsearch et Kibana apportent un tout nouveau langage, ES|QL, avec une nouvelle API (`_query`) et une syntaxe simplifiée. Cela vous permet d'affiner vos résultats, étape par étape et ajouter de nouvelles fonctionnalités comme par exemple l'enrichissement de données et la transformation à la volée, directement dans votre requête. Et vous pouvez l'utiliser sur toute la plateforme Elastic — depuis les API Elasticsearch jusqu'aux fonctions de \"Discover\" et d'\"Alerting\" de Kibana. Mais le changement principal n'est pas celui que vous verrez : les ingénieurs ont développé un tout nouveau moteur de calcul, construit avec la performance comme guide. \r\nVenez découvrir un aperçu de ce nouveau moteur avec découverte de la syntaxe et du fonctionnement interne."
}, {
  "id" : "671057",
  "name" : "Je malmène ta prod en direct avec 15 failles de sécu",
  "event_start" : "2024-06-28T14:35:00",
  "event_end" : "2024-06-28T15:30:00",
  "event_type" : "Sécurité",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Gaëtan Eleouet",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "En tant que développeur, nous voyons souvent la sécurité comme un problème très éloigné, sans nous sentir concernés.\r\nNotre code est pourtant souvent à l'origine de nombreuses failles que nous ignorons.\r\nAllons les découvrir et les exploiter ensemble, en live sur une application existante.\r\n\r\nEn sortant de cette session, vous serez à même de répondre à ces questions :\r\n\r\n- Est-ce que la sécurité fait partie de mon domaine ?\r\n- Quel est le rôle du développeur dans la sécurité applicative ?\r\n- Quelles sont les bonnes pratiques à appliquer ?\r\n\r\n\r\nSoyez prêts, tous les coups seront permis !"
}, {
  "id" : "671246",
  "name" : "Orchestrez vos workflows métier avec Temporal.io",
  "event_start" : "2024-06-28T16:00:00",
  "event_end" : "2024-06-28T16:55:00",
  "event_type" : "DevOps",
  "format" : "Conférence",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "Gwendal Leclerc",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Créé en 2019 par deux personnes à l’origine de Cadence un autre orchestrateur de chez Uber, Temporal.io vous permet de gérer vos workflows métier de manière résiliente et scalable.\r\n\r\nAvec Temporal vous écrivez vos workflows et vos activités as-code dans l’un des langages supportés (Go, Java, PHP, Python, Typescript).\r\nLe reste : la communication ? les timeouts ? les retries ? c’est lui qui gère. \r\n\r\nJe vous propose dans ce talk une présentation de Temporal et de son fonctionnement ainsi qu’un retour d’expérience après l’avoir mis en production et fait tourner quasiment 1M d'opérations métier avec.\r\n"
}, {
  "id" : "659387",
  "name" : "Quel Vector d’attaque pour votre pipeline d’ingestion de logs ?",
  "event_start" : "2024-06-28T09:35:00",
  "event_end" : "2024-06-28T10:00:00",
  "event_type" : "DevOps",
  "format" : "Tool in action",
  "venue" : "Amphi E",
  "venue_id" : null,
  "speakers" : "François Dubrez",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : "Si l’Empire avait mis en place une vraie pipeline d’observabilité et de l’alerting, les rebelles n’auraient jamais réussi à faire sauter l’étoile noire !\r\n\r\nVector est un nouvel agent à ajouter à votre panoplie d'outils pour composer votre pipeline d'observabilité.\r\n\r\nDéveloppé en Rust 🦀, il se veut léger 🪶, performant ⚡ et simple à déployer dans différentes topologies.\r\n\r\nJe propose dans ce tool in action de présenter sa philosophie et de montrer via une démo fil rouge des vrais use-cases pour l'intégrer dans votre infra de monitoring actuelle."
}, {
  "id" : "a081cb2a-12a5-4711-8281-7a8c08ec6675",
  "name" : "Keynote de clôture",
  "event_start" : "2024-06-28T17:00:00",
  "event_end" : "2024-06-28T17:15:00",
  "event_type" : "Keynote",
  "format" : "Keynote",
  "venue" : "Amphi C",
  "venue_id" : "1",
  "speakers" : "",
  "video_url" : null,
  "files_url" : null,
  "slides_url" : null,
  "description" : null
} ]