[
    {
        "id": 327751,
        "name": "Advanced multi-platform dependency injection with Kotlin",
        "description": "Inversion of Control is one of the most common patterns used to improve software architecture. Entering into the Kotlin/Multiplatform world you should have the tools to cover this topic! Let's find out together how can we solve this problem, using existing tools with advanced cases.\r\n\r\nIn this talk, we will see how to use all the power of Kodein-DI, a popular dependency injection library that works everywhere Kotlin can compile to, in a mobile multi-platform project targeting Android, iOS and the mobile Web, by respectively using Kotlin/JVM, Kotlin/Native and Kotlin/JS.\r\n\r\nWe will start by using dependency injection mechanism to abstract and test behaviors of multi-platform business modules, as well as how to debug common dependency management errors. \r\n\r\nIn a second part, we will abstract & test behavior by embedding the DI library into popular behavior architecture patterns, such as MVP & MVVM or MVI, before seeing how it can behave on each targeted platform.\r\n\r\nFinally, we will enhance our common code using the advanced features of Kodein-DI such as set bindings, lazy access, context, and scopes.",
        "speakers": "Romain Boisselle",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi B",
        "event_start": "2022-06-30T13:30:00",
        "event_end": "2022-06-30T14:25:00",
        "event_type": "Architecture",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=YCA0ffh4Wj4",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 328261,
        "name": "Go Generics",
        "description": "Attendue depuis des années, initialement non souhaitée par les responsables du langage, la généricité a été introduite dans le langage Go en début d'année. La spécification étant intégralement compatible avec l'existant, on n'aura donc pas eu besoin d'attendre la version 2 !\r\n\r\nNous détaillerons les choix qui ont été faits et comment cela fonctionne avec des exemples concrets. Nous verrons ainsi les nouvelles possibilités offertes aux développeurs et développeuses qui utilisent ce langage au quotidien.\r\n",
        "speakers": "Benoît Masson",
        "language": null,
        "format": "Tool in action",
        "venue": "Amphi C",
        "event_start": "2022-07-01T17:00:00",
        "event_end": "2022-07-01T17:25:00",
        "event_type": "Développement",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=SqPdt-hVQxI",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 328423,
        "name": "JOOQ, joy of SQL",
        "description": "Et si l'on reprenait le contrôle de nos interactions avec notre base de données préférée? Car en vrai, nos BDD sont des monstres de puissance qui sont souvent sous exploitées 😓.\r\n\r\nNous verrons, avec JOOQ comment écrire des requêtes SQL simples ou évoluées, le tout facilement et de manière type-safe !\r\n\r\nVenez découvrir cette superbe librairie OpenSource, compatible Java, Kotlin & Scala, qui va vous permettre de vous simplifier la vie et d'améliorer votre code… et même de découvrir de super fonctionnalités SQL que vous n'imaginiez même pas.\r\n",
        "speakers": "Kevin Davin",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi C",
        "event_start": "2022-06-30T14:35:00",
        "event_end": "2022-06-30T15:30:00",
        "event_type": "Développement",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=9bkR9m86Zk8",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 328426,
        "name": "Kustomizons nos déploiements K8S avec style 🤩 !",
        "description": "Envie de simplifier vos fichiers YAML pour déployer vos applications Kubernetes dans plusieurs environnements? Tout en gardant cela TRÈS lisible ?\r\n\r\nFaîtes vous du bien, venez à cette présentation, vous aimerez à nouveau le YAML (…peut être 😅).",
        "speakers": "Kevin Davin",
        "language": null,
        "format": "Tool in action",
        "venue": "Amphi C",
        "event_start": "2022-06-30T17:05:00",
        "event_end": "2022-06-30T17:30:00",
        "event_type": "Développement",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=dLEcc7fe46E",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 328990,
        "name": "WebPerf : Navigateur, metrics et outils",
        "description": "La webPerf, c'est bien, mais en connaissant toutes les subtilités de la création de notre page c'est mieux \\o/. Pendant 45 minutes, nous voyagerons à travers toutes les étapes de la création d'un site pour mieux comprendre les impacts des ressources de nos pages à travers le réseau, sur le navigateur et les périphériques de nos utilisateurs et utilisatrices. Nous apprendrons la significations des métriques de la performance web, et découvrirons certains outils nous permettant de devenir autonome sur le sujet.",
        "speakers": "Romuald Priol",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi A",
        "event_start": "2022-07-01T10:30:00",
        "event_end": "2022-07-01T11:25:00",
        "event_type": "Web",
        "venue_id": "1",
        "video_url": null,
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 329788,
        "name": "Spark dans le cloud. kubernetes + object storage = 💥",
        "description": "La nouvelle tendance c'est d'utiliser spark sur kubernetes et un object storage pour sa donnée. Pas cher, ultra sur, décentralisé... Les avantages sont multiples.\r\nCependant il n'y a pas que des bons points. Spark fonctionne de manière très particulière pour écrire de la donnée. Si vous avez migré des jobs Spark d'un cluster hadoop avec HDFS à une infrastructure cloud avec S3 en stockage, vous aurez peut-être remarqué une dégradation des performances. Est-ce qu'un cluster hadoop on prem sur un bare metal est à ce point plus performant que du service managé dans le cloud ? Mauvaise question. Le problème vient de S3. Dans ce slot nous verrons ensemble comment profiter au mieux de S3 avec Spark en détaillant le fonctionnement de l'écriture de donnée de Spark.\r\nEn plus de ce problème de stockage d'autres problèmes liés à kubernetes se posent. Quelles images de container utiliser ? Comment avoir accès à la spark-ui ? Comment lancer mon job sans spark-submit ?\r\n",
        "speakers": "Franck Cussac, romain sagean",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi B",
        "event_start": "2022-07-01T13:30:00",
        "event_end": "2022-07-01T14:25:00",
        "event_type": "Data",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=ddH9vUrD6G4",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 330355,
        "name": "À la découverte d'Accelerate",
        "description": "Découvrons ensemble Accelerate : créer et mettre à l'échelle une organisation technologique hautement performante.\r\n\r\nEn harmonisant nos pratiques Lean, Agile, DevOps et en adaptant les postures de nos managers, Accelerate prédit de réduire les cycles de livraison des organisations numériques, d'améliorer la stabilité de leur livraison et surtout d'améliorer le contexte de travail (bienveillance, communication et d'amener plus de sureté psychologique).\r\n\r\nEt si vous pensiez avoir affaire à une présentation d'un nième framework agile soit disant à la mode, détrompez vous. Ici tout se base sur les résultats d'études des comportements des organisations d'entreprises partout dans le monde et l'atelier vous permettra de découvrir ces patterns établis au travers d'un workshop pédagogique, ludique et participatif !",
        "speakers": "Antoine Cailly, kevin danezis",
        "language": null,
        "format": "Université",
        "venue": "Amphi C",
        "event_start": "2022-06-29T13:30:00",
        "event_end": "2022-06-29T15:30:00",
        "event_type": "Méthodologie",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=MLX-BcYUBnw",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 330382,
        "name": "Pourquoi envisager Rust",
        "description": "Rust est devenu un concurrent sérieux parmi les langages de programmation \"systèmes\", avec la promesse d'éliminer les problèmes liés à la gestion mémoire, et de nombreux géants de la technologie l'ont adoptés pour des projets sérieux. (Amazon/Microsoft/Huawei...).\r\n\r\nEn réponse à cela, de plus en plus d'entreprises se demandent maintenant si elles devraient elles aussi ajouter Rust à leur pile technologique.\r\n\r\nLe but de cette présentation est de donner les éléments sur ce qu'est Rust et pourquoi l'envisager.\r\n\r\nNous allons voir comment le langage se compare à de nombreuses alternatives actuelles et ce qu'il a à offrir, mais aussi quels sont ses principaux inconvénients et ses perspectives de viabilité à long terme.",
        "speakers": "Alexis Delhelle",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi B",
        "event_start": "2022-07-01T11:35:00",
        "event_end": "2022-07-01T12:30:00",
        "event_type": "Développement",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=I2iYNZm_pqg",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 330397,
        "name": "OAuth 2.1 expliqué simplement (même si tu n'es pas dev) !",
        "description": "Il est très difficile aujourd'hui de déployer une application sur le web sans se frotter à OAuth2. Conçu pour mieux protéger les utilisateurs et utilisatrices, ce standard de délégation d'autorisation s'est totalement imposé dans l'industrie.\r\n\r\nCependant, n'avez-vous pas pleuré en essayant de comprendre les concepts de OAuth2 ? On ne va pas se mentir, entre les différents rôles et la multitude de flows qui le constituent, il y a vraiment de quoi se perdre et sa complexité en décourage plus d'un ! Et pourtant, on ne peut pas s'en passer, donc on y va et généralement c'est douloureux…\r\n\r\nMais ne vous inquiétez pas, que vous ayez un profil tech ou non, ce talk va vous permettre d'enfin comprendre les méandres de OAuth simplement, dont la nouvelle version 2.1, en s'appuyant sur des analogies de la vie courante !",
        "speakers": "Julien Topçu",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-06-29T11:05:00",
        "event_end": "2022-06-29T12:00:00",
        "event_type": "Autre...",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=QrGu7ITlSog",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 330473,
        "name": "Les dessous de l'IA Responsable",
        "description": "Discrimination In, Discrimination Out ! \r\nOn est tous biaisés... et si mes données reflètent nos comportements stéréotypés, alors mon super modèle de ML ne fera que les perpétuer, voir les amplifier !\r\nEt ce n'est qu'un aperçu de ce qu'est l'IA Responsable, que je tâcherai de démystifier dans ce talk.",
        "speakers": "Yoann Benoit",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi C",
        "event_start": "2022-06-30T16:00:00",
        "event_end": "2022-06-30T16:55:00",
        "event_type": "Data",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=yn34R0RYXXo",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 330760,
        "name": "Architecture microservice et cohérence des données : mais on fait comment pour de vrai ?",
        "description": "Les architectures microservices ont le vent en poupe. Elles facilitent les bonnes pratiques DevOps et le travail en parallèle d'équipes pluridisciplinaires autonomes. Evoluer du monolithe vers les microservices n'est pas un long fleuve tranquille… Les challenges ne manquent pas. L'un d'entre eux, et non des moindres, est la cohérence des données. Chaque service possède sa propre base de données. Quand une transaction métier invoque plusieurs services, on ne peut donc plus compter sur les bonnes vieilles transactions ACID. Quant aux transactions distribuées 2PC, oubliez les, elles sont jetées au pilori des mauvaises pratiques depuis bien longtemps ! Une fois ce constat établi, on fait quoi concrètement ? Comment peut-on répondre à cette problématique ? Dans cette présentation, nous verrons comment procéder avec deux approches : les SAGA et les LRA (Long Running Action). Un exemple concret basé sur MicroProfile et le framework Eventuate Tram vous permettra de les appréhender et de choisir la bonne option pour votre prochain projet microservices.",
        "speakers": "Jean-François James",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi A",
        "event_start": "2022-06-30T14:35:00",
        "event_end": "2022-06-30T15:30:00",
        "event_type": "Architecture",
        "venue_id": "1",
        "video_url": "https://www.youtube.com/watch?v=Q-s5Uefg9hI",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 330765,
        "name": "Les opérateurs Kubernetes à la portée de n'importe quel développeur.",
        "description": "Développer un opérateur peu, de prime abord, être plutôt impressionnant.\r\nHeureusement différents Frameworks ont vu le jour, dont le plus connu, Operator SDK, permettant de développer en Go, Helm ou Ansible un opérateur.\r\n\r\nAvant de se lancer dans la grande aventure de développer un opérateur nous verrons ensemble ce qui se cache derrière la notion des opérateurs au sein de Kubernetes : à quoi ils servent et comment ils évoluent dans l'éco-système Kubernetes. \r\n\r\nUne fois ces bases acquises, nous développerons ensemble un opérateur permettant la gestion d'un serveur Nginx.\r\n\r\nOui mais voilà quel Framework / langage choisir ? Go ? Helm ? Et pourquoi pas Java ?\r\n\r\nJ'ai envie de vous proposer les trois !\r\nNous développerons ensemble le même opérateur de trois façons différentes : avec Helm, Golang et même en Java avec Quarkus !\r\n\r\nA la fin de ce talk, vous aurez les différents éléments pour savoir si vous avez besoin de développer un opérateur, comment le développer, et choisir quel langage utiliser selon vos connaissances !",
        "speakers": "Stéphane Philippart",
        "language": null,
        "format": "Université",
        "venue": "Amphi B",
        "event_start": "2022-06-29T16:00:00",
        "event_end": "2022-06-29T18:00:00",
        "event_type": "Développement",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=-I91DSU8glA",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 330805,
        "name": "Elections 2022 - Jour(s) J :  \"Comment ça marche\"",
        "description": "Retour d'expérience sur le projet \"Elections 2022\" chez Ouest-France\r\n\r\nLes objectifs : \r\n- Tenir la charge : 18 00 00 de pages vues, 200 00 sessions Web simultanées sur le site à 20h\r\n- Ingérer les data du gouvernement sur 3600 communes \r\n- Gérer le timing des journaux papiers : résultats / mise en page / impression / transport / distribution / vente (objectif : avoir le journal avec son café à 7h à Brest, Bayeux ou aux Herbiers)   \r\n- Gérer les 2 tours des présidentielles et des législatives\r\n\r\n\r\nNous verrons  : \r\n- L'organisation du gouvernement pour fournir les résultats \r\n- L'archi pour répondre aux objectifs\r\n- les retours d'expérience, ce qui a fonctionné, ce qui n'a pas fonctionné \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
        "speakers": "Florian Girard",
        "language": null,
        "format": "Quicky",
        "venue": "Amphi C",
        "event_start": "2022-07-01T12:45:00",
        "event_end": "2022-07-01T13:00:00",
        "event_type": "Web",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=iPeRGzqlXLs",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 330824,
        "name": "Urbaniser un SI pour 10 ans",
        "description": "Un SI, ça doit évoluer en permanence, et si possible, pas en faisant une refonte totale tous les 3 ans. Alors je vous propose de parler de microservices, de Domain-driven design, de déclaratif, de réactif, de chorégraphie et de plein d'autres beaux concepts d'urbanisation qui servent justement à ça : rendre votre SI évolutif, pour que votre prochaine urbanisation dure au moins 10 ans.",
        "speakers": "Christophe Quintard",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi B",
        "event_start": "2022-06-30T11:35:00",
        "event_end": "2022-06-30T12:30:00",
        "event_type": "Architecture",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=i9eECmJTVEY",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 330879,
        "name": "De l'importance des Postmortem !",
        "description": "💥 Les incidents arrivent.\r\nC'est comme ça. Ils arrivent !\r\nPlus les systèmes grandissent et se complexifient, plus ils seront défaillants.\r\n\r\nFort de ce constat, on peut également considérer les incidents comme une opportunité d'apprendre et de progresser.\r\n\r\nPour ce faire, il est de bon usage de conduire un Postmortem pour tirer les leçons des incidents et devenir meilleurs. \r\n\r\nDans ce quicky, on va définir les Postmortem à travers un template à utiliser dans vos projets afin de faire grandir à la fois vos équipes et vos systèmes vers plus de résilience. 🚀\r\n",
        "speakers": "Julien Orain",
        "language": null,
        "format": "Quicky",
        "venue": "Amphi B",
        "event_start": "2022-06-30T13:05:00",
        "event_end": "2022-06-30T13:20:00",
        "event_type": "Méthodologie",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=5tfbuNyzQLU",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 331224,
        "name": "10 leçons sur les 10 plus grosses fuites de données",
        "description": "Sony, Über, Yahoo, Adult Friends finder, ces noms vous disent quelque chose? Vous utilisez peut-être les services de ces entreprises. Elles ont aussi un point commun, elles ont subi une fuite de leurs données utilisateurs. Comment les hackers s'y sont pris ? et surtout quelles leçons peut-on en tirer pour le développement de nos applications?",
        "speakers": "Adrien Pessu",
        "language": null,
        "format": "Quicky",
        "venue": "Amphi C",
        "event_start": "2022-06-30T13:05:00",
        "event_end": "2022-06-30T13:20:00",
        "event_type": "Autre...",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=bnp2tEV81Lo",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 331284,
        "name": "Java dans le cloud : Avec Spring ou Quarkus ?",
        "description": "Après presque 20 ans, la vieille guerre « Java EE vs Spring » semble enfin terminée ! Comparer une spécification avec un framework n'avait pas grand sens. Surtout quand on a réalisé que Spring s'appuie (en partie) sur Java (maintenant Jakarta) EE. \r\n\r\nEt voici un nouvel acteur arriver  : Quarkus … Un framework Subatomic et Supersonic !\r\n\r\nSpring vs Quarkus, framework vs framework : une nouvelle guerre en vue ? Une vraie ? Pas forcément ... Plutôt que de les opposer, nous vous proposons de les comparer concrètement sur des cas d'usage précis : API REST, persistance, programmation réactive, code natif, test …\r\n\r\nNous avons besoin de vous pour y voir plus clair : nous vous mettrons à contribution avec des sondages en live pendant nos démos.\r\n\r\nA l'issue de cette présentation, nous aurons une vue complète et objective de ce qui les rapproche et ce qui les différencie. Nous saurons également comment transposer cette réflexion et faire le bon choix pour nos prochains projets.\r\n",
        "speakers": "Alexandre Touret, Jean-François James",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi B",
        "event_start": "2022-07-01T16:00:00",
        "event_end": "2022-07-01T16:55:00",
        "event_type": "Développement",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=9gvykLmck3o",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 331392,
        "name": "GitOps, Continuous Delivery et environnements : Comment éviter l'enfer ?!",
        "description": "Lorsque l'on met en place le continuous delivery sur les projets d'application, inévitablement se pose la question de la gestion des environnements sur lesquels nous devons déployer notre application. Pour les petites applications, le nombre d'environnements va être limité, mais lorsque l'on souhaite mettre en place du Blue-Green Deployment ou du Canary Release, ce nombre va subitement grimper.\r\n\r\nA cela on rajoute : une architecture distribuée, le paramétrage de l'infrastructure et des composants pour chaque environnement, et l'on arrive rapidement à devoir gérer des centaines de paramètres sur des dizaines d'environnements.\r\n\r\nMais, que se passe-t-il si je dois faire un rollback de l'ensemble ou d'une partie de mon application sur un environnement ? Est-ce que je peux le faire rapidement et sans planter l'environnement ? Est-ce que les exploitants sont capables d'intervenir efficacement sur l'application en production à 3h00 du matin ?\r\n\r\nJe vous propose durant ce talk de comprendre comment on arrive rapidement sur ces problématiques. Puis, je vous présenterai un ensemble de bonnes pratiques et d'astuces pour éviter l'enfer !",
        "speakers": "Philippe Morisseau",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi C",
        "event_start": "2022-07-01T13:30:00",
        "event_end": "2022-07-01T14:25:00",
        "event_type": "Méthodologie",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=dVFyacA1-iI",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 331813,
        "name": "DevSecOps : de la sécurité dans mon DevOps",
        "description": "De plus en plus d'équipes mettent en place les principes du DevOps avec comme objectif de déployer plus fréquemment en production. Ces principes amènent les Dev et Ops à travailler ensemble avec les mêmes outils et méthodes.\r\n\r\nIl est maintenant standard d'avoir les builds, tests, et déploiements automatisés, mais qu'en est-il de la sécurité?\r\n\r\nLa “sécurité des applications” est au mieux quelque chose qui arrive trop tard, ou le plus souvent inexistante. Les raisons mises en avant sont la complexité, l'impact sur la productivité qui ralentissent les déploiements; et on se dit aussi que les attaques n'arrivent qu'aux autres.\r\n\r\nIl est temps d'appliquer les principes du DevOps à la sécurité, c'est ce que promet le DevSecOps!\r\n\r\nAvec le DevOps, et sans être un expert système, vous arrivez à coder votre infrastructure (Terraform, YAML, Kubernetes, Serverless, …). Avec le DevSecOps, vous allez déployer vos applications tout en vous assurant de la sécurité de votre code.\r\n\r\nDurant cette présentation, qui s'appuie sur des retours d'expérience et de nombreuses démonstrations, vous verrez qu'il est possible d'intégrer la sécurité au cycle du développement sans impacter la productivité.",
        "speakers": "Adrien Pessu, Tug Grall",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi C",
        "event_start": "2022-07-01T10:30:00",
        "event_end": "2022-07-01T11:25:00",
        "event_type": "Développement",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=wzXuSLP_6r0",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 332047,
        "name": "Développer une app Java sans JDK sur son poste ? Prenez votre IDE Cloud GitPod et le tour est joué !",
        "description": "Quand on arrive sur des projets, la configuration de votre poste est une étape obligatoire : avoir la bonne version du JDK, de Maven ou de librairies. Le tout avec quelques Mo / Go qui s'accumulent sur votre disque dur.\r\n\r\nAvec l'arrivée des IDE Cloud tels que GitPod, la configuration nécessaire sur un projet est mutualisée sur le cloud et cette étape qui pouvait devenir une réelle galère n'est plus qu'un lointain souvenir !\r\n\r\nAprès vous avoir présenté en quelques mots GitPod, je vous ferai une démonstration de ce qui est possible pour un dev Java.\r\n",
        "speakers": "Jean-Philippe Baconnais",
        "language": null,
        "format": "Quicky",
        "venue": "Amphi D",
        "event_start": "2022-07-01T13:05:00",
        "event_end": "2022-07-01T13:20:00",
        "event_type": "Développement",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=yrMNOWZkc1A",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 332371,
        "name": "10 ans après : le remplaçant de RabbitMQ",
        "description": "Dix ans après ma conférence sur les concepts de RabbitMQ lors du Breizhcamp édition 2012 (!), par quoi pourrait-on enfin remplacer RabbitMQ ? Par RabbitMQ v3.9 évidemment !\r\nPrésentation de quelques features inattendues qui le place toujours dans le haut du panier (streams, deduplication publishers).",
        "speakers": "Raphaël Delaporte",
        "language": null,
        "format": "Tool in action",
        "venue": "Amphi A",
        "event_start": "2022-06-30T17:05:00",
        "event_end": "2022-06-30T17:30:00",
        "event_type": "Data",
        "venue_id": "1",
        "video_url": "https://www.youtube.com/watch?v=WURlIcrO2Rc",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 332416,
        "name": "Fresque du numérique",
        "description": "Le collectif numérique responsable propose des fresques du numérique en fil rouge sur la durée de l'événement.\r\n\r\nCette activité collaborative et ludique permet aux participants de se sensibiliser aux aspects environnementaux du numérique.",
        "speakers": "Héloïse Dano, Luc Sorel-Giffo, Serge Hardy, Sylvain Révéreault",
        "language": null,
        "format": "Université",
        "venue": "Amphi A",
        "event_start": "2022-06-29T10:00:00",
        "event_end": "2022-06-29T13:00:00",
        "event_type": "Green",
        "venue_id": "1",
        "video_url": null,
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 332421,
        "name": "Devenir svelte avec Svelte",
        "description": "Svelte a une approche différente des autres frameworks populaires comme Angular, React ou Vue. Il transforme votre code à la compilation pour générer un code javascript vanilla au lieu d'embarquer le framework au runtime.\r\n\r\nCela offre plusieurs avantages :\r\n- Meilleures performances\r\n- Taille finale réduite\r\n- Syntaxe simplifiée\r\n- Analyse du code à la compilation\r\n\r\nDurant ce Codelabs vous allez apprendre à aimer Svelte et vous découvrirez les différentes possibilités du compilateur en créant une application avec le framework SvelteKit.",
        "speakers": "Anthony Le Goas, Patrice De Saint Steban",
        "language": null,
        "format": "Université",
        "venue": "Amphi A",
        "event_start": "2022-06-29T16:00:00",
        "event_end": "2022-06-29T18:00:00",
        "event_type": "Web",
        "venue_id": "1",
        "video_url": "https://www.youtube.com/watch?v=PzLE75th8JU",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 332536,
        "name": "Identité numérique décentralisée et droit d'être soi : protéger son intégrité sur Internet",
        "description": "De nos jours, pour s'inscrire sur un site internet, il est nécessaire de fournir une adresse mail et un certain nombre d'informations personnelles. Imaginez…, quelques années plus tard, on découvre qu'il y a une fuite de données et ces informations personnelles se retrouvent sur internet.\r\n\r\nPour faire face à ce genre de problématiques, l'identité décentralisée est un concept émergent qui redonne le contrôle de l'identité aux consommateurs. Elle propose une réinvention sans précédent de la manière de concevoir, de générer et d'exploiter l'identité numérique des personnes.\r\n\r\nCe talk a pour but de présenter les récentes évolutions mises en place par cette nouvelle façon de procéder, de comprendre ces nouvelles formulations : DID decentralized identity et SSI Self-Sovereign Identity.\r\n\r\nNous aborderons également comment des technologies comme la blockchain peuvent jouer un rôle dans cet univers d'identité numérique décentralisée.\r\n\r\nD'ici quelques temps, une identité libre, autonome et fondée sur le droit d'être soi, pourrait bien dépasser la réalité technologique et imparfaite de l'identité numérique d'aujourd'hui.",
        "speakers": "Adrien Wattez, Antoine Cailly",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-07-01T16:00:00",
        "event_end": "2022-07-01T16:55:00",
        "event_type": "Autre...",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=K8KcOjfauX4",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 332608,
        "name": "L'eco-conception, c'est bien, mais si on parlait un peu du backend ?",
        "description": "A l'heure actuelle, l'éco-conception des applications web est un domaine qui monte. Vous pouvez faire des tests de performance de vos pages web, savoir combien d'énergie les utilisateurs auront besoin pour utiliser votre interface, etc. Mais qu'en est-il du serveur ? Quelles sont les bonnes pratiques ? Faut il pour autant écrire mes scripts de déploiement en C ? Nous allons voir quelles métriques sont bonnes à regarder, quelles sont les personnes à convaincre pour faire de l'éco-conception côté serveur et avec quels arguments.\r\n\r\nQuelle partie a le plus d'impact sur la consommation énergétique d'un back end : le langage, les frameworks, les protocoles du communication, la base de donnée, hibernate, le niveau de formation en SQL du développeur? Vous en saurez plus lors de cette présentation.",
        "speakers": "Jérémie Drouet, Youen Chéné",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi C",
        "event_start": "2022-07-01T16:00:00",
        "event_end": "2022-07-01T16:55:00",
        "event_type": "Green",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=gE6HUsmh554",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 332609,
        "name": "I � Unicode",
        "description": "L'insoupçonnable complexité du texte. Comment votre langage de programmation prend-il en charge le média humain qu'est l'écriture ? Comment votre OS parvient-il à afficher toutes ces langues et alphabets différents ? Pourquoi parler de la \"longueur d'une chaîne de caractères\" est aussi pertinent qu'évoquer sa hauteur ? Avec Unicode, je vous propose un fascinant voyage à travers la modélisation du texte et sa représentation à l'écran, où tout est plus compliqué qu'il n'y paraît.",
        "speakers": "David Blanchet",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi A",
        "event_start": "2022-06-30T13:30:00",
        "event_end": "2022-06-30T14:25:00",
        "event_type": "Développement",
        "venue_id": "1",
        "video_url": "https://www.youtube.com/watch?v=UnI_AwK0kuQ",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 332682,
        "name": "Comment gérer ses environnements de travail avec Nix",
        "description": "Lorsqu'on arrive sur un projet, la première étape est d'installer les outils communs aux membres de l'équipe. Comment connaître les versions de Go, Python ou Terraform à utiliser ? Bien souvent, la réponse se trouve dans une page cachée sur un Wiki obscur. \r\n\r\nSi cette situation vous parle, alors ces problèmes aussi :\r\nDans le cas d'une montée de version vous entendez : \"Ça ne fonctionne plus chez moi !” “Oui, on utilise la nouvelle version, c'est sur le Wiki.”\r\nVous récupérez la dernière version du code et lorsque vous lancez un script vous avez une erreur “Command not found”. “Oui, on a ajouté une CLI, c'est sur le Wiki”\r\n\r\nVous pensez pouvoir faire mieux ? Venez suivre ce hands-on autour du gestionnaire de paquets Nix.\r\n\r\nÀ la fin de cette session pratique, vous saurez comment utiliser Nix pour gérer efficacement votre poste de travail mais aussi les projets sur lesquels vous intervenez. Et ça fonctionne même pour vos amis !\r\n\r\nPour participer, vous aurez uniquement besoin d'un laptop avec un client SSH ainsi que d'un compte Github.",
        "speakers": "Romain Davaze, Stéphane Teyssier",
        "language": null,
        "format": "Université",
        "venue": "Amphi C",
        "event_start": "2022-06-29T10:00:00",
        "event_end": "2022-06-29T12:00:00",
        "event_type": "Autre...",
        "venue_id": "3",
        "video_url": null,
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 332971,
        "name": "Mob programming, la véritable approche du développement en équipe",
        "description": "Shérif, le manager, est en colère. Il vient de surprendre toute l'équipe de développement autour d'une même machine. Rendez-vous compte ! Après des comparaisons douteuses avec la DDE, il les a bien sermonnés et leur a ordonné de retourner à leur poste de travail immédiatement, un peu de sérieux ! Avec Shérif, la bamboche, c'est terminé !\r\n\r\nMalheureusement, des Shérif, il en existe encore beaucoup dans les open-spaces de nos DSI. Partager un ordinateur entre plusieurs développeurs, mais pourquoi donc ?\r\n\r\nLe MOB programming est une pratique s'appuyant sur le Lean et sur Extreme Programming qui consiste à réaliser une tâche, qu'elle soit technique ou non, à plusieurs. Les groomings, planifications et autres réunions de conception, ne serait-ce pas déjà des MOBs ?\r\n\r\nDe mythe à réalité, nous vous proposons de faire un retour d'expérience du MOB programming dans une équipe produit chez Ouest-France. Nous vous offrirons deux points de vue, celui du lead, présent depuis le début du projet (5 ans) et celui d'un développeur qui a rejoint l'équipe début 2021.\r\n",
        "speakers": "Mathieu Pousse, Maxime Odye",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi C",
        "event_start": "2022-06-30T11:35:00",
        "event_end": "2022-06-30T12:30:00",
        "event_type": "Méthodologie",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=hktnp8mcMh0",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 332989,
        "name": "Frago, outil pour suivre l'accessibilité… mais pas que.",
        "description": "96% des grands sites mondiaux présentent au moins une erreur d'accessibilité sur leur page d'accueil. Les organismes sont contraints de baisser leur émission carbone pour éviter les hausses de températures…\r\n\r\nComment répondre à la contrainte légale de l'accessibilité (RGAA) ? Comment améliorer la qualité de ses interfaces ? Comment réaliser simplement un bilan carbone ?\r\n\r\nFrago est un outil de publication de synthèses, déclarations, tableaux de bord… réalisé à partir du simple archivage de fichiers d'audit.\r\nhttps://github.com/DISIC/frago/\r\n\r\nLaisser moi vous conter pourquoi un défaut d'accessibilité est l'indicateur d'une mauvaise prise en compte des besoins usagers et d‘un code de mauvaise qualité.\r\n\r\nJe vous dirai comment faire évoluer sereinement votre organisme vers une démarche plus vertueuse qui prend en compte le handicap et le respect de l'environnement.\r\n\r\n\r\n",
        "speakers": "Bertrand Keller",
        "language": null,
        "format": "Université",
        "venue": "Amphi A",
        "event_start": "2022-06-29T13:30:00",
        "event_end": "2022-06-29T15:30:00",
        "event_type": "Méthodologie",
        "venue_id": "1",
        "video_url": "https://www.youtube.com/watch?v=rFhLkdKTXSI",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 333056,
        "name": "De Spring à NestJS : carnets de voyages de développeurs back",
        "description": "Récit exploratoire de deux développeurs Spring (Java & Kotlin) au sein de l'écosystème de développement NodeJS en 2022. Notre quête ? retrouver l'expérience, le tooling et la flexibilité que Spring nous offre... avec les avantages du monde JavaScript.\r\nAprès une visite guidée des librairies et outils aujourd'hui incontournables sur le continent NodeJS, nous terminerons notre voyage avec NestJS, un framework \"cocooning\" qui n'est pas sans nous rappeler notre lieu de départ initial...",
        "speakers": "Mathieu Durand, Mathis Ouarnier",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi A",
        "event_start": "2022-06-30T16:00:00",
        "event_end": "2022-06-30T16:55:00",
        "event_type": "Développement",
        "venue_id": "1",
        "video_url": "https://www.youtube.com/watch?v=D5m1oyvx12E",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 333058,
        "name": "REX LEAN: Créer un SaaS et être rentable après 6 mois",
        "description": "La fameuse histoire du SaaS que l'on commence avec une unique page sans rien derrière (\"fake it until you make it\") mais avec la particularité ici d'employer le Lean Software Management et l'eXtreme Programming (XP).\r\n\r\nUn SaaS que l'on construit au fil des échanges clients en suivant le Lean Software Management avec une (grosse) pincée d'XP.\r\n\r\n😇Comment prenons nous en compte quotidiennement le chaos de la réalité et l'illusion du contrôle pour vivre sans planification et roadmap.\r\n\r\n📞L'emploi du mob et du pair-programming dans une organisation en télétravail complet.\r\n\r\n🎚Pricing d'un SaaS = Lean\r\n\r\n🔁Garder une feedback loop inférieur à deux jours\r\n\r\n🔫Vivre la culture \"customer driven\" plutôt que d'en parler\r\n\r\n🥸Comment gérer les appels d'offre publique en lean\r\n\r\n🥶Certifications (e.g. ISO27001) et lean? Un amour impossible?\r\n\r\n💶 Comment supprimer le no-estimate / estimations / deadlines même quand nos prospects et clients sont des multi-nationales du NASDAQ et du CAC40.\r\n\r\n🥲Quels ont été nos succès et nos échecs ?",
        "speakers": "François-Guillaume Ribreau, Sébastien Brousse",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-07-01T10:30:00",
        "event_end": "2022-07-01T11:25:00",
        "event_type": "Méthodologie",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=5gZYU56q4No",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 333193,
        "name": "Appwrite est-il prêt à éteindre Firebase ? 🔥",
        "description": "Connue et reconnues par une grande majorité des développeurs, Firebase propose depuis plusieurs années déjà, de nombreux services permettant de mettre en place facilement toute une partie back-end pour des applications. Avec une telle réussite, ce n'est pas étonnant que l'on ai pu voir ces derniers temps plusieurs technologies émerger avec pour ambition de devenir de véritables alternatives. \r\n\r\nAprès plusieurs projets réalisés à l'aide Firebase en duo, nous avons décidé de pousser un peu plus loin l'expérience en essayant cette fois une toute nouvelle solution. Laissez nous vous présentez Appwrite, un ensemble de services qui cherche justement à nous faire oublier la solution de Google. N'étant pas forcément d'accord l'un avec l'autre à l'issue de nos essais, nous vous proposons de venir assister à un duel sans merci pour savoir si oui ou non, Appwrite est prêt à éteindre Firebase.\r\n\r\nAprès les avoirs comparés aux niveaux de leur facilité d'installation, des nombreuses fonctionnalités qu'ils nous proposent ou encore du prix que cela représente, il se peut même que l'on ait besoin de vos avis pour les départager une bonne fois pour toutes !\r\n\r\nCe talk a pour but de présenter de manière simple les deux outils ainsi que leurs fonctionnalités phares. Que vous soyez développeur ou non, expert ou novice, ou juste un peu curieux, nous vous attendons sur le ring 🥊",
        "speakers": "Lucas Audart, Mickael Alves",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-06-29T17:05:00",
        "event_end": "2022-06-29T18:00:00",
        "event_type": "Web",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=egMS-wyOb_Q",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 333208,
        "name": "Gladys Assistant : Automatiser sa maison, en self-hosted et open-source",
        "description": "Se réveiller avec une lumière progressive, les volets qui se lèvent, et un café prêt façon Jarvis dans Iron Man : on en a tous rêvé !\r\n\r\nGladys Assistant est un logiciel de domotique open-source créé en 2013 qui permet à tous de réaliser ce rêve, en proposant une solution respectueuse de la vie privée et qui tourne sur n'importe quelle machine Linux : un Raspberry Pi, un NAS Synology/Unraid, ou un serveur.\r\n\r\nPendant cette conférence, Pierre-Gilles Leymarie vous présentera les possibilités de cette solution, la stack technique derrière Gladys, et le futur de la maison connectée ! ",
        "speakers": "Pierre-Gilles Leymarie",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi C",
        "event_start": "2022-07-01T14:35:00",
        "event_end": "2022-07-01T15:30:00",
        "event_type": "IoT Embarqué",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=mw49_z2JiY0",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 333279,
        "name": "Toute la tech en deux coups de crayon !",
        "description": "Nous sommes de plus en plus nombreux à nous définir comme des penseurs visuels, mais parfois nous avons du mal à partager notre vision avec les autres. On invente des normes compliquées (comme UML par exemple) pour représenter visuellement des choses simples, mais les schémas ne sont pas lisibles si on ne maitrise pas un minimum la norme en question ... \r\nDans cette session nous allons vous montrer que vous aussi vous pouvez matérialiser vos idées sur du papier, sans se soucier d'aucune norme mais avec des petits schémas qui auront un vrai impact sur vos interlocuteurs et qui leur permettront de mieux comprendre vos idées. ",
        "speakers": "Annelore Bidaux-Nsounga, Hermann Nsounga, Marc Dugué",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-07-01T13:30:00",
        "event_end": "2022-07-01T14:25:00",
        "event_type": "Méthodologie",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=kcV5Zgl8pDI",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 333354,
        "name": "Cloud et protection des données",
        "description": "Les débats autour de l'usage du cloud AWS par Doctolib pour les campagnes de vaccination COVID-19 en France et les révélations sur les écoutes de la NSA au Danemark montrent que la protection des données dans le Cloud est toujours un sujet d'actualité majeur.\r\n\r\nMathieu Bonnet, Cloud Transformation Manager (Sopra Steria) & Matthieu Bouthors, Security Solutions Architect (AWS) vous partageront leurs points d'attention et bonnes pratiques sur ce sujet.",
        "speakers": "Mathieu Bonnet, Matthieu Bouthors",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-06-30T14:35:00",
        "event_end": "2022-06-30T15:30:00",
        "event_type": "Architecture",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=NHFg2pGJ6PQ",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 333467,
        "name": "Mettez du binaire dans vos APIs avec gRPC",
        "description": "Le format gRPC est un très bon candidat pour la mise en place d'API internes entre services ou micro services quel que soit le langage. Lors de cette présentation, je souhaite vous expliquer quelle est l'idée qui se cache derrière, quel en sont les intérêts et vous faire une petite démonstration de sa facilité de mise en œuvre entre un service Java et un service Python.",
        "speakers": "Jérôme Barotin",
        "language": null,
        "format": "Tool in action",
        "venue": "Amphi B",
        "event_start": "2022-06-30T17:35:00",
        "event_end": "2022-06-30T18:00:00",
        "event_type": "Architecture",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=zsgWJERs_ik",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 333801,
        "name": "L'expérience développeur avec Quarkus",
        "description": "Vous connaissez ou avez entendu parler de Quarkus, le nouveau framework Java développé par Red Hat, mais vous n'avez pas pu ou eu le temps de l'essayer ?\r\n\r\nOn va explorer dans cette conf ce que ce framework peut vous apporter au quotidien dans vos développements.\r\n\r\nNous verrons comment l'expérience développeur a été pensée dans Quarkus et ce que cela a changé dans nos pratiques.\r\n\r\nVenez découvrir une expérience développeur des années 2020 !",
        "speakers": "Ronan Barbot, Theo Le Visage",
        "language": null,
        "format": "Tool in action",
        "venue": "Amphi B",
        "event_start": "2022-07-01T17:00:00",
        "event_end": "2022-07-01T17:25:00",
        "event_type": "Développement",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=CrAiliubLgY",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 333802,
        "name": "Comment mesurer l'impact environnemental de son habitation avec Home Assistant",
        "description": "Au cours de ce quicky nous verrons comment j'ai configuré Home Assistant sur un raspberry pi, et à l'aide de quelques capteurs je mesure les réactions de ma maison.\r\nJe montrerais également comment récupérer ses infos de consommation de gaz et d'électricité, les agréger dans l'outil et voir sa consommation en équivalent carbone.\r\nEnfin je donnerai quelques outils dont je me suis servi pour mieux cerner les performances énergétiques de mon logement, et les pistes que je suis pour l'avenir.",
        "speakers": "Ronan Barbot",
        "language": null,
        "format": "Quicky",
        "venue": "Amphi C",
        "event_start": "2022-07-01T13:05:00",
        "event_end": "2022-07-01T13:20:00",
        "event_type": "Green",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=igwK2R5N5gc",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 333866,
        "name": "ArchUnit à la rescousse de mon projet ✨",
        "description": "Quel plaisir de démarrer un nouveau projet, on instaure les bonnes pratiques (listées dans un joli guide du développeurs) et elles sont bien suivies ! Le projet est heureux à ce moment là 🥰.\r\n… et puis quelques mois après : paff ! Les développeurs oublient l'existence du guide du développeur ; les sachants changent de projet ! L'application devient inmaintenable ! 🤢\r\n\r\nHeureusement, ArchUnit est là ! \r\nAvec ce framework vous testez à coup d'assertions l'utilisation des bonnes pratiques sur votre application comme vous testeriez du code métier.\r\nIntégré dans une intégration continue, le tour est joué ! \r\n\r\nDans ce Tools In Action, je vous présenterais comment intégrer ArchUnit à votre projet Java et comment écrire des tests « de bonnes pratiques » directement dans vos tests unitaires.\r\nTout le long de la présentation, j'en profiterais pour vous faire des retours d'expérience sur l'utilisation de ce framework.\r\n",
        "speakers": "Anthony Dasse",
        "language": null,
        "format": "Tool in action",
        "venue": "Amphi D",
        "event_start": "2022-06-30T17:35:00",
        "event_end": "2022-06-30T18:00:00",
        "event_type": "Architecture",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=eVpi0VT4tFQ",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 333962,
        "name": "A long trip in open source development",
        "description": "Après quatre ans de développement d'un framework open source, FoalTS, je vous partage les problématiques auxquelles j'ai été confronté.",
        "speakers": "Loïc Poullain",
        "language": null,
        "format": "Quicky",
        "venue": "Amphi B",
        "event_start": "2022-07-01T13:05:00",
        "event_end": "2022-07-01T13:20:00",
        "event_type": "Web",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=HNOKdQqrs9U",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 333964,
        "name": "Some misconceptions about authentication",
        "description": "Il est commun d'opposer sessions et cookies d'un côté et utilisation d'un JWT et d'un header de l'autre. Nous reviendrons sur cette idée ici.",
        "speakers": "Loïc Poullain",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-06-29T13:30:00",
        "event_end": "2022-06-29T14:25:00",
        "event_type": "Web",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=r4S56IPtJOM",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 333966,
        "name": "GitOps en 2022 avec Argo",
        "description": "Propulsé par la CNCF, la suite Argo permet de réaliser une plateforme 100% GitOps, en automatisant la totalité des actions, du build aux déploiements complexes.\r\nVenez découvrir cette suite complète, et les ruses qui permettent de la mettre en oeuvre.",
        "speakers": "Pablo Lopez",
        "language": null,
        "format": "Université",
        "venue": "Amphi B",
        "event_start": "2022-06-29T10:00:00",
        "event_end": "2022-06-29T12:00:00",
        "event_type": "Autre...",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=dL1f7QIiweU",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 333976,
        "name": "DooM",
        "description": "Parcours dans le code du célèbre jeu de 1993 : le jeu, comment il a été réalisé, les algorithmes employés, quelques aspects de son code, ... Saviez-vous que la base de code de ce célèbre codé il y a trente ans est remarquable ? Qu'il est même possible d'en retirer des leçons pour notre propre futur code ? ",
        "speakers": "xavier-frédéric moulet",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi A",
        "event_start": "2022-07-01T13:30:00",
        "event_end": "2022-07-01T14:25:00",
        "event_type": "Autre...",
        "venue_id": "1",
        "video_url": "https://www.youtube.com/watch?v=sNapL2anR3E",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 333977,
        "name": "A11y pour les nuls",
        "description": "Quand on entend accessibilité, on pense tout de suite à handicap de naissance ou lié à un accident (moteur, psychique, etc.). Sauf qu'on se projette rarement sur le fait que, comme tout le monde, un jour on deviendra vieux et décrépit. Dans ce futur là, quand on naviguera sur l'internet mondial, on sera content d'utiliser toutes les belles features que les développeurs front et designers auront mis à notre disposition pour nous permettre de surfer à l'aise malgré notre grand âge, notre presbytie, notre tremblote qui nous empêche de cliquer sur le petit bouton en haut à gauche. \r\nA11Y pour les nuls est donc une initiation aux bonnes pratiques / outils / astuces pour construire un web plus équitable.\r\n",
        "speakers": "Hélène Esnault",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-07-01T11:35:00",
        "event_end": "2022-07-01T12:30:00",
        "event_type": "Web",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=7kMi5BW73Hs",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 334011,
        "name": "Record du monde - Tour d'horizon et cas d'utilisation des records",
        "description": "Les Records sont l'une des nouveautés les plus attendues avec la sortie de Java 17. Des concepts similaires ont déjà été introduits dans d'autres langages: data class en Kotlin, @dataclass en Python, case class en Scala.\r\n\r\nPattern assez simple de premier abord, les records vont devenir un véritable indispensable de votre boite à outils de développeur.\r\n\r\nAprès un tour d'horizon des implémentations dans les différents langages, je vous propose de vous partager différents cas d'utilisations pour du pattern matching, du DDD et même pour des monoids 😱.",
        "speakers": "Benoit Prioux",
        "language": null,
        "format": "Quicky",
        "venue": "Amphi D",
        "event_start": "2022-07-01T12:45:00",
        "event_end": "2022-07-01T13:00:00",
        "event_type": "Architecture",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=zM-BIabiNio",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 334049,
        "name": "Conteneurs et stockage persistant avec Ceph",
        "description": "Les conteneurs sont pratiques, mais retrouver ses données à son redémarrage c'est parfois encore mieux!\r\n\r\nJe profiterai de cette heure pour présenter ceph, une solution de stockage distribuée et ceph-csi permettant d'intégrer ceph à un orchestrateur de conteneurs.\r\n\r\nPour finir je ferai un exemple concret avec Nomad, permettant notamment d'orchestrer des conteneurs et leur stockage.",
        "speakers": "Etienne Menguy",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-06-29T10:00:00",
        "event_end": "2022-06-29T10:55:00",
        "event_type": "Data",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=WVsv3Ca_Y70",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 334062,
        "name": "Build your 8-bit computer from scratch",
        "description": "\"Ce que je ne peux pas créer, je ne le comprends pas\" - Richard Feynman, un des plus grands physiciens, pédagogue remarquable et drôle.\r\nJe suis passionné par l' informatique bien sûr, mais surtout par la création en général et l' apprentissage en particulier.\r\nJe souhaite vous présenter, pour la première fois, mon retour d' expérience de la création d' un ordinateur 8 - bit à partir de composants électroniques simples et le tout sur breadboard!\r\nDonc relativement facilement reproductible chez vous, ce qui est par ailleurs mon but initial.\r\nAncré dans un storytelling bien à moi, je ferai une démonstration en live de l' ordinateur et quels enseignements j' en ai tirés.",
        "speakers": "Olivier Huber",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-06-29T14:35:00",
        "event_end": "2022-06-29T15:30:00",
        "event_type": "Architecture",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=NKhoYy27aX8",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 334171,
        "name": "FFP2 : \"FastApi For Python Programmers\"",
        "description": "Depuis deux ans, un nouveau framework fait souffler un vent de fraîcheur sur l'implémentation d'api en python. \r\nEn s'appuyant sur les standards récents du langage (typehints, asyncio, ...) et quelques librairies solides (starlett, pydantic), Fastapi permet de développer une api en moins de temps qu'il n'en faut à Jeff pour s'acheter une villa à LosAngeles, tout en intégrant une véritable batterie de fonctionnalités : génération automatique de doc, vérification de contraintes de données en entrée et sortie, support de l'asynchronisme, client de test intégré, et même un mécanisme d'injection de dépendances (en python, il fallait oser).\r\n\r\nVous continuez à utiliser Flask envers et contre tous ? Vous pensez que Django est le seul framework un peu solide du marché ? Vous ne comprenez pas pourquoi les gens continuent à faire des api en python ? Ce live coding est pour vous (on ratisse large c'est vrai) : en 20', nous developperons une api from scratch qui illustre tout ce qui fait de FastApi un framework incontournable !",
        "speakers": "Fabrice Depaulis",
        "language": null,
        "format": "Tool in action",
        "venue": "Amphi A",
        "event_start": "2022-07-01T17:00:00",
        "event_end": "2022-07-01T17:25:00",
        "event_type": "Développement",
        "venue_id": "1",
        "video_url": null,
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 334185,
        "name": "Les femmes dans le numérique : ce n'est PAS qu'un pourcentage",
        "description": "Aujourd'hui, moins d'un salarié sur 5 dans la tech est une femme. \r\n\r\nEt cela fait plus d'une dizaine d'années que ce chiffre progresse, malheureusement trop doucement. \r\n\r\nLe secteur de la tech peine à avoir une mixité homme/femme. Outre le fait de sensibiliser les femmes sur ce métier d'avenir innovant et créatif, et pratiquer la discrimination positive dans le recrutement, comment faire pour garder ces dernières ? \r\n\r\nParce que, même si ce petit pourcentage grimpe d'année en année dans les entreprises, il faut encore améliorer la prise de conscience et le soutien des femmes dans la technologie et faire de la progression des femmes une des priorités. \r\n\r\nBriser le plafond de verre et augmenter les salaires ne sera pas suffisant, et si on vous en disait plus ? \r\n",
        "speakers": "Inès Branchu, Julie Bourhis, Margaux Imberty-Vialard, Mélody Desmons",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi B",
        "event_start": "2022-06-30T14:35:00",
        "event_end": "2022-06-30T15:30:00",
        "event_type": "Autre...",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=JlJfXoq5cn0",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 334188,
        "name": "Découvrez Batect, un docker-compose sous stéroïdes",
        "description": "Vous utilisez docker-compose au quotidien pour lancer vos applications et leurs dépendances ? Vous multipliez les fichiers override pour gérer vos différentes configurations ? Venez découvrir Batect, un outil qui simplifie la déclaration des conteneurs et des dépendances.",
        "speakers": "Thomas François",
        "language": null,
        "format": "Quicky",
        "venue": "Amphi D",
        "event_start": "2022-06-30T13:05:00",
        "event_end": "2022-06-30T13:20:00",
        "event_type": "Développement",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=F9K3Mn99ejw",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 334197,
        "name": "Outils d'empreinte carbone des cloud public : comparer des pommes et des oranges",
        "description": "L'hébergement, et en particulier les data-centers, a un impact environnemental, mais on ne sait généralement pas estimer combien il représente sur nos projets. Depuis quelques mois, tous les grands fournisseurs de cloud public vous proposent des outils pour estimer le CO2 émis par les ressources cloud que vous utilisez. Malheureusement, il n'existe pas de méthodologie commune pour ces estimations et chaque acteur compte un peu ce qu'il veut ! Venez voir ce qui se cache derrières les \"calculettes carbones\" de GCP, Azure et AWS, ce qu'ils prennent en compte et ce qu'ils négligent.",
        "speakers": "Pierre Rust",
        "language": null,
        "format": "Tool in action",
        "venue": "Amphi B",
        "event_start": "2022-06-30T17:05:00",
        "event_end": "2022-06-30T17:30:00",
        "event_type": "Green",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=vUbhNL-so7Q",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 334452,
        "name": "API Hypermedia en vrai",
        "description": "\"L'hypermedia, j'en ai entendu parlé mais je n'ai jamais vu en vrai.\"\r\n\r\nC'était aussi ma première réaction en 2017 et depuis j'ai eu l'occasion d'en créer quelques une. \r\n\r\nBien que le hype soit plutôt en faveur de GraphQL, paradoxalement le contexte technologique est clairement mature pour tirer avantage de tous les bénéfices d'une API REST hypermedia (le fameux niveau 3). \r\n\r\nCette conférence détaille les avantages et réponses aux questions ou doutes lors de la mise en place d'une telle API : \r\n* Est-ce que c'est pas un peu usine à gaz ? pour le front ? et pour le back ?\r\n* Quel format de données choisir ou plutôt pourquoi HAL est suffisant :) ?\r\n* Est-ce que c'est performant ? Comment s'assurer que ce le soit ?\r\n* Comment gérer le HATEOS ? Qu'est ce que cela apporte vraiment ?\r\n* Comment bien gérer le cache ? \r\n* Est-ce que je peux continuer à utiliser Postman ? Est-ce que c'est compatible avec l'API Gateway ? Quel tooling est nécessaire ?\r\n\r\nCette conférence montre aussi la mise en oeuvre d'une approche Design First des API et les avantages d'une stack full Typescript.\r\n\r\nPour conclure, les qqs principes à retenir pour réussir son API REST hypermedia.",
        "speakers": "Rémi Dewitte",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi B",
        "event_start": "2022-06-30T10:30:00",
        "event_end": "2022-06-30T11:25:00",
        "event_type": "Architecture",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=LZZMrdHNlus",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 334490,
        "name": "Disaster Radio: Comment communiquer en cas de coupure 4G ?",
        "description": "Les réseaux de télécommunication actuels fonctionnent grâce à des antennes et routeurs sujets à plusieurs risques.\r\n\r\nEn effet, ces infrastructures peuvent être mises KO en cas de catastrophes naturelles, d'incidents industriels, d'attaques cyber ... \r\nUne coupure des équipements pourrait causer un blackout et rendre inopérant nos moyens de communication classiques (internet, radio 2G/3G/4G/5G...).\r\n\r\nJe présenterai dans cette conférence des projets open source permettant de mettre en œuvre des réseaux de télécommunication à petite échelle et bas coût, permettant de rétablir des communications en cas d'urgence.\r\n\r\nCes réseaux sont basés sur:\r\n- le protocole radio Lora, qui propose une moyenne portée (quelques km) et demande une faible quantité d'énergie\r\n- des microcontrôleurs ESP32, économiques et frugaux, faisant office de point accès et de relais\r\n\r\nLa présentation intègre une démonstration d'un petit déploiement de réseau local avec deux microcontrôleurs ainsi  que l'utilisation d'une application mobile fonctionnant sur ce réseau.",
        "speakers": "Glenn Feunteun",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-06-30T13:30:00",
        "event_end": "2022-06-30T14:25:00",
        "event_type": "IoT Embarqué",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=PVw-i6sQxDw",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 334540,
        "name": "Optimiser vos conteneurs Spring avec le Jar layering et la Modularité",
        "description": "Ces dernières années, la livraison des applications sous forme de conteneurs est devenue la norme. Dans le monde Java, cette évolution des méthodes de déploiement a amené une problématique nouvelle d'optimisation des conteneurs. On retrouve souvent deux axes d'amélioration : la volumétrie des images stockées et la consommation mémoire des conteneurs. Les frameworks Java, tels que Spring, ont sû s'adapter face à ces contraintes d'optimisation et proposent aujourd'hui des solutions nous permettant par exemple d'optimiser le build de nos images Docker avec les layered Jars. La modularité introduite dans Java 9 permet aussi de créer des environnements d'exécution plus adaptés à nos applications. Dans ce talk, nous présenterons ces deux notions, les avantages qu'elles apportent ainsi que les contraintes qu'elles impliquent. Puis, nous rédigerons ensemble un guide pour que chacun puisse utiliser ces notions dans leurs projets.",
        "speakers": "Benjamin Vouillaume, Édouard Siha",
        "language": null,
        "format": "Tool in action",
        "venue": "Amphi D",
        "event_start": "2022-07-01T17:00:00",
        "event_end": "2022-07-01T17:25:00",
        "event_type": "Autre...",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=eCCeSlR4B88",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 334863,
        "name": "Advanced TypeScript Patterns",
        "description": "Durant ce talk nous verrons ensemble comment les nouveautés introduite depuis TypeScript 4 (Template Literals Types, Recursite Conditionnal Types, etc) peuvent nous aider à rendre notre code plus robuste et expressif.\r\n",
        "speakers": "Gregory Houllier",
        "language": null,
        "format": "Tool in action",
        "venue": "Amphi D",
        "event_start": "2022-06-30T17:05:00",
        "event_end": "2022-06-30T17:30:00",
        "event_type": "Web",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=ARdEcCo1RV8",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 335570,
        "name": "Cryptographie - Et si on en parlait ?",
        "description": "La cryptographie vous fait peur ? \r\nVous êtes perdus lorsque l'on parle de clef privée, clef publique, fonction à trappe, modulo et exposant, courbe elliptique ...\r\nVous les algorithmes Diffie Hellman ou RSA vous semblent impénétrables? \r\nEt si nous prenions le temps de revenir aux fondamentaux? \r\n\r\nAu cœur de la cryptographie se niche une poignée de concepts fondamentaux; pas si compliqués que ça à comprendre. \r\nC'est pourquoi nous allons, au cours de ces deux heures, tenter de les démystifier. \r\nIl y a aura bien évidemment quelques passages par les mathématiques, mais ceux-ci seront volontairement succinct... d'une part parce que ce n'est pas le lieu pour rentrer dans les détails mathématiques, mais également parce que nous ne sommes pas mathématiciens 😊.\r\n\r\nAu programme: \r\n- un soupçon de  théorie des groupes\r\n- De la fabrication de pots de peinture (Diffie-Hellman)\r\n- Du RSA \"fait main\" avec votre voisin de table\r\n- De jolies courbes (Courbes elliptiques)\r\n- Du hachis de données (fonction de hash)\r\n- le concept de signature\r\n- Et l'application de tout ces concepts dans un cas d'usage de tous les jours : La connexion à un site httpS.\r\n\r\n",
        "speakers": "Mathieu Rolland, Pierre Chesneau",
        "language": null,
        "format": "Université",
        "venue": "Amphi C",
        "event_start": "2022-06-29T16:00:00",
        "event_end": "2022-06-29T18:00:00",
        "event_type": "Développement",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=tTi8UiH5fio",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 335586,
        "name": "Mob Programming Toolbox",
        "description": "Assis dans une salle sombre qui sent le fauve depuis des heures. Ça fait longtemps que plus personne ne prête attention à Gérard qui ne lâche pas le clavier. Quand le manager vous a trouvé, il vous a remonté les bretelles. À 4 sur cette tâche ? Quel gaspillage !\r\nTu aimes l'idée du mob mais parfois ça ne marche pas. Et ça peut devenir plus une torture qu'un super pouvoir.\r\nViens découvrir avec nous comment tu peux retrouver de la joie à faire ensemble. Faciliter des sessions de mob efficaces, convaincre tes collègues et le management.",
        "speakers": "Thomas Carpaye, Hadrien Mens-Pellen",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-06-30T16:00:00",
        "event_end": "2022-06-30T16:55:00",
        "event_type": "Méthodologie",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=wK4PL3RsskA",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 337668,
        "name": "Micronaut AOT: optimiser vos applications pour le JIT et GraalVM",
        "description": "Micronaut est un framework performant, parti d'une feuille vierge, qui vise à maximiser la productivité des développeurs sans compromission sur les performances: reflection-free, feedback à la compilation au lieu du runtime, génération de code,... Micronaut est déja particulièrement compétitif lorsque l'on souhaite compiler des images natives avec GraalVM.\r\n\r\nLe dernier né de la famile s'appelle Micronaut AOT. Il s'agit d'une extension de Micronaut qui permet d'optimiser vos applications en précalculant lors du packaging de l'application des informations qui sont normalement connues au runtime (analyse dynamique).\r\n\r\nPar exemple, Micronaut AOT est capable de convertir vos fichiers de configuration yaml en configuration Java, évitant de parser des fichiers au démarrage de l'application, ou encore d'optimiser le chargement des classes via le service loader.\r\n\r\nSi vous souhaitez voir un microservice Java démarrer en moins de 10ms, ce talk est fait pour vous: nous montrerons comment utiliser Micronaut AOT et optimiser des applications Micronaut traditionelles sur la JVM, mais aussi les binaires natifs compilés avec GraalVM.\r\n",
        "speakers": "Cédric Champeau",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi A",
        "event_start": "2022-07-01T11:35:00",
        "event_end": "2022-07-01T12:30:00",
        "event_type": "Développement",
        "venue_id": "1",
        "video_url": "https://www.youtube.com/watch?v=NOUcNOvNGq4",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 337751,
        "name": "Et si on construisait un cloud opensource pour la datascience ?",
        "description": "Bob fait de la datascience. Il traite des gros volumes de données. Si gros qu'un jour, il est venu demander une nouvelle clé USB, plus grosse. Et là, on s'est dit qu'il y avait un vrai problème.  \r\nAlors, comme on avait mal pour lui, on a commencé à s'intéresser à l'expérience utilisateur qu'il mériterait.  \r\nDe fil en aiguille, on s'est retrouvé à lui créer un cloud maison en assemblant les plus belles technologies opensource et en y ajoutant une petite application web d'expérience utilisateur. \r\nLes choses ont un peu dérapé et cette application est devenue un véritable projet opensource : Onyxia (https://github.com/InseeFrLab/onyxia).  \r\nDans ce talk, on commencera par un panorama des choix technologiques que nous avons fait pour construire une plateforme de traitement de données (conteneurisation, stockage objet ...) pour ensuite s'intéresser à la nouvelle vie de Bob qui a troqué sa clé USB contre un environnement cloud-native.  \r\n",
        "speakers": "Comte Frédéric, Olivier Levitt",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-06-30T10:30:00",
        "event_end": "2022-06-30T11:25:00",
        "event_type": "Architecture",
        "venue_id": "4",
        "video_url": null,
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338028,
        "name": "A la découverte d'Apache Pinot et de ses différents types indexes",
        "description": "Apache Pinot est une base de données analytique temps réelle. Analytique et temps réelle ? Sur le papier ça à presque l'air trop beau non ?\r\n\r\nVenez découvrir Apache Pinot et ses différents types d'indexes : inderted index, bloom filter, start-tree, ...Apache Pinot est une base de données analytique temps réelle. Analytique et temps réelle ? Sur le papier ça à presque l'air trop beau non ?\r\n\r\nVenez découvrir Apache Pinot et ses différents types d'indexes : inderted index, bloom filter, start-tree, ...",
        "speakers": "Loïc Mathieu",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi C",
        "event_start": "2022-06-30T13:30:00",
        "event_end": "2022-06-30T14:25:00",
        "event_type": "Data",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=iCj21YvYw3I",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338141,
        "name": "Boostez votre monorepo en quelques minutes",
        "description": "Si vous avez un monorepo, découvrez comment Turborepo peut améliorer votre expérience de dev en quelques minutes.",
        "speakers": "Nicolas Morel",
        "language": null,
        "format": "Quicky",
        "venue": "Amphi D",
        "event_start": "2022-06-30T12:45:00",
        "event_end": "2022-06-30T13:00:00",
        "event_type": "Développement",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=lqoIFFDLLJ4",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338200,
        "name": "Et si on faisait le tour de CORS ? ⛵",
        "description": "Embarquez avec moi pour profiter du panorama magnifique proposé par les lieux avant de découvrir ses trésors cachés !\r\n\r\nLe web devient de plus en plus sécuritaire, il est possible de protéger plus efficacement nos APIs en utilisant les bons headers. \r\n\r\nCependant, savez-vous réellement ce qui se cache derrière ce mal aimé CORS ?\r\n\r\nDans ce sujet nous allons aborder l'origine de la technique et expliquer comment tout ceci fonctionne pour que vous puissiez devenir le chief-CORS-officer de l'équipe !",
        "speakers": "Cedric Gatay",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-06-30T11:35:00",
        "event_end": "2022-06-30T12:30:00",
        "event_type": "Web",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=qL9oSxnuJEs",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338201,
        "name": "📐 Cryptographie, hachage, chiffrement, sans les maths !",
        "description": "Nous utilisons tous les jours de la cryptographie, mais savons-nous ce qui se passe lorsque :\r\n\r\nnous nous connectons à un site web en HTTPS nous accédons à un serveur via SSH nous générons des hash pour des mots de passe, du cache-busting de ressources,... Dans cette présentation, vous verrez les différents types d'algorithme et les principes fondamentaux derrière les implémentations que nous utilisons pour assurer la sécurité des échanges. Ainsi vous n'hésiterez plus à vous prononcer lors de discussion autour de ces sujets !\r\n\r\nEt tout ceci, sans le point qui fait le plus peur, les maths !",
        "speakers": "Cedric Gatay",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi A",
        "event_start": "2022-07-01T16:00:00",
        "event_end": "2022-07-01T16:55:00",
        "event_type": "Architecture",
        "venue_id": "1",
        "video_url": "https://www.youtube.com/watch?v=4_g9f4w02hw",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338324,
        "name": "Comment avoir une idée des perfs de votre serveur Linux en 60s",
        "description": "Après une brève introduction sur les problématiques de performance sous Linux, nous passerons en revue les outils de la checklist proposée par Brendan Gregg pour vous aider à démarrer rapidement à mettre le doigt sur votre problème.\r\nLes 10 commandes de cette checklist sont des incontournables à découvrir/redécouvrir !",
        "speakers": "Laurent Huet",
        "language": null,
        "format": "Quicky",
        "venue": "Amphi C",
        "event_start": "2022-06-30T12:45:00",
        "event_end": "2022-06-30T13:00:00",
        "event_type": "Autre...",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=mEuH_iz1-h8",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338325,
        "name": "Des conteneurs dans mon navigateur",
        "description": "Pas de baleines dans cette présentation, mais une de mes extensions Firefox préférées, à mon avis largement sous-cotée : multi-account containers.\r\n\r\nElle va permettre de cloisonner les données de navigation entre les onglets, et nous verrons ensemble plusieurs situations où c'est utile pour un développeur.\r\n\r\nEn bonus, nous allons voir comment créer des groupes d'onglets masquables temporairement, et compléter avec d'autres extensions pour étendre les fonctionnalités et l'ergonomie.\r\n",
        "speakers": "Benoît Masson",
        "language": null,
        "format": "Quicky",
        "venue": "Amphi B",
        "event_start": "2022-07-01T12:45:00",
        "event_end": "2022-07-01T13:00:00",
        "event_type": "Autre...",
        "venue_id": "2",
        "video_url": null,
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338392,
        "name": "Impacts environnementaux du Cloud : the good, the bad, the ugly",
        "description": "Le Cloud est un outil formidable qui facilite notre quotidien, nous permet de travailler plus vite, de mettre en place des architectures dont nous n'osions pas rêver il y a encore quelques années.\r\n\r\nParmi les promesses du Cloud, il y a celle du Green IT : en utilisant le Cloud, nous pourrions réduire l'empreinte environnementale de nos activités. Mais qu'en est-il réellement de cette promesse ?\r\n\r\nC'est ce que nous explorerons lors de cette présentation, en nous penchant tout d'abord sur les impacts environnementaux de l'informatique au sens large, puis en nous focalisant sur les aspects hébergements, et enfin en regardant ce que les grands acteurs du Cloud mettent en place pour réduire leurs impacts.\r\n",
        "speakers": "Sylvain Révéreault",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi A",
        "event_start": "2022-06-30T11:35:00",
        "event_end": "2022-06-30T12:30:00",
        "event_type": "Green",
        "venue_id": "1",
        "video_url": "https://www.youtube.com/watch?v=nWpjBElyxbs",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338464,
        "name": "Comment j'ai trouvé mon appart avec du code",
        "description": "Comment trouver son logement idéal sur un marché tendu ? Ma solution à moi, ça a été de coder mes propres scrapers ! Pour être le premier au courant dès qu'un bien qui matche mes critères est sur le marché, je me suis lancé sur un projet fullstack avec une petite contrainte supplémentaire : un budget de 0€.\r\nOn parlera scraping, Node.js, React, Puppeteer, Heroku, Clever Cloud, Gitlab CI, AWS, et même Raspberry Pi !",
        "speakers": "Thibaut Rousseau",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi B",
        "event_start": "2022-07-01T14:35:00",
        "event_end": "2022-07-01T15:30:00",
        "event_type": "Autre...",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=sTzTfhRGiuE",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338487,
        "name": "Elasticsearch datastreams, un condensé de bonnes pratiques pour vos données temporelles",
        "description": "Indexer des données dans Elasticsearch, rien de plus simple ! Gérer les indexations quotidiennes de centaines de millions de documents, un peu moins.\r\n\r\nElastic a implémenté au cours des dernières années des APIs nous facilitant le suivi et la gestion du cycle de vie de nos données. Reindex, rollover, shrink, les lifecycle policies autant d'APIs fournies par Elasticsearch nous permettant d'opérer notre cluster, un jeu d'enfant ! Il faut évidemment combiner à cela des templates d'index et des alias pour que tout s'aligne correctement. Ca commence à faire !\r\n\r\nPour répondre à cette complexité naissante, les datastreams ont vu le jour en 7.9, une sorte de structure magique permettant de centraliser la mise en place de toutes ses bonnes pratiques.\r\n\r\nFaisons le tour de cette fonctionnalité, déjà utilisée massivement dans l'univers Beats. Et bien plus encore :)",
        "speakers": "Maxime Odye",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi A",
        "event_start": "2022-07-01T14:35:00",
        "event_end": "2022-07-01T15:30:00",
        "event_type": "Data",
        "venue_id": "1",
        "video_url": "https://www.youtube.com/watch?v=wzse3SCgBcs",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338505,
        "name": "Migrer 150K LoC en TypeScript: Challenge Accepted",
        "description": "Comment adopter TypeScript sur une base de code en production ?\r\nDurant ce talk, nous verrons les différentes strategies et outils mis en place chez Swile pour nous permettre de bénéficier des avantages de TypeScript.\r\n3 projets, 3 contextes, 3 stratégies d'adoption.",
        "speakers": "Gregory Houllier",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi B",
        "event_start": "2022-07-01T10:30:00",
        "event_end": "2022-07-01T11:25:00",
        "event_type": "Web",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=eDghyLeTJcg",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338533,
        "name": "Déployez vos applications FaaS avec Serverless Framework",
        "description": "Serverless Framework est une solution complète pour développer des applications FaaS et les déployer en une commande.\r\n\r\nLe développement d'applications FaaS implique généralement l'utilisation conjointe d'un outil pour gérer le packaging et d'une solution d'Infra As Code. Ces deux derniers n'étant pas conçus pour fonctionner ensemble, leur intégration n'est pas toujours aisée.\r\n\r\nDurant ce Tools In Action nous allons développer en live une application FaaS avec Serverless Framework, et la déployer sur un Cloud Provider.\r\n",
        "speakers": "Mathieu Laude, Vincent Poilvert",
        "language": null,
        "format": "Tool in action",
        "venue": "Amphi C",
        "event_start": "2022-06-30T17:35:00",
        "event_end": "2022-06-30T18:00:00",
        "event_type": "Développement",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=y_If6HBhYs8",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338603,
        "name": "Spécifier ses API asynchrones avec AsyncAPI",
        "description": "AsyncAPI est le langage de description des API asynchrones très fortement inspiré de la spécification OpenAPI (fka Swagger). Avec l’émergence des architectures orientées événements, AsyncAPI est alors le bienvenu.\r\n\r\nNous verrons donc comment décrire très simplement et rapidement une API asynchrone, factoriser la description et générer une description moderne à publier en ligne !",
        "speakers": "Sébastien Lecacheur",
        "language": null,
        "format": "Tool in action",
        "venue": "Amphi A",
        "event_start": "2022-06-30T17:35:00",
        "event_end": "2022-06-30T18:00:00",
        "event_type": "Architecture",
        "venue_id": "1",
        "video_url": "https://www.youtube.com/watch?v=V4b4fA-Jaew",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338621,
        "name": "La théorie de la vitre brisée appliquée au développement logiciel",
        "description": "Connaissez vous la théorie de la vitre brisée ? Selon celle-ci, il y a un lien de cause à effet entre le le taux de criminalité et le nombre croissant de fenêtres brisées à la suite d'une seule fenêtre brisée que l'on omet de réparer.\r\n\r\nEt si on appliquait cette théorie au développement logiciel ? Durant ce talk vous en apprendrez un peu plus sur cette théorie, découvrirez quelles sont les fameuses \"vitres brisées\" que nous pouvons rencontrer dans notre quotidien de développeurs, et surtout ce que nous pouvons mettre en place pour les réparer rapidement et ainsi éviter une propagation de mauvaises habitudes.",
        "speakers": "Saad Ansari",
        "language": null,
        "format": "Quicky",
        "venue": "Amphi B",
        "event_start": "2022-06-30T12:45:00",
        "event_end": "2022-06-30T13:00:00",
        "event_type": "Méthodologie",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=Ju5LfNnocTA",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338622,
        "name": "Infra as code: heaven or hell?",
        "description": "Avec la mouvance DevOps prenant de l'ampleur ces dernières années, gérer son infrastructure intelligemment est devenu une priorité pour toute prod qui se respecte.\r\nDe nouveaux outils sont apparus pour permettre aux devs de ramener la gestion de l'infra au même niveau que celle du code.\r\n\r\nCette présentation s'appuiera sur le passage complet de notre SI en mode infra-as-code. Les bons côtés et des galères du quotidien démontrés au moyen d'exemples basés sur AWS CDK. \r\n",
        "speakers": "Guillaume Tinon, Victor Clogenson",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi B",
        "event_start": "2022-06-30T16:00:00",
        "event_end": "2022-06-30T16:55:00",
        "event_type": "Architecture",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=z0bPjewmBfA",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338682,
        "name": "GitOps , une mise en situation un peu réaliste sur Kubernetes avec Flux",
        "description": "T'en as assez des talks qui déploient des hello-world pour démontrer la pertinence de l'outil younameit.\r\nÇa tombe bien : ce qui nous intéresse, c'est plutôt d'essayer une mise en situation DevSecOps un peu réaliste.\r\nOn va donc construire pas à pas un scénario d'entreprise avec des dev teams, qui deploy / update / rollback des WebApps Pokémon sur Kubernetes. Elles utilisent Kustomize ou des charts Helm pour cela.\r\nCôté Ops, on va aussi se préoccuper des enjeux de sécurité de la plateforme : ségrégations des droits des équipes, des flux réseau des WebApps. Pour cela, nos Ops vont utiliser Kyverno. Et puis des applis, ça se monitor, patch management transparent sur la stack technique, métrologie, contrôle des activités sur le cluster.\r\nOn va voir comment ces équipes collaborent entre elles au quotidien dans un workflow GitOps qui s'appuie sur Kubernetes et Flux, autour d'un code stocké dans Github, et plein d'autres choses encore…",
        "speakers": "Laurent Grangeau, Ludovic Piot",
        "language": null,
        "format": "Université",
        "venue": "Amphi B",
        "event_start": "2022-06-29T13:30:00",
        "event_end": "2022-06-29T15:30:00",
        "event_type": "Architecture",
        "venue_id": "2",
        "video_url": "https://www.youtube.com/watch?v=FVOgb--QOhA",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338685,
        "name": "Service Mesh - Reprenons les bases",
        "description": "Le concept de Service Mesh est à la mode depuis quelques années. Et pour cause, il apporte de grands bénéfices dans une architecture en microservices... Mais ça veut dire quoi, tout ça, au juste ?\r\n\r\nCette présentation repart des bases pour vous donner une vision claire de ce qu'est un Service Mesh et de ce que ça peut vous apporter concrètement.",
        "speakers": "Sylvain Decout, Vincent Arrocéna",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi C",
        "event_start": "2022-07-01T11:35:00",
        "event_end": "2022-07-01T12:30:00",
        "event_type": "Architecture",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=iA2BbX7WuTw",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338692,
        "name": "La scale-up, l'autonomie et le sous-marin nucléaire",
        "description": "La plupart des organisations efficaces ont en commun d'avoir des équipes autonomes. L'autonomie est aussi un moteur individuel puissant : qui n'aime pas se sentir libre de définir sa vie, ses horaires, sa façon de travailler ?\r\n\r\nLorsqu'on travaille dans une scale-up en plein essor et qui grossit de manière exponentielle, l'autonomie n'est plus une option, c'est un carburant indispensable. Mais est-ce pour autant facile à mettre en oeuvre ?\r\n\r\nC'est de cette quête d'autonomie dont nous aimerions vous parler à travers nos histoires, nos réussites et nos erreurs. Nous parlerons de full-remote, de release management, de démarche SRE, de conflits d'équipes et de Domain Driven Design. \r\n\r\nOn parlera aussi d'APIs de split de monolithe, mais également de sous-marins nucléaires et de contract tests. \r\n\r\nPleins de trucs et astuces pour arriver à mettre en place une Culture de l'autonomie qui tienne la route sur le long terme.",
        "speakers": "Pauline Jamin, Thomas Pierrain",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-06-29T16:00:00",
        "event_end": "2022-06-29T16:55:00",
        "event_type": "Méthodologie",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=WurK0nYWcSM",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338695,
        "name": "Kubernetes pour les développeurs",
        "description": "Docker-compose a changé ma façon de gérer mes conteneurs en local, Kubernetes a changé ma façon de gérer leurs déploiements et cycle de vie. \r\nPar contre, en tant que développeur, je me suis souvent trouvé en face de problèmes :\r\n-  les temps d'attente des jobs CI\r\n- reproductibilité en local\r\n- debugging\r\n- duplication entre docker-compose et les manifestes kubernetes\r\n\r\nA travers cette présentation, je vais vous proposer différents moyens pour se faciliter la vie.\r\n",
        "speakers": "erwann thebault",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi A",
        "event_start": "2022-06-30T10:30:00",
        "event_end": "2022-06-30T11:25:00",
        "event_type": "Développement",
        "venue_id": "1",
        "video_url": "https://www.youtube.com/watch?v=E_bcn3R5zHE",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338697,
        "name": "Web assembly, et maintenant ?",
        "description": "Web assembly, la “V1” est prête. Un des cas d'usage le plus répandu : miner du bitcoins sur ta machine à ton insu. Oui mais pourquoi, alors que c'est tout à fait possible en JS ?! Web assembly, c'est une spécification définissant les “instructions assembleurs” du web. Cool !! Mais personne n'écrit d'assembleur ? (en tout cas pas nous) Web assembly, ca permet de faire tourner nos jeux old school sur ton navigateur. Oui mais comment ??? Si tu t'es déjà posé une de ces questions, ou toutes ces questions, nous allons tenter d'y répondre. Au cours de ce talk, nous ferons une petite rétrospective de webassembly, un état des lieux de l'écosystème actuel et celui de demain ?: langage, tooling…\r\n\r\nPS: Si au fond de toi, flash, GWT ou les applets Java te manquent, Web assembly peut aussi être pour toi; même si c'est vraiment pas le BUT",
        "speakers": "erwann thebault, Mahdi Aici",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi D",
        "event_start": "2022-07-01T14:35:00",
        "event_end": "2022-07-01T15:30:00",
        "event_type": "Web",
        "venue_id": "4",
        "video_url": "https://www.youtube.com/watch?v=TzCTJyeocd8",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 338705,
        "name": "La sécurité dès la conception du projet",
        "description": "PENSER UNE DÉMARCHE PRÉVENTIVE DÈS LA PHASE DE CONCEPTION D'UN PROJET\r\n--\r\n\r\nEn 2020, le nombre de cyberattaques a explosé dans le monde. Selon un récent rapport de l'Agence nationale de la sécurité des systèmes d'information (ANSSI), les opérations de l'ANSSI en 2020 ont été multipliées par 4, par rapport à l'année précédente. \r\n\r\nLa pandémie de Covid-19 a démultiplié les opportunités de déstabilisation (cyberattaques) dans plusieurs secteurs, dont celui de la santé: CHU de Rouen, Narbonne, Montpellier, Dax, Villefranche-sur-Saône, Oloron-Sainte-Marie, Saint-Gaudens... La liste des hôpitaux s'allonge. \r\n\r\nDe plus, depuis l'entrée en vigueur du RGPD, la protection des données personnelles ainsi que la sécurité \"by design\" deviennent des sujets centraux dans nos projets.\r\n\r\nJe présenterai les techniques utilisées et j'aborderai aussi la prise de conscience du management sur ces aspects importants.\r\n\r\nEn effet, même en étant dans le réseau interne d'un datacenter, nous ne sommes pas à l'abri d'une intrusion. Le risque 0 n'existe pas.\r\n\r\n##### ~ Security By Design 101",
        "speakers": "David Aparicio",
        "language": null,
        "format": "Conférence",
        "venue": "Amphi C",
        "event_start": "2022-06-30T10:30:00",
        "event_end": "2022-06-30T11:25:00",
        "event_type": "Autre...",
        "venue_id": "3",
        "video_url": "https://www.youtube.com/watch?v=h2-fZzkfK28",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 10338705,
        "name": "Keynote d'ouverture",
        "description": "...",
        "speakers": "Équipe BreizhCamp, Arthur Tarroux, Mélissa Cottin",
        "language": null,
        "format": "Keynote",
        "venue": "Amphi C",
        "event_start": "2022-06-30T09:00:00",
        "event_end": "2022-06-30T10:00:00",
        "event_type": "Keynote",
        "venue_id": null,
        "video_url": null,
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 10338706,
        "name": "Keynote de clôture",
        "description": "Keynote de clôture",
        "speakers": "Équipe BreizhCamp, ...surprise !",
        "language": null,
        "format": "Keynote",
        "venue": "Amphi C",
        "event_start": "2022-06-30T18:05:00",
        "event_end": "2022-06-30T18:50:00",
        "event_type": "Keynote",
        "venue_id": null,
        "video_url": "https://www.youtube.com/watch?v=_RujpNVz6xQ",
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 10338707,
        "name": "Meet'n Greet",
        "description": "Meet'n Greet",
        "speakers": null,
        "language": null,
        "format": "Party",
        "venue": "Hall",
        "event_start": "2022-06-30T18:50:00",
        "event_end": "2022-06-30T20:30:00",
        "event_type": "Autre",
        "venue_id": null,
        "video_url": null,
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 10338708,
        "name": "Keynote d'ouverture",
        "description": "...",
        "speakers": "Équipe BreizhCamp, Jean-Baptiste Onofré",
        "language": null,
        "format": "Keynote",
        "venue": "Amphi C",
        "event_start": "2022-07-01T09:00:00",
        "event_end": "2022-07-01T10:00:00",
        "event_type": "Keynote",
        "venue_id": null,
        "video_url": null,
        "files_url": null,
        "slides_url": null
    },
    {
        "id": 10338709,
        "name": "Keynote de clôture",
        "description": "Keynote de clôture",
        "speakers": "Équipe BreizhCamp",
        "language": null,
        "format": "Keynote",
        "venue": "Amphi C",
        "event_start": "2022-07-01T17:30:00",
        "event_end": "2022-07-01T18:00:00",
        "event_type": "Keynote",
        "venue_id": null,
        "video_url": "https://www.youtube.com/watch?v=KYW89UMo_jw",
        "files_url": null,
        "slides_url": null
    }
]
