[
  {
    "id": "470096",
    "name": "Une autre manière de tester vos microservices",
    "event_start": "2023-06-30T16:00:00",
    "event_end": "2023-06-30T16:25:00",
    "event_type": "Méthodologie",
    "format": "Tool in action",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Gwendal Leclerc",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Dans une architecture microservices, l’interdépendance entre les microservices et le couplage avec des services externes (base de données, cache, message queue, ...) peuvent rendre les tests très compliqués. Les tests unitaires vont souvent nécessiter de mocker beaucoup de choses de manière invasive, pour au final tester peu de code métier, sans pouvoir tout couvrir.\r\n\r\nPour répondre à cette problématique, dans l’équipe domaine d’OVHcloud, nous avons mis en place une manière de tester nos différents services en “boîte grise”. Dans ce talk nous explorerons les concepts derrière cette stratégie de test, ainsi que ses avantages et inconvénients.\r\n\r\nNous verrons comment la mettre en œuvre via quelques outils :\r\n\r\n- Un peu de Shell et de Docker\r\n- Venom (https://github.com/ovh/venom) : un test runner déclaratif qui permet de faire des appels HTTP, manipuler des bases de données, et plein d’autres choses\r\n- Smocker (https://smocker.dev/guide/) : un server de mocks HTTP déclaratif pilotable via API\r\n\r\n\r\nVous découvrirez ainsi comment tester un microservice de manière complètement isolée, puis comment tester un ensemble de microservices interconnectés."
  },
  {
    "id": "470136",
    "name": "Playwright : l'outil qui va révolutionner les tests end-to-end",
    "event_start": "2023-06-28T11:00:00",
    "event_end": "2023-06-28T11:55:00",
    "event_type": "Web",
    "format": "Conférence",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Jean-François Greffier",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Certaines équipes hésitent ou ne mettent pas en place de tests end-to-end.\r\n\"Trop dur à mettre en place\" \"Tests difficiles à maintenir\" \"Perte d'argent et de temps\"\r\n\r\nDans cette conférence, je vous propose de partir à la découverte de Playwright. Un nouvel outil Microsoft, rapide, fiable et complet, qui va probablement changer vos aprioris et appréhensions sur les tests sur navigateurs.\r\n\r\nÀ travers live-coding, démos et exemples, nous verrons comment créer des tests robustes. Nous évoquerons aussi les performances, les limitations à prendre en compte, l'outillage ou encore comment débugger, même après coup.\r\n\r\nVenez découvrir le futur des tests end-to-end !"
  },
  {
    "id": "470217",
    "name": "L'Architecture Hexagonale par la pratique, le live coding qui rendra vos applications plus pérennes",
    "event_start": "2023-06-29T14:35:00",
    "event_end": "2023-06-29T15:30:00",
    "event_type": "Architecture",
    "format": "Conférence",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Julien Topçu",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Il arrive toujours un moment où, le logiciel est tellement gros et vieux qu’il devient inmaintenable. Impossible de mettre à jour la stack technique sans tout casser, les nouvelles fonctionnalités deviennent de plus en plus longue à implémenter et la dette technique étant tellement lourde que le refactoring devient exorbitant.\r\n\r\nEt si on vous disait que tout ça était plus un problème de pratique qu’un problème de vieillesse du logiciel ?\r\n\r\nVenez découvrir par la pratique via ce 100% live coding, comment l’Architecture Hexagonale peut tacler la complexité logicielle en vous permettant d’être évolutif et pérenne tout en vous aidant à mieux gérer votre dette technique."
  },
  {
    "id": "470263",
    "name": "Rust sans (trop) roter du sang",
    "event_start": "2023-06-29T13:30:00",
    "event_end": "2023-06-29T14:25:00",
    "event_type": "Développement",
    "format": "Conférence",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Édouard Siha, Alexis Chotard",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "S'il y a bien un langage de programmation qui a le vent en poupe, c'est Rust. Les arguments en sa faveur ne manquent pas : programmation sûre, performance d'exécution, écosystème vivant, etc. Il n'est même pas nécessaire d'y ajouter l'argument d'autorité \"Linus Torvalds approuve\" !\r\n\r\nComme toute personne curieuse, nous nous sommes lancés... pour se prendre de plein fouet la courbe d'apprentissage rude qui fait aussi la réputation du langage. Mais bon, nous sommes utilisateurs de Vi au quotidien depuis des années, il n'y a pas de raison qu'on n'arrive pas à coder en Rust !\r\n\r\nDans cette présentation, nous proposons une approche visuelle pour illustrer le plus simplement possible les points d'achoppement de la montée en compétence sur Rust... et vous verrez qu'en fait, c'est pas compliqué, on a juste été très mal habitués par les autres langages depuis des années. Notre but ? Que vous repartiez avec les bons outils pour écrire vos premiers petits programmes en Rust et ne paniquiez pas face à la volubilité du compilateur."
  },
  {
    "id": "470536",
    "name": "Après l'ordi 8 bit voici la carte VGA sur breadboard",
    "event_start": "2023-06-29T16:00:00",
    "event_end": "2023-06-29T16:55:00",
    "event_type": "Autre...",
    "format": "Conférence",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Olivier Huber",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Vous avez aimé le show sur l'ordinateur 8 bit au BreizhCamp 2022 ?\r\nVoici en avant première sa carte graphique VGA toujours from scratch et toujours sur breadboard et avec encore plus de fun ;)\r\nPréparez-vous à une fanfare 🎺 de pixels 👾"
  },
  {
    "id": "471700",
    "name": "Pourquoi tester ce n’est pas douter",
    "event_start": "2023-06-29T16:00:00",
    "event_end": "2023-06-29T16:55:00",
    "event_type": "Méthodologie",
    "format": "Conférence",
    "venue": "Amphi A",
    "venue_id": "1",
    "speakers": "Édouard Siha, Gérôme Egron",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "TU, TI, tests E2E, tests API, tests fonctionnels, tests auto, etc. : beaucoup de noms qui n’ont pourtant pas nécessairement la même définition selon l’interlocuteur.  Profitons de cette session pour clarifier tout cela.\r\n\r\nParticipez avec nous à un atelier 3 amigos afin de discuter d’une nouvelle fonctionnalité puis accompagnez-nous dans le développement de cette dernière avec une approche test first sur plusieurs niveaux.\r\n\r\nVous (re)découvrirez les avantages offerts par tout l’outillage autour des tests et quels bénéfices en tirer. À la fin de cette session, vous aurez fait des tests vos amis pour que tester ne soit plus jamais douter."
  },
  {
    "id": "471907",
    "name": "Event Driven, qu'est-ce donc ?! Un nouveau buzzword ?",
    "event_start": "2023-06-29T16:00:00",
    "event_end": "2023-06-29T16:55:00",
    "event_type": "Architecture",
    "format": "Conférence",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Céline Louvet",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "On entend, de plus en plus, parler d'Event Driven Systems. C'est un peu le nouveau truc à la mode, mais en quoi ça consiste réellement ? Pour le comprendre, nous repartirons des fondamentaux, pour progressivement voir ce que peut nous apporter le modèle événementiel publisher / subscriber, ses avantages et ses inconvénients. Nous verrons comment l'utiliser dans certains cas fréquents.\r\n\r\nPar le passé, j'ai eu à travailler sur un SI qui a grossi au fil du temps. A chaque nouveau service ajouté, à chaque nouvelle fonctionnalité ajoutée, de la complexité s'est cumulée jusqu'à rendre des évolutions impossibles, voire dangereuses. De plus, soyons honnête, parfois de fausses \"bonnes\" idées ont pu empirer la situation. Nous allons nous inspirer de ce SI tout au long pour voir ce que nous pourrions y apporter.\r\n\r\nPour chaque situation, nous pourrons voir les besoins auxquels elle répond, ses avantages ainsi que ses défauts, défauts que nous essayerons de corriger ensuite.\r\nNotre objectif ? Des services moins interdépendants et qui y gagneront en performance et en stabilité."
  },
  {
    "id": "472288",
    "name": "The Golang Error Picture Show 👄",
    "event_start": "2023-06-30T12:45:00",
    "event_end": "2023-06-30T13:00:00",
    "event_type": "Développement",
    "format": "Quicky",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Benoît Masson",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Parmi les principaux reproches qui sont faits au langage Go, il y en a un qui revient souvent : pourquoi la gestion des erreurs est-elle aussi verbeuse ?\r\n\r\nAprès quelques rappels, nous verrons que ce n'est pas une fatalité… et qu'au contraire, cette « lourdeur » imposée peut être bénéfique pour le fonctionnement de nos applications et la clarté du code.\r\n\r\nCe sera aussi l'occasion de faire un tour d'horizon des principales bibliothèques d'erreur, et des dernières évolutions du langage sur ce sujet."
  },
  {
    "id": "472290",
    "name": "Mob.sh : La présentation dont vous êtes le héros",
    "event_start": "2023-06-29T17:05:00",
    "event_end": "2023-06-29T17:30:00",
    "event_type": "Développement",
    "format": "Tool in action",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Benoît Masson, Gwendal Leclerc",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "On entend de plus en plus parler de mob programming pour travailler à plusieurs sur un problème, et c'est une très bonne chose. Mais avec la montée du télétravail ou du remote, comment est-ce qu'on peut faire efficacement du mob à distance ?\r\n\r\nCette présentation interactive fera une démo de l'outil mob.sh, qui s'applique à tous les contextes projets, à partir du moment où ils sont versionnés avec Git. Nous l'utiliserons ensemble pour finaliser les slides, en y incluant nos retours d'expérience et les vôtres. Merci d'avance pour votre aide !\r\n\r\n(PS : pas de matériel à prévoir)"
  },
  {
    "id": "472448",
    "name": "À la découverte du développement mobile (sans les maux de tête)",
    "event_start": "2023-06-30T13:05:00",
    "event_end": "2023-06-30T13:20:00",
    "event_type": "Mobile",
    "format": "Quicky",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Robin Caroff, Cyril Hue",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Vous êtes un développeur souhaitant explorer les possibilités offertes par le développement mobile, mais vous êtes confronté à diverses incertitudes.\r\n  * Comment déployer son code sur un téléphone ?\r\n  * Comment distribuer son application sur un magasin ?\r\n  * Combien ça coûte ?\r\n  * Combien de temps ça prend ?\r\n  * etc.\r\n\r\nAu cours de ce talk, nous vous présenterons le parcours de Cyril, développeur web s’étant lancé dans le développement d’une application mobile. Nous partagerons, des anecdotes, les problématiques qu'il a rencontré et les solutions qu'il a utilisées pour les résoudre. Avec l'aide de Robin, expert en développement mobile, nous aborderons les bonnes pratiques et des astuces pour développer, déployer et maintenir une application mobile.\r\n\r\nCe talk est destiné à tous les curieux intéressés par cet écosystème particulier."
  },
  {
    "id": "473350",
    "name": "N'abandonnez pas votre collègue d'astreinte !",
    "event_start": "2023-06-29T13:30:00",
    "event_end": "2023-06-29T14:25:00",
    "event_type": "Développement",
    "format": "Conférence",
    "venue": "Amphi A",
    "venue_id": "1",
    "speakers": "Vincent Lainé",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Au travers de cette session je vais tenter de vous partager comment vous amis développeu(ses|rs), vous pouvez aider ce(te) collègue d'astreinte qui est bipé(e) un samedi à 2h du mat car votre service est tombé, et tout cela sans même avoir besoin de vous connecter à votre outil de messages instantanés ou même de vous réveiller ! \r\n\r\nVous l'aurez compris, nous allons parler logs, debug et plus si affinité"
  },
  {
    "id": "473546",
    "name": "\"Développement durable\" : et si on développait enfin des logiciels bons pour les gens et la planète",
    "event_start": "2023-06-29T10:30:00",
    "event_end": "2023-06-29T11:25:00",
    "event_type": "Green",
    "format": "Conférence",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Cécilia Bossard, Aurélie Lopes",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "\"People, Planet, Profit\" : les 3 piliers du développement durable peuvent également s'appliquer au développement logiciel.\r\n\r\nComment faire rimer ces trois mots avec nos pratiques ? \r\n\r\nNous vous proposons un tour d'horizon avec des exemples concrets, de la conception UX au déploiement sur les serveurs, de bonnes pratiques d'éco-conception et d'accessibilité, et comment concilier toutes ces techniques avec un budget restreint."
  },
  {
    "id": "474310",
    "name": "Et si vous redécouvriez Apache Maven ?",
    "event_start": "2023-06-30T16:00:00",
    "event_end": "2023-06-30T16:25:00",
    "event_type": "Développement",
    "format": "Tool in action",
    "venue": "Amphi A",
    "venue_id": "1",
    "speakers": "Alioune Sy",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Cela fait bientôt 20 ans que maven nous accompagne au quotidien sur nos projets dans l'écosystème Java. A l'instar de toute relation de longue date, vous avez surement acquis des réflexes quotidien, affermi votre compréhension de son fonctionnement au fil de vos expériences et renforcé vos biais cognitifs.\r\n\r\nEtes vous vraiment sûr de bien connaitre et comprendre Maven ? Avez vous parcouru la doc récemment ?\r\n\r\nJe vous propose, dans cette session, de redécouvrir Maven à travers 10 fonctionnalités clés (existantes ou à venir) qui sont bien souvent méconnues ! Nous parlerons entre autres de chiffrement de données sensibles, de remote repository filtering, de dépendances optionnelles ou des fonctionnalités à venir de maven 4..."
  },
  {
    "id": "474787",
    "name": "Welcome to Jurassic Stack",
    "event_start": "2023-06-30T12:45:00",
    "event_end": "2023-06-30T13:00:00",
    "event_type": "Développement",
    "format": "Quicky",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Malo Toanen",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Ce talk a failli s'appeler \"Optimisation des fonctions récursives terminales\" mais ça faisait encore plus peur qu'un T-Rex™.\r\n\r\nL'objectif est d'expliquer, de manière accessible à tous, ce qu'il se passe lorsqu'on appelle une fonction :\r\n\r\n- Qu'est-ce qu'une pile d'exécution ?\r\n- Comment certains langages l'optimisent-elle ?\r\n- Qu'est-ce qu'il se passe dans une fonction récursive ? (généralement un débordement de pile* si c'est moi qui l'ai codée)\r\n- Comment certains langages l'optimisent-elle (BIS) ?\r\n\r\n\r\n*StackOverflow"
  },
  {
    "id": "475032",
    "name": "Always-Green Refactoring : Retravailler sa codebase en douceur et sans stress",
    "event_start": "2023-06-30T14:35:00",
    "event_end": "2023-06-30T15:30:00",
    "event_type": "Méthodologie",
    "format": "Conférence",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Thomas Carpaye, Mohammed Lamzira",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Est-ce que toi aussi dans ta codebase tu as des morceaux de code qui te donnent des sueurs froides ? Des territoires anxiogènes que tu fuis comme la peste et que personne n'ose toucher ? D'habitude, le refactoring c’est des semaines de frustration et de souffrance, avec la CI en PLS et des bugs en abondance.\r\n\r\nDe toutes façons, personne ne t'accorde du temps pour retravailler ce code qui a l'air de fonctionner en production.\r\n\r\nViens coder avec nous pour apprendre des techniques simples comme la méthode mikado, les baby step, etc. tout en restant toujours au vert. Découvre nos outils pour te ré approprier l'enfer de ton legacy en un minimum de temps et en faire un terrain de jeu où tu pourras refactorer avec confiance."
  },
  {
    "id": "475115",
    "name": "De l'IA dans le quotidien : traitements de données multimodales appliqués aux contenus éditoriaux",
    "event_start": "2023-06-30T11:35:00",
    "event_end": "2023-06-30T12:30:00",
    "event_type": "Data",
    "format": "Conférence",
    "venue": "Amphi A",
    "venue_id": "1",
    "speakers": "Julien Perron, Ibrahima Ba",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Vous entendez beaucoup (trop) parler d'IA, de deep learning, de GPT, etc. mais cela reste abstrait pour vous ?\r\n\r\nOn vous propose dans ce talk de vous présenter des cas très concrets d'utilisation de diverses techniques de deep learning que nous utilisons au quotidien au sein de la DSI de Ouest-France pour transformer nos données brutes (texte, images, podcasts, vidéo) en connaissances exploitables.\r\n\r\nAu programme : \r\n\r\nembedding, classification, entity linking, traitement d'images, speech-to text, ...\r\n... et à quoi cela nous sert dans le contexte d'un journal et site d'information tel que Ouest-France."
  },
  {
    "id": "475415",
    "name": "STOP à l’espionnage ! Comment disparaître d’internet ? 🕵🏼‍♂️",
    "event_start": "2023-06-30T14:35:00",
    "event_end": "2023-06-30T15:30:00",
    "event_type": "Autre...",
    "format": "Conférence",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Mickael Alves, Etienne Idoux",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Vous en avez marre de vous sentir traqué sur Internet ? 😒 Nous aussi ! Mais est-il réellement possible de nos jours de devenir un véritable ninja digital ? 🥷🏻 Et si pour protéger votre vie privée en ligne, il fallait tout d’abord comprendre qui a accès à vos données et ce qu’ils peuvent faire avec ?\r\n\r\nNous allons vous apprendre comment être un vrai pro de la confidentialité et de la sécurité des données, mais surtout comment devenir anonyme en ligne et éviter les curieux… 👀 Sortez vos loupes et suivez-nous dans cette enquête pour reprendre le contrôle de votre vie numérique !\r\n\r\nEt si vous êtes chanceux, nous vous dévoilerons peut-être quelques secrets de ninja pour échapper aux espions ! Venez nous rejoindre et apprenez comment devenir le maître du camouflage numérique ! 😶‍🌫️"
  },
  {
    "id": "475433",
    "name": "Eco-index : le nutriscore du développement",
    "event_start": "2023-06-29T17:35:00",
    "event_end": "2023-06-29T18:00:00",
    "event_type": "Green",
    "format": "Tool in action",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Cécilia Bossard",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Il est désormais admis que le numérique n'est pas anodin dans la pollution de notre planète.\r\nEtant donné que 80% de la pollution du numérique est dûe à la phase de fabrication des terminaux, un axe majeur pour la réduire est de limiter le nombre de nouveaux terminaux à fabriquer, et donc faire en sorte que les utilisateurs conservent leur matériel le plus longtemps possible.\r\nEn tant que développeur, notre mission est donc de réaliser des sites et des applications plus sobres pouvant tourner sur du matériel relativement ancien. \r\nMais comment connaître le niveau de sobriété de notre site ? Comment avoir des premières pistes d'amélioration sans passer par un audit complet ?\r\nJe vous propose de découvrir un outil développé par le collectif GreenIT qui permet de mesurer très facilement un index d'éco-conception des pages web."
  },
  {
    "id": "475842",
    "name": "Les mystères des permissions",
    "event_start": "2023-06-30T13:30:00",
    "event_end": "2023-06-30T14:25:00",
    "event_type": "Architecture",
    "format": "Conférence",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Céline Louvet",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Au début de votre projet, vous avez simplement géré l'authentification de votre utilisateur, puis petit à petit, vous avez ajouté une notion de rôles utilisateur. Puis, plus le temps passe et plus votre product manager vous demande d’affiner cette gestion et moins cette gestion par rôle va suffire.\r\n\r\nPeut-être avez-vous eu déjà eu l’impression que la gestion des permissions est quelque d’assez obscure ou complexe. On sait qu’on doit la faire, mais on ne sait pas trop comment, ni même pourquoi. Parfois, on confond même avec l'authentification. Mais alors, en quoi ça consiste rellement et comment on peut l'appliquer ?\r\n\r\nA chaque situation, sa solution. Nous pourrons voir comment répondre aux besoins les plus fréquents, ainsi que leurs avantages et leurs inconvénients.\r\n\r\nNotre objectif ? Avoir la gestion des permissions adaptée à notre situation, sans pour autant ajouter une masse de complexité dans toute notre application."
  },
  {
    "id": "476032",
    "name": "Le guide du Koroutard ou comment naviguer dans le monde des coroutines Kotlin",
    "event_start": "2023-06-30T14:35:00",
    "event_end": "2023-06-30T15:30:00",
    "event_type": "Développement",
    "format": "Conférence",
    "venue": "Amphi A",
    "venue_id": "1",
    "speakers": "Mathieu Durand",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Vous avez entendu parler des coroutines Kotlin mais n'avez pas saisi l'intérêt ? Vous avez toujours rêvé de comprendre ce que veux dire \"'suspend\" ? Vous vous arrachez les cheveux avec Spring Webflux ? Est-ce que Loom changera la donne ?\r\n\r\nDans cette conférence, je vous donnerai toutes les bonnes adresses pour naviguer dans le monde merveilleux de l’asynchrone & des coroutines Kotlin."
  },
  {
    "id": "476054",
    "name": "Arc, un navigateur qui vous veut du bien",
    "event_start": "2023-06-29T12:45:00",
    "event_end": "2023-06-29T13:00:00",
    "event_type": "Autre...",
    "format": "Quicky",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Pascal Le Merrer",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Découvrez comment gagner du temps avec Arc, un navigateur Web qui propose une expérience utilisateur radicalement différente de celle de ses prédécesseurs. "
  },
  {
    "id": "476391",
    "name": "Les fondamentaux de \"Kubernetes Operator\"",
    "event_start": "2023-06-28T16:00:00",
    "event_end": "2023-06-28T18:00:00",
    "event_type": "Architecture",
    "format": "Université",
    "venue": "Amphi A",
    "venue_id": "1",
    "speakers": "Adrien Wattez, Nicolas Bouron, Laurent Perrin",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Apprenez à devenir un vrai \"John Hammond\" de Kubernetes (k8s) et à créer vos propres ressources k8s.\r\nQue vous soyez Ansible, Go ou même Java ce workshop est fait pour vous.\r\n\r\nNous vous proposons une initiation aux concepts d’opérateurs brique applicative incontournable de la jungle k8s. \r\n\r\nAu programme:\r\n- Rappels architecture k8s.\r\n- Initiation aux opérateurs k8s.\r\n- Lab, création d'opérateurs avec votre langage préféré Ansible, Go ou Java."
  },
  {
    "id": "476455",
    "name": "Infrastructure as Code ou Infrastructure as Software ?",
    "event_start": "2023-06-29T13:30:00",
    "event_end": "2023-06-29T14:25:00",
    "event_type": "Autre...",
    "format": "Conférence",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Alexandre Nédélec",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Alors que la plupart des applications que nous développons sont désormais cloud-native, automatiser la création de leurs infrastructures via de l’Infrastructure as Code est devenu un incontournable.\r\n\r\nMais est-ce qu'au-delà d'écrire du \"code\" pour décrire notre infra, on ne devrait pas développer l'infra comme n'importe quel logiciel ?\r\n\r\nC'est l'approche privilégiée par certaines solutions d'IaC dont Pulumi, une plateforme open-source d'infrastructure as software que l’on abordera plus en détails dans cette présentation. Ce sera également l'occasion de discuter un peu des avantages et inconvénients des différentes solutions d'IaC.\r\n\r\nSi comme moi vous :\r\n\r\n- voulez que votre infrastructure fasse partie intégrante de votre software et soit traitée comme le reste de votre code (build, tests unitaires, packages de composants réutilisables, ..)\r\n- préférez le Kotlin/Java/C#/Typescript/Python/Go au JSON, au YAML ou à apprendre un nouveau DSL\r\n- aimez garder le confort de votre IDE et de son auto-complétion pour écrire votre infra\r\n- souhaitez une solution d'Infrastructure as Code multi-providers qui vous permette d'automatiser un peu tout\r\n- voulez provisionner interactivement votre infrastructure en langage naturel grace à l'IA\r\n\r\nAlors ce talk est fait pour vous !"
  },
  {
    "id": "476759",
    "name": "Code Lab Collaboratif",
    "event_start": "2023-06-28T13:30:00",
    "event_end": "2023-06-28T15:30:00",
    "event_type": "Web",
    "format": "Université",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Léna Ndiaye",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "C’est quoi un code Lab collaboratif ?\r\nJe te proposerai un bout de code en JavaScript. Je te dirais ce qui pose problème niveau accessibilité web.\r\nTu auras 10 ou 15 mn (en fonction du niveau de code) pour le rendre accessible.\r\nUn-e volontaire ira proposer sa solution au tableau, qu’on comparera avec la mienne\r\n Il y aura du code pour tous les niveaux (Débutant à Avancé).\r\nSi tu as un bout de code JavaScript qui te donne des migraines en essayant de le rendre accessible, viens nous le proposer, tu repartiras avec un début de solution.\r\nTu peux venir avec ton PC portable. Mais sans PC portable, tu pourras quand même utiliser le mien pour proposer ta solution au tableau.\r\nA la fin de la session, tu auras appris ou révisé certaines parties du RGAA et tu auras amélioré ou aider à améliorer le niveau JS de tes camarades.\r\n\r\nPenses quand même à télécharger les bouts de code : https://docs.google.com/document/d/1UPU-aqQLmq1lpHCABsIZZ6BVyCCYB13oXkPy6vOh3zU/edit"
  },
  {
    "id": "477417",
    "name": "Comment aborder le design dans une démarche d’éco-conception ?",
    "event_start": "2023-06-28T17:05:00",
    "event_end": "2023-06-28T18:00:00",
    "event_type": "Green",
    "format": "Conférence",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Damien Legendre",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Les chiffres alarmants de l’impact du numérique sur le climat sont clairs. Il est désormais temps de comprendre comment passer du constat à la mise en pratique. Cette conférence vise un but simple : aider les designers et ceux qui créent le web avec eux à concevoir des interfaces à la fois utiles et mesurées en regard de l'impact climatique du numérique.\r\n\r\nComment nous, designers et concepteurs pouvons jouer un rôle clef dès les fondations du projets, pour éviter de produire des services web obèses et disproportionnés ?\r\n\r\nÀ l’issue de ce talk, vous repartirez avec des leviers pour convaincre, mais surtout des méthodes et outils simples, applicables sur le champ pour vos futurs projets éco-conçus, issues de nos recherches et éprouvées sur nos projets récents."
  },
  {
    "id": "477427",
    "name": "La CI/CD dans le monde du développement mobile",
    "event_start": "2023-06-29T16:00:00",
    "event_end": "2023-06-29T16:55:00",
    "event_type": "Mobile",
    "format": "Conférence",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Erwan Tilly, Mathieu Viel",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "L’implémentation d’une CI/CD dans un projet mobile est au cœur des méthodologies de développement agile et DevOps.\r\n\r\nLors de nos développements, nous pouvons rencontrer de nombreux risques liés à la complexité des différents OS (iOS / Android) et aux différents constructeurs (Huawei, Samsung, Apple…).\r\n\r\nNous vous présentons : \r\n-\tUn ensemble de bonnes pratiques pour avoir une CI/CD fiable et robuste\r\n-\tUn REX basé sur la CI/CD de Niji et de nos clients \r\n-\tLa mise en place d’une CI/CD\r\n-\tLes différents outils utilisés"
  },
  {
    "id": "477470",
    "name": "S'attaquer à un legacy grâce au DDD",
    "event_start": "2023-06-29T11:35:00",
    "event_end": "2023-06-29T12:30:00",
    "event_type": "Développement",
    "format": "Conférence",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Tanguy Bernard",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Dans une vie de développeur, il arrive bien souvent que le métier sur lequel nous intervenons se complexifie. La solution mise en place doit alors évoluer. S'attaquer à ce genre de complexité sur un legacy bien en place peut être fastidieux.\r\n\r\nJe propose dans ce talk de vous partager 4 stratégies mises en avant par Eric Evans (Auteur de Domain-Driven Design: Tackling Complexity in Software) pour aborder et faire évoluer votre legacy grâce au DDD.\r\n\r\nJe vous partagerai également mon expérience suite à l'implémentation de ces stratégies."
  },
  {
    "id": "477534",
    "name": "Live-coding d'un serveur web avec Ktor",
    "event_start": "2023-06-30T16:00:00",
    "event_end": "2023-06-30T16:25:00",
    "event_type": "Web",
    "format": "Tool in action",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Renaud Mathieu",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Ktor est un framework Kotlin dédié à la création de serveurs et de clients asynchrones dans des systèmes connectés. Dans cette session, nous découvrirons les concepts de base de Ktor 2 en codant en live un serveur HTTP à partir de zéro à l'aide de Ktor Server. Nous allons également passer en revue Ktor Client, de sa configuration à la création de demandes et à l'installation de plugins.\r\n\r\n"
  },
  {
    "id": "477620",
    "name": "Au delà du test AB avec les Bandits Manchots",
    "event_start": "2023-06-29T14:35:00",
    "event_end": "2023-06-29T15:30:00",
    "event_type": "Data",
    "format": "Conférence",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Elys Allesiardo, Fabrice Depaulis",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Les Bandits Manchots sont une méthode d'optimisation basée sur l'apprentissage par renforcement qui permet de comparer plusieurs solutions en ligne et de choisir la plus performante. Ils peuvent être employés par les équipes marketing pour tester l'efficacité d'une nouvelle fonctionnalité sur les utilisateurs, en remplacement du test A/B classique.\r\n\r\nDans cette présentation, nous allons explorer le cadre théorique des Bandits Manchots et voir comment les implémenter en Python avec des exemples concrets. Nous allons également présenter le contrat d'interface minimal à respecter pour utiliser ces algorithmes et montrer comment ils ont été appliqués dans des projets réels.\r\n\r\nCette présentation s'adresse à toute personne intéressée par les Bandits Manchots, qu'elle soit familière ou non avec python. Les algorithmes présentés sont facilement implémentables dans n'importe quel langage possédant des bibliothèques de calcul statistique.\r\n"
  },
  {
    "id": "477649",
    "name": "API Green Score : la boite à outil des API Numériquement responsable",
    "event_start": "2023-06-29T17:05:00",
    "event_end": "2023-06-29T17:30:00",
    "event_type": "Green",
    "format": "Tool in action",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Yannick Tremblais",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Les API ont aussi un rôle à jouer dans les impacts du numérique sur l’ environnement dans leur consommation ou leur conception. \r\nAu sein du collectif API Thinking, avec des entreprises de divers secteurs (cosmétiques, banques, énergie, assurance, transport, etc …)  nous avons rassemblés des méthodes, outils, réflexions pour que les API soient « numériquement responsable » au travers d’un API Green Score.  \r\nOn parlera de sensibilisation, de gouvernance, de mesure mais promis il y aura du code.\r\n"
  },
  {
    "id": "478000",
    "name": "Les machines à états, une documentation exécutable ? (et debuggable ? et testable ? 🤫)",
    "event_start": "2023-06-28T16:00:00",
    "event_end": "2023-06-28T16:55:00",
    "event_type": "Développement",
    "format": "Conférence",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Antoine Cailly",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Les machine à états, pour visualiser la logique de fonctionnement d'une application sous forme d'un diagramme, c'est vieux comme le monde 👴\r\nAlors pourquoi ressortir ça maintenant ?\r\n\r\nParce qu'un nouvel éditeur basé sur xstate est arrivé, stately, et il semble offrir un moyen aux non devs (testeur, PO, whatever) de visualiser et éditer ces fameuses machines\r\n\r\nCes machines à état étant ensuite exécutées dans l'appli, on aurait un code et une doc toujours synchro et compréhensible, le rêve 🤩\r\nAttendez, il y a mieux ! Il paraît qu'on peut générer des tests e2e depuis ces machines à états 🤯\r\n\r\nAlors essayons, j'ai pris une petite appli perso et j'ai tenté de voir ce que ca donnait 🧪"
  },
  {
    "id": "478033",
    "name": "30 index sur une table PG de 6To : défis et solutions",
    "event_start": "2023-06-30T13:30:00",
    "event_end": "2023-06-30T14:25:00",
    "event_type": "Data",
    "format": "Conférence",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Emmanuel Quincerot, Flora Briand",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Au cours du temps, nos bases de données grossissent. Viennent alors les problématiques de performance. Une solution classique consiste à rajouter des index. Ceux-ci jouent effectivement un rôle crucial sur les performances, mais ils peuvent également être contre-productifs. Les pièges classiques : ajouter un index à chaque nouvelle requête, mal les définir ou les laisser vieillir sans s'en occuper.\r\n\r\nChez Doctolib nous avons une BDD Postgres de 30To, avec des pics quotidiens de 250k requêtes par seconde. La plus grosse table fait 6To, elle a 30 index.\r\n\r\nAlors comment nous sommes-nous outillés pour améliorer l'usage de nos index et réduire leur nombre ? Nous parlerons de représentativité de tests, de pièges SQL, de write-amplification, de benchmark d'index, et des défis que notre équipe a rencontrés pendant quelques mois."
  },
  {
    "id": "478105",
    "name": "Machine Learning sur Android avec ML Kit - sans être expert.e en IA",
    "event_start": "2023-06-29T10:30:00",
    "event_end": "2023-06-29T11:25:00",
    "event_type": "Mobile",
    "format": "Conférence",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Julien Salvi",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Vous développez des applications Android et vous souhaitez apporter des fonctionnalités de Machine Learning dans vos projets, sans être un.e expert.e en intelligence artificielle ? Dans cette session, découvrez comment utiliser ML Kit pour ajouter facilement des fonctionnalités de Machine Learning optimisées pour le mobile à vos apps.\r\n\r\nNous allons explorer les principales API de Vision et de Natural Language Processing offertes par ML Kit, pour vous aider à intégrer des fonctionnalités telles que la reconnaissance d'image, la classification de texte, ou encore la détection de langues, dans vos applications Android. En utilisant des exemples de code concrets, vous apprendrez comment intégrer ces fonctionnalités de manière simple et intuitive, et pourrez potentiellement débloquer de nouvelles idées pour vos futurs projets."
  },
  {
    "id": "478113",
    "name": "Améliorez vos tests grâce à l'architecture hexagonale",
    "event_start": "2023-06-30T11:35:00",
    "event_end": "2023-06-30T12:30:00",
    "event_type": "Architecture",
    "format": "Conférence",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Antoine Barroux, Tristan Denmat",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "En 2023, nous sommes désormais capables de faire générer du code complexe à une IA type ChatGPT. En revanche, nous n’avons toujours pas d’approche systématique pour écrire de bons tests. Dans cette conférence, nous voulons revenir sur les problèmes les plus courants rencontrés par les devs lors de la rédaction de tests et montrer comment l’architecture hexagonale peut aider à les résoudre."
  },
  {
    "id": "478324",
    "name": "L'open source rendu beaucoup plus accessible avec Gitpod 🫶",
    "event_start": "2023-06-29T17:35:00",
    "event_end": "2023-06-29T18:00:00",
    "event_type": "Développement",
    "format": "Tool in action",
    "venue": "Amphi A",
    "venue_id": "1",
    "speakers": "Jean-Philippe Baconnais",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Vous avez déjà entendu parler d'open source ? Tout le monde peut contribuer. Si si ! Que vous soyez développeur·se, product owner, SRE ou tout autre poste, vous pouvez apporter votre aide à un projet.\r\n\r\nPersonnellement, en tant que dév, j'ai voulu aller contribuer sur de multiples projets. Et régulièrement, je me suis cassé les dents pour déployer l'outil sur mon poste et ce, malgré la présence de documentation. Dans le pire des cas, j'ai même fini par abandonner.\r\n\r\nDésormais, avec le bouton \"Open with Gitpod\" ou \"Contribute with Gitpod\" (visible dans les README.md des projets), je sais tout de suite que les projets auront un minimum de configuration que je n’aurai PAS à faire. Et c'est sacrément pratique 😄\r\n\r\nDans ce talk, après vous avoir rapidement introduit ce qu'est Gitpod, je vous expliquerai en quoi cela m'a aidé à contribuer sur des projets open source et vous convaincrai, peut-être, de passer du temps, en tant que mainteneur, à configurer vos projets pour qu'ils soit \"prêt à l'emploi\" pour vos (futurs?) contributeurs.  \r\n\r\n"
  },
  {
    "id": "478377",
    "name": "Poser une fusée sur la Lune : Artemis 2.0-RC 🚀",
    "event_start": "2023-06-28T16:00:00",
    "event_end": "2023-06-28T18:00:00",
    "event_type": "Développement",
    "format": "Université",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Audren Burlot",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Vous vous dites que Elon Musk est un flambeur et que n'importe quel canaille armée d'un portable et d'un client Websocket peut poser des fusée sur la Lune ? Vous avez raison !\r\nJe vous invite dans cet atelier à venir le prouver dans un Coding Contest en mode bot battle multi-joueurs !\r\nÀ vous d'écrire l'algorithme qui permettra à votre fusée d'atterrir sans exploser sur le sol lunaire, équipé seulement de votre ordinateur, de votre meilleure salade de `if` et de votre flegme habituelle.\r\n\r\nPré-requis :\r\nUne machine avec Node >= 16"
  },
  {
    "id": "478379",
    "name": "Retourner le cerveau de sa Gameboy et les attraper (vraiment) tous 💪",
    "event_start": "2023-06-30T10:30:00",
    "event_end": "2023-06-30T11:25:00",
    "event_type": "Développement",
    "format": "Conférence",
    "venue": "Amphi A",
    "venue_id": "1",
    "speakers": "Audren Burlot",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Vous avez 10 ans. Vous êtes assis sous un arbre dans votre jardin, et vous jouez à la Gameboy Pocket. La vie est douce.\r\nSoudain, votre meilleur ami débarque de nulle part, sa cartouche de Pokémon Bleu dans la main, et vous crie quelque chose !\r\nIl le jure sur la tête de son chien : il a réussi à attraper Mew.\r\nSelon vous, il y a deux explications possibles : votre ami s'est acheté un Action Replay et a triché comme un malpropre, ou il vous joue du pipeau.\r\nEt si je vous disais qu'il existait une 3ème explication : votre ami est un génie de l'assembleur.\r\nC'est ce que je vous propose de découvrir dans un talk qui sent bon les années 90 et le reverse engineering."
  },
  {
    "id": "478459",
    "name": "Et s’il suffisait de documenter pour tester ? (Workshop)",
    "event_start": "2023-06-28T10:00:00",
    "event_end": "2023-06-28T12:00:00",
    "event_type": "Méthodologie",
    "format": "Université",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Sébastien Fauvel",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "La documentation dans un context agile est un vrai défi.\r\nLes évolutions constantes rendent les mises à jour chronophages pour un résultat souvent insuffisant.\r\nIl faut repenser le problème autrement.\r\n\r\nLa combinaison des approches Living Documentation et Approval Testing ouvre une nouvelle voie,\r\nen utilisant les tests comme des générateurs de documentation.\r\nLe comportement de l'application est décrit sous une forme adaptée à sa compréhension, sans contrainte de représentation.\r\nOn obtient une documentation lisible par tous et continuellement à jour tout en assurant la non regression.\r\n\r\nVous allez découvrir comment cette approche,\r\nen remettant à plat la gestion de la documentation, des spécifications et des tests pour les penser comme un seul et même élément,\r\npermet de favoriser le dialogue entre les intervenants, de réduire les coûts de maintenance et d'assurer une parfaite synchronisation avec le code.\r\nVous repartirez de cette session avec de nouvelles perspectives pour vos tests et votre documentation\r\nainsi que les bases pour expérimenter par vous même.\r\n\r\nPour cet atelier, vous aurez besoin d'un ordinateur avec un environnement de développement (au moins un pour deux ou trois).\r\nComme il n'y a aura pas de Wifi disponible, merci de cloner au préalable le repository suivant: https://github.com/sfauvel/Parrot-Refactoring-Kata\r\nVérifier que vous êtes en mesure d'exécuter, hors ligne, les tests de ce projet avec le langage que vous aurez choisi.\r\nInstallez également un plugin pour asciidoc sur votre IDE ou sur votre navigateur."
  },
  {
    "id": "478468",
    "name": "La Merge Queue, la pièce manquante du CI/CD",
    "event_start": "2023-06-29T14:35:00",
    "event_end": "2023-06-29T15:30:00",
    "event_type": "Autre...",
    "format": "Conférence",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Charly Laurent",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Dans un monde en constante évolution, l’état de l’art en développement logiciel est crucial pour rester compétitif. Cette conférence vous dévoilera les dernières avancées en matière de développement.\r\n\r\nNotre objectif en tant qu’équipe de développement est de concilier qualité, sécurité et rapidité. Livrer rapidement et fréquemment nos produits est essentiel pour conquérir le marché. Pour répondre à ces enjeux, nous automatisons les processus tels que les tests, l’intégration et le déploiement. Mais que reste-t-il à optimiser ? Quels sont les goulots d’étranglement qui persistent ?\r\n\r\nDécouvrez la Merge Queue, une solution innovante qui repousse les limites de l’automatisation en simplifiant et sécurisant la fusion du code. Nous présenterons des cas d’usage concrets démontrant les gains de temps significatifs pour les équipes de développement.\r\n\r\nQue vous soyez un développeur expérimenté ou que vous cherchiez à en apprendre davantage sur les dernières tendances en matière de développement, cette conférence est l’opportunité parfaite pour enrichir vos connaissances et appréhender les défis complexes de notre industrie.\r\n\r\nPoints clés à retenir :\r\n- Restez informé sur les dernières avancées en matière de développement logiciel.\r\n- Comprenez l’importance de l’automatisation et de l’optimisation du pipeline CI/CD.\r\n- Découvrez la Merge Queue, une solution innovante pour sécuriser et faciliter la fusion de code.\r\n- Apprenez grâce à des cas d’usage concrets comment gagner du temps et améliorer la vélocité de vos équipes.\r\n\r\nNe manquez pas cette occasion unique de vous immerger dans les meilleures pratiques du développement logiciel afin d’optimiser votre pipeline CI/CD !"
  },
  {
    "id": "478516",
    "name": "Docker Compose, zero to hero",
    "event_start": "2023-06-28T13:30:00",
    "event_end": "2023-06-28T15:30:00",
    "event_type": "Développement",
    "format": "Université",
    "venue": "Amphi A",
    "venue_id": "1",
    "speakers": "Nicolas De Loof, Guillaume Lours",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Vous avez déjà entendu parlé de Docker Compose ? Peut être l'utilisez vous déjà un peu ?\r\nNous vous proposons de découvrir toutes les facettes de cet outil en construisant une application ensemble, de manière itérative et en 100% live coding.\r\n\r\nDepuis un exemple simple, nous aborderons toutes les astuces pour être un développeur efficace: services multiples, gestion des volumes et du réseau, build avancé avec des ressources protégées par ssh, multi-plateformes..."
  },
  {
    "id": "478578",
    "name": "Développez votre première extension de navigateur",
    "event_start": "2023-06-28T16:00:00",
    "event_end": "2023-06-28T18:00:00",
    "event_type": "Web",
    "format": "Université",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Florent Vuillemin, Aurélien Partiot",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Les quelques dinosaures parmi nous se souviennent peut-être avec émotion de Netscape Navigator, à l'époque où 8 Mo de RAM suffisaient pour afficher une page web.\r\n\r\nAujourd'hui, les navigateurs sont devenus un outil central de l'informatique (voyez Chrome OS) et exécutent des applications complexes. Au passage, ils ont acquis de la souplesse, par exemple les extensions. Celles-ci permettent de modifier en profondeur leur comportement pour améliorer la navigation ou ajouter des fonctionnalités.\r\n\r\nDurant cette université, nous vous proposons de développer votre première extension pour Firefox et facilement portable vers Chrome. Va-t-elle remplacer toutes les images des sites par des images de chatonsraptors ? Ou bloquer toutes les URLs qui parlent de NFT ? Nous déciderons en séance !\r\n\r\nPublic : Débutant, quelques notions de javascript sont préférables.\r\nPré-requis : Un PC Windows/Linux avec node déjà installé (nous ne pourrons pas vous aider sur MacOS !)."
  },
  {
    "id": "478579",
    "name": "(T-)REX : refonte en écoconception des services numériques de la Scop La Maison Écologique",
    "event_start": "2023-06-29T13:30:00",
    "event_end": "2023-06-29T14:25:00",
    "event_type": "Green",
    "format": "Conférence",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Sylvain Révéreault, Pascal Greboval",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "La Scop La Maison Écologique est éditrice des magazines La Maison Écologique et Kaizen.\r\n\r\nDepuis fin 2021, elle met en œuvre un chantier de refonte de ses services numériques, dans une approche d'écoconception financée par l'ADEME.\r\n\r\nDans ce talk, nous vous présenterons la démarche utilisée pour cette refonte, les travaux réalisés, et les apprentissages de ce projet. \r\nNous y parlerons notamment d'analyse de cycle de vie, de bonnes pratiques d'écoconception web et de sobriété fonctionnelle.\r\n\r\nPlan :\r\n - Introduction et contexte\r\n - Phase de diagnostic\r\n - Phase de réalisation\r\n - Résultats et apprentissages\r\n\r\n"
  },
  {
    "id": "478589",
    "name": "API Versioning: Sauvegarder les versions en voie de disparition malgré l'évolution",
    "event_start": "2023-06-29T10:30:00",
    "event_end": "2023-06-29T11:25:00",
    "event_type": "Développement",
    "format": "Conférence",
    "venue": "Amphi A",
    "venue_id": "1",
    "speakers": "Thomas Martin",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Quand vous maintenez une API publique, se pose rapidement la nécessité de versioner cette API pour pouvoir introduire des breaking changes sans impacter vos clients.\r\n\r\nCela suppose soit de conserver des expositions des versions d'API précédentes, soit d'avoir du code qui se chargera de faire les transformations nécessaires pour être compatible avec la dernière version de l'API.\r\n\r\nChez Whoz, nous avons implémenté un système pour répondre à  la deuxième méthode en intégrant 2 principales problématiques: \r\n- Ne pas gérer ces transformations dans le code des services eux-mêmes\r\n- Minimiser le code nécessaire à la rétrocompatibilité ainsi que la maintenance induite\r\n\r\nNotre solution est contenu dans une Api Gateway basée sur Spring Cloud Gateway, est écrite principalement en Kotlin et utilise la librairie réactive Reactor.\r\n"
  },
  {
    "id": "478690",
    "name": "Spring 6, Spring Boot 3, Spring xx 18 ... mais en fait comment il fonctionne Spring le dinosaure 🦖?",
    "event_start": "2023-06-29T11:35:00",
    "event_end": "2023-06-29T12:30:00",
    "event_type": "Développement",
    "format": "Conférence",
    "venue": "Amphi A",
    "venue_id": "1",
    "speakers": "Maxime Odye, Clement Traon",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Spring et son ecosystème ne cesse d'évoluer, facilitant de plus en plus la vie des développeurs. \r\n\r\n⚠️ Un problème subsiste avec toutes ces nouvelles abstractions, quand ca fonctionne pas, c'est toujours la faute à la \"magie\" de Spring.\r\n\r\nSpring Core, sorti en 2003, est la brique qui propose et implémente la plupart des mécanismes faisant opérer “la magie”. Injection de dépendances, programmation par aspect, proxification, configuration, autant de concepts présents dans tous les produits Spring, que nous vous proposons de démystifier !\r\n\r\nRemettons les mains dans le cambouis et soulevons le capot de ce fabuleux framework.\r\n\r\n“La magie” de Spring sera bientôt une expression révolue pour vous 😉"
  },
  {
    "id": "478771",
    "name": "Git, sous le capot",
    "event_start": "2023-06-30T11:35:00",
    "event_end": "2023-06-30T12:30:00",
    "event_type": "Développement",
    "format": "Conférence",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "David Blanchet",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Vous a-t-on déjà sorti cette phrase :\r\n\r\n      \"Git is smart on the outside, and quite dumb on the inside.\"\r\n\r\n?\r\n\r\nÇa fait des semaines, des mois, voire des années que vous utilisez Git. C'est comme conduire une voiture, c'est devenu machinal. les commandes s'enchaînent, ça fait le boulot, pas besoin de savoir comment ça marche à l'intérieur pour s'en servir.\r\n\r\nEt c'est bien dommage, car les fondements de Git sont beaucoup plus simples qu'il n'y paraît. Au point qu'on peut facilement les exposer et même les implémenter !\r\n\r\nDans ce talk, je vous propose de regarder sous le capot de cette belle machine et de voir comment elle fonctionne, d'abord parce que c'est cool, et ensuite parce que bien comprendre vos outils, c'est aussi mieux les exploiter."
  },
  {
    "id": "478807",
    "name": "Doc-tracing : fouiller une base de code fossile grâce au traçage d'exécution",
    "event_start": "2023-06-29T12:45:00",
    "event_end": "2023-06-29T13:00:00",
    "event_type": "Architecture",
    "format": "Quicky",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Luc Sorel-Giffo",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Vous est-il déjà arrivé d'arriver sur un projet préhistorique et de vous sentir démuni·e en fouillant la base de code pour comprendre son organisation et la façon dont les fonctionnalités sont implémentées ? Malgré la doc générée, vous vous perdez sur la route du clic et dans les onglets de votre IDE 😬.\r\n\r\nDes outils de doc-tracing permettent de tracer l'exécution du code et de la documenter le diplodoc-as-codus : diagramme de séquence, diagramme des composants mobilisés par exemple.\r\n\r\nÀ travers différentes démos, je vous présenterai comment l'outil pydoctrace utilise les hooks de l'interpréteur Python pour générer ces diagrammes en apposant un simple décorateur (similaire à une annotation des langages JVM) sur une fonction ou un test fonctionnel.\r\n\r\nPlan :\r\n- utilité et exemples de doc-as-code\r\n- mécanismes de traçage d’exécution de code Python\r\n- partage de résultats de doc-tracing sur des tests de cas droits et d’erreurs\r\n"
  },
  {
    "id": "478809",
    "name": "Hook'il est beau, notre code ! Guider la qualité de code avec pre-commit",
    "event_start": "2023-06-30T16:00:00",
    "event_end": "2023-06-30T16:25:00",
    "event_type": "Méthodologie",
    "format": "Tool in action",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Luc Sorel-Giffo",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Votre équipe s'est accordée sur des règles de qualité de la base de code :\r\n- formatage\r\n- bonnes pratiques\r\n- patterns ou anti-patterns, etc.\r\n\r\nVous y prêtez attention (ou vos collègues vous les rappellent *trop* souvent… 😏) lors des relectures de code, qui devraient plutôt se focaliser sur le métier.\r\n\r\nEt si on utilisait les hooks git pour appliquer ces règles automatiquement pour une plus grande efficacité d'équipe, du commit à l'intégration continue ? Pas besoin de réinventer la roue : l'outil pre-commit est là [1], avec un écosystème de plugins très fourni [2].\r\n\r\nDurant cette intervention orientée *démos*, je vous présenterai cet outil sur des exemples concrets d’applications. Pre-commit s’interface avec les outils de qualité de code d’une grande diversité de projets : Python, mais aussi Java, Node.js, rust, go, PHP, infra-as-code, la détection de secrets ou de fichiers volumineux avant de commiter, etc.\r\n\r\nUn vrai guide pour la qualité de la base de code !\r\n\r\n[1] : https://pre-commit.com/\r\n[2] : https://pre-commit.com/hooks.html\r\n\r\nLe plan s'articule selon 3 objectifs :\r\n- intro succincte sur la qualité de code : pratiques (TDD, revue de code) et outils (formateurs de code, linters)\r\n- technique : découverte des hooks git\r\n- opérationnels : mise en pratique de pre-commit et de différents hooks (hooks natifs de validations, hooks vers des outils tiers de formatage et de lint) et dans différents contextes (poste de développement, intégration continue) pour que vous ayez tous les éléments nécessaires à sa mise en œuvre sur vos projets."
  },
  {
    "id": "478817",
    "name": "Construire un registre de choix d'architecture avec les ADR",
    "event_start": "2023-06-29T17:05:00",
    "event_end": "2023-06-29T17:30:00",
    "event_type": "Architecture",
    "format": "Tool in action",
    "venue": "Amphi A",
    "venue_id": "1",
    "speakers": "Sébastien Lecacheur",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Pourquoi et comment tracer vos choix d'architecture ?\r\n\r\nVenez découvrir une méthode pour tracer vos choix d'architecture de plus en plus populaire, qui nous fait gagner énormément de temps et qui augmente la connaissance des équipes. Cette méthode, utilisant les **ADR (Architecture Decision Record)**, met en avant la simplicité : *Keep It Simple, Stupid* !\r\n\r\nAu travers d'un retour d'expérience de plusieurs années, nous verrons donc comment documenter le plus simplement possible un choix d'architecture ou de conception tout en gardant une trace du contexte, des options et des compromis qui ont menés à cette décision.\r\n\r\nCette session sera également l'occasion de revenir sur la mise en pratique à l'échelle de l'entreprise."
  },
  {
    "id": "478963",
    "name": "Gitlab de A à Z ! Car il n'y a pas que le C et le I ...",
    "event_start": "2023-06-28T13:30:00",
    "event_end": "2023-06-28T15:30:00",
    "event_type": "Autre...",
    "format": "Université",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Matthieu Vincent, Anthony Dassé",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Gitlab, dans toutes ses versions, propose de nombreuses fonctionnalités pour mener à bien un projet de bout en bout et pas uniquement de l'hébergement de code source et de la CI.\r\n\r\nDans cette université, nous proposons de découvrir l'ensemble des fonctionnalités gratuites :\r\n\r\n- Gestion du projet\r\n- Issues\r\n- Sécurité\r\n- Configuration (branches, ...)\r\n- Développement\r\n- Source\r\n- CI (Code quality / Test / SAST analyzer)\r\n- Artefact / Registry\r\n- Merge request / Processus de review\r\n- Release\r\n- Déploiement\r\n- Environnements\r\n- Déploiement sur une plateforme cible\r\n- Pages\r\n\r\nEn sortant de cette université, les participants auront une vision globale des possibilités proposées par l'outil dans sa version gratuite."
  },
  {
    "id": "478966",
    "name": "Rendu 3D, la grande illusion expliquée",
    "event_start": "2023-06-30T13:05:00",
    "event_end": "2023-06-30T13:20:00",
    "event_type": "Autre...",
    "format": "Quicky",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Thomas Guibert",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Dans les jeux vidéo, le cinéma, l’industrie, la médecine ou encore l’urbanisme, la 3D est partout. Nous l’utilisons aujourd’hui pour nous divertir, apprendre, simuler les prochaines catastrophes ou encore le fonctionnement de la voiture du futur. Demain, nous l’utiliserons pour explorer de nouvelles façons de communiquer, de construire et de créer. Mais comment fonctionne ce rendu 3D qui donne vie à ces univers virtuels ? Quel lien y-a-t- il entre notre vision et notre carte graphique ? Sur un écran, qui n’est qu’une grille de pixels, la 3D existe-t-elle vraiment ? Pour répondre à ces questions, nous allons voir les différentes étapes nécessaires qu’un ordinateur doit accomplir pour tromper notre cerveau. Grâce à une explication pas à pas, nous pourrons comprendre le fonctionnement de cette grande illusion."
  },
  {
    "id": "479000",
    "name": "HTTP/3 on va manger du quick ! 🍟",
    "event_start": "2023-06-30T10:30:00",
    "event_end": "2023-06-30T11:25:00",
    "event_type": "Web",
    "format": "Conférence",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Julien Namdar, Prieur Baptiste",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Publiée en 2022 dans la RFC 9114, la norme HTTP/3 arrive pour supplanter ses ainés HTTP/1 et HTTP/2. Mais au fait, pourquoi avions-nous besoin d'une nouvelle norme ? Qu’est ce que ça va changer dans nos applications ?  Allons-nous devenir encore plus dépendant des GAFAM (les principaux contributeurs) ? Et surtout… Comment garder la frite ? Pour répondre à ces questions voici le menu :\r\n\r\n- Un long Beacon 🍔 accompagné d'une analyse des nouvelles technologies employées (notamment le protocole QUIC 😊)\r\n- Des chicken Wheels 🥠 avec en sauce un état actuel d'implémentation par les principaux acteurs du marché (clients, serveurs)\r\n- Un dessert mix maison 🍦nappé d'une démonstration sur une plateforme de comparaison entre HTTP/1, 2 et 3 (tableaux de bord Grafana, captures Wireshark...)."
  },
  {
    "id": "479428",
    "name": "Ca y est, j'ai cassé la prod !",
    "event_start": "2023-06-29T11:35:00",
    "event_end": "2023-06-29T12:30:00",
    "event_type": "Méthodologie",
    "format": "Conférence",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Sofia Lescano",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Sur le point de finir ma première année dans mon entreprise, j'ai provoqué pas un mais deux incidents en production en une heure ! Malgré le moment de tension, cela a été une énorme source d'apprentissage. Personne a couru les bras en l'air en criant les uns sur les autres ni s'est mit à chercher des coupables. À l'inverse une équipe soudée et qui s'entraide a réétabli la prod au plus vite en reconnaissant collectivement l'erreur commise.\r\n\r\nComment arrive-t-on à gérer un incident en production en toute tranquilité ?\r\n\r\nun processus de qualité en amont (revue de code, un environnement de sandbox, une revue fonctionnelle)\r\nun processus de détection et déclaration des incidents\r\nun responsable de gestion des incidents et des responsables par équipes\r\nun post-mortem et des action concrètes pour éviter la reproduction de l'incident\r\nDans cette conférence je vous expliquerai comment réduire et amériliorer la gestion de vos incidents et vous repartirez avec les clés pour appliquer cela dans vos équipes.\r\n\r\n"
  },
  {
    "id": "480097",
    "name": "Débloquez le potentiel des architectures composables !",
    "event_start": "2023-06-28T10:00:00",
    "event_end": "2023-06-28T10:55:00",
    "event_type": "Architecture",
    "format": "Conférence",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Loïc Carbonne",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Depuis deux ans, les rapports sur les technologies émergentes montrent une forte évolution des architectures composables.\r\n\r\nUne architecture composable est constitué d’un ensemble de briques réutilisables. Ces briques peuvent être développées sur mesure avec du code, low-code ou no-code, ou encore construite avec des briques SaaS sur-étagère, sélectionnées parmi les meilleures du marché.\r\n\r\nOpposé à l’architecture monolithique et repoussant les limites de l’architecture micro-service, le composable permet de gagner en agilité, en rapidité d’implémentation tout en améliorant l’expérience utilisateur grâce à une forte modularité.\r\n\r\nAu cours de ce talk, découvrez les fondations et principes du composable, mais surtout comment en tirer des bénéfices lors de son implémentation"
  },
  {
    "id": "480303",
    "name": "Comment automatiser ses tests d'accessibilité ?",
    "event_start": "2023-06-30T13:30:00",
    "event_end": "2023-06-30T14:25:00",
    "event_type": "Web",
    "format": "Conférence",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Anthony Le Goas",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Les tests d'accessibilités web : on en voit trop peu dans nos chaînes de CI/CD et pourtant, il est possible de faire pas mal de choses ! Les outils et techniques pour automatiser des tests d'accessibilité sont multiples mais relativement méconnus des développeurs web. Que pouvons-nous tester, et comment ? Etudions tout cela ensemble, regardons comment intégrer ces tests dans nos pipelines (Gitlab CI, GitHub Actions, ...)."
  },
  {
    "id": "480306",
    "name": "Sous le capot des navigateurs web",
    "event_start": "2023-06-29T11:35:00",
    "event_end": "2023-06-29T12:30:00",
    "event_type": "Web",
    "format": "Conférence",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Anthony Le Goas",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Hey ! Dis moi, tu sais comment ça fonctionne un navigateur web toi ? Le moteur de rendu, concrètement, il fait quoi ? Ça doit être sacrément compliqué de tout dessiner à l'écran non ? Allez, regardons ça ensemble !"
  },
  {
    "id": "480954",
    "name": "REX IndieHacker = Image-Charts 100M req/mois, 3 continents, 3 K8S, latence <150ms, succès et échecs",
    "event_start": "2023-06-30T13:05:00",
    "event_end": "2023-06-30T13:20:00",
    "event_type": "Architecture",
    "format": "Quicky",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Francois-Guillaume Ribreau",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "🧢 \"Préparez-vous à plonger dans l'aventure passionnante du Indiehacking (independant hacker) et du SaaS Image-Charts.com !\r\n\r\nEnsemble, nous explorerons comment, optimiser une infrastructure sur Google Cloud Platform (GCP) avec 3 clusters Kubernetes répartis sur 3 continents (Europe, Asie et Amérique du Nord) pour la performance, la résilience et la réduction des coûts (FinOps) et qui doit traiter plus de 100 millions de requêtes par mois.\r\n\r\nVous serez surpris d'apprendre les stratégies de FinOps ingénieuses employées pour minimiser les coûts d'exploitation, que ce soit concernant GCP ou Cloudflare.\r\n\r\nVous découvrirez les difficultés rencontrées lors de la configuration de Cloudflare qui a causé un problème de routage ubuesque et ses coûts associés.\r\n\r\nJe vous dévoilerai également comment j'ai réussi à réduire mes coûts de stockage GCP Cloud Storage d'un facteur 20, ainsi que les erreurs que j'ai commises lors de la mise en place de l'autoscaling Kubernetes en multi-region et l'usage du podantiaffinity et son impact sur les coûts notamment.\r\n\r\nRejoignez-moi pour cette conférence palpitante et instructive, où vous découvrirez les hauts et les bas du parcours d'un IndieHacker dont l'objectif est d'optimiser les coûts et la performance d'un SaaS à grande échelle. Ensemble, nous apprendrons de ces expériences pour mieux préparer et optimiser vos propres projets technologiques.\"\r\n\r\n— ChatGPT 😘"
  },
  {
    "id": "481186",
    "name": "LOOM, la météorite sur la JVM ?",
    "event_start": "2023-06-29T14:35:00",
    "event_end": "2023-06-29T15:30:00",
    "event_type": "Architecture",
    "format": "Conférence",
    "venue": "Amphi A",
    "venue_id": "1",
    "speakers": "Thomas Piscitelli, Alexandre Thomazo",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Partez avec nous à la découverte de la prochaine révolution de la JVM : les virtual threads\r\n\r\nDepuis la préhistoire, le partage des ressources d'un CPU a toujours été un problème de nombreuses fois revisité.\r\nCe problème s'intensifie à l'ère des microservices où les appels API pullulent, la ressource se rarifiant d'autant plus vite, les temps d'attente s'allongeant...\r\nDans ce monde impitoyable, où règne la loi du plus fort, de drôles de bestioles ont tenté d'émerger afin de pallier à ce problème : Threads et ses pools, Event loop, Reactive.\r\nMais une ombre plane depuis la sortie de Java 19 : la météorite LOOM est annoncée et elle va bouleverser tout cet ecosystème...\r\n\r\nDans cette conférence accessible, nous reviendrons sur les stratégies existantes de partage des ressources et leurs implémentations au sein de la JVM ou de l'écosystème Java.\r\nNous décortiquerons ensuite le principe de virtual thread et son implémentation dans la JVM notamment à l'aide de démos."
  },
  {
    "id": "481269",
    "name": "Sobriété numérique partout, sobriété numérique nulle part ?",
    "event_start": "2023-06-28T14:30:00",
    "event_end": "2023-06-28T15:25:00",
    "event_type": "Green",
    "format": "Conférence",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Olivier Philippot",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "La sobriété numérique est-il devenu le nouveau buzzword du monde informatique ? Tout le monde s'y intéresse, certains la critique mais est-ce que beaucoup en font réellement ?\r\nLa réalité est que les mises en pratique ne sont pas au niveau du challenge de la réduction de l'impact environnemental du numérique. Outils pas assez nombreux, focus uniquement sur le code, changements organisationnels complexes... autant de raisons pour qu'une démarche de sobriété numérique échoue.\r\nMais cette démarche peut être concluante, sous-certaines conditions.\r\nNous présenterons dans cette session l'impact du numérique de la fabrication aux usages ainsi que des cas concrets de démarche qui commencent à porter leurs fruits"
  },
  {
    "id": "481291",
    "name": "Pair-programming : et si on gagnait du temps ?",
    "event_start": "2023-06-29T17:35:00",
    "event_end": "2023-06-29T18:00:00",
    "event_type": "Méthodologie",
    "format": "Tool in action",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Pascal Le Merrer",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "L'inconvénient d'être un dinosaure, c'est que plus de 20 ans après avoir \r\ncommencé à pratiquer le pair programming, j'entends encore parfois des remarques de développeurs sceptiques, telles que : \"Seul, je serais plus efficace\".\r\n\r\nNous verrons :\r\n* pourquoi c'est faux la plupart du temps ;\r\n* quels bénéfices une équipe peut tirer du pair programming, quand elle connait les pratiques pour le rendre efficace ;\r\n* quelle valeur vous pouvez apporter à vos collègues avec cette technique.\r\n\r\nAllergène possible : ce talk contient des retours d'expérience."
  },
  {
    "id": "481485",
    "name": "Adoptez la clean archigonale",
    "event_start": "2023-06-28T13:30:00",
    "event_end": "2023-06-28T14:25:00",
    "event_type": "Architecture",
    "format": "Conférence",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Christophe Breheret-Girardin",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "\"L'architecture est vraiment importante. Les choses qui sont difficiles à changer sont l'architecture initiale, la culture et les compétences de l'équipe. C'est pourquoi il est important de bien faire les choses dès le départ.\" - Martin Fowler  \r\n\r\nAprès une période de balbutiement où nous codions comme nous pouvions, nous avons cru, après les années 2000, avoir trouvé l'architecture idéale : un découpage en couches, où chacune aurait une responsabilité dédiée.  \r\nIdée séduisante sur le papier, mise en oeuvre efficace... au départ.  \r\nDes années après, tout un tas de problèmes a fait surface lors de la maintenance et de l'évolutivité du logiciel, surtout avec l'abondance et le cycle de vie des frameworks.  \r\n\r\nAfin de pallier ces problèmes, des architectures ont émergé, dont l’architecture Hexagonale et la Clean architecture.  \r\n\r\nMais qu'apportent-elles réellement ?  \r\nQue veut dire \"clean/propre\" au sujet d'une architecture ?  \r\nQuelles sont leurs périmètres d'action ?  \r\nEst-ce juste du marketing ou une véritable plus-value ?  \r\nSont-elles équivalentes avec un nommage différent ?  \r\nEnfin... sont-elles la réponse unique à tous les problèmes ?  "
  },
  {
    "id": "481640",
    "name": "Fini JUnit park, on embarque pour KoTest Island !",
    "event_start": "2023-06-29T17:35:00",
    "event_end": "2023-06-29T18:00:00",
    "event_type": "Développement",
    "format": "Tool in action",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Brieuc Le Faucheur",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Quand on parle de tests unitaires ou tests d'intégration d'une app Kotlin/JVM, on parle implicitement de JUnit, mais il existe des alternatives utilisant mieux la puissance de kotlin. Durant cette présentation, je vous propose de m'accompagner dans la réécriture de tests JUnit d'une application Spring avec KoTest et découvrir quelques fonctionnalités disponibles dans ce framework modulaire : style, configuration, assertions."
  },
  {
    "id": "481868",
    "name": "Dans le Monorepo vous n'êtes jamais seul, le Park est ouvert... 🦖🦕🐢",
    "event_start": "2023-06-30T10:30:00",
    "event_end": "2023-06-30T11:25:00",
    "event_type": "Architecture",
    "format": "Conférence",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Francois Nollen, Julien Buret",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Quand un projet grossit et que les équipes se multiplient, naturellement on organise des dépôts Git pour chaque composant ou équipe. Chacun chez soi, les dinosaures seront bien gardés 🦕🐊🦤🐢🦎.\r\n \r\nPopularisée par Google, Microsoft, Facebook ou Twitter, l'approche Monorepo propose au contraire un unique dépôt pour tous les applicatifs. Vous pensez qu'un Monorepo c'est juste pour aller vite sur un petit projet ? Que c'est folie à grande échelle ? Que ça signifie couplage et architecture Monolithique (voire Paléolithique) ?\r\n \r\nImaginez qu'on a rassemblé 300 dev Mobile, Web, Backend et Infra-as-code dans un même repository 🤯. Et ça marche ! Vous voulez savoir comment ?\r\n \r\nDans ce \"ptit-REX\" 🦖 vous découvrirez :\r\n- Les différences fondamentales entre Multirepos et Monorepo,\r\n- Les défis d'un Monorepo côté build (Gradle) et intégration continue (Gitlab, Terraform, AWS), comment les surmonter,\r\n- Les pratiques Open Source (Merge Requests, Code Reviews) qui améliorent la collaboration et répondent aux enjeux de qualité avec un rythme de développement soutenu à grande échelle,\r\n- Comment un Monorepo a permis d'accélérer nos développements, vers le Continuous Delivery.\r\n \r\nBienvenue dans le Park du Monorepo 🏞️ 🤠.\r\nDécouvrez un monde différent, séduisant et parfois dangereux.\r\nDans le Monorepo vous n'êtes jamais seul(e).\r\nMais soyez rassuré(e), ça se termine bien 🍿."
  },
  {
    "id": "482212",
    "name": "Vers l'infini et au delà avec Postman",
    "event_start": "2023-06-30T10:30:00",
    "event_end": "2023-06-30T11:25:00",
    "event_type": "Web",
    "format": "Conférence",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Alan Duchene",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Les APIs web sont devenues un élément central dans le monde du développement. Cependant, pour interagir avec celles-ci, il est souvent nécessaire d'utiliser des outils complexes qui peuvent ralentir le processus de développement.\r\n\r\nC'est là que Postman entre en jeu. C'est un outil puissant et intuitif qui permet aux utilisateurs de tester et débugger des APIs de manière efficace. Il se peut que tu aies déjà utilisé Postman. Mais est-ce que tu sais jusqu'où tu peux aller avec cet outil ? 🧑‍🚀🚀\r\n\r\nDans ce talk, par le biais de démonstrations, nous explorerons les bases de Postman et les concepts avancés qui te permettront de maximiser ton utilisation de cet outil. Nous aborderons également l'incorporation de Postman dans une chaîne d'intégration continue, afin de t'aider à améliorer la qualité de tes développements."
  },
  {
    "id": "482338",
    "name": "Féminisation de la tech : cassons les codes !",
    "event_start": "2023-06-28T10:00:00",
    "event_end": "2023-06-28T12:00:00",
    "event_type": "Autre...",
    "format": "Université",
    "venue": "Amphi A",
    "venue_id": "1",
    "speakers": "Mélissa Cottin, Stéphanie Vachon, Philippe Lima",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Le constat est assez simple : les métiers du numérique et de l'informatique recrutent, les besoins en compétences ne cessent de grandir, les opportunités d’emplois sont aujourd'hui bien réelles. \r\n\r\nPourtant, les femmes restent encore sous-représentées dans ce secteur porteur : \r\n- 27 % de femmes travaillent aujourd’hui dans le numérique,\r\n- Seulement 15 % occupent des métiers techniques (développement, production, infrastructure),\r\n- 50 % des femmes employées dans l’IT quittent leur poste avant même d’avoir 35 ans\r\n\r\nMalgré les efforts engagés pour féminiser la filière, les effets tardent à se faire ressentir et les chiffres n’évoluent pas assez rapidement, voire reculent. Autocensure, stéréotypes, image du geek, méconnaissance du secteur ou sexisme ordinaire, culture d'entreprise non inclusive, inégalités salariales, les freins sont encore bien présents.\r\n\r\nComment rendre la filière attractive pour les femmes ? Comment s'engager individuellement ? Par où commencer ?\r\n\r\nL'association ESTIMnumérique vous propose de questionner vos propres pratiques professionnelles, identifier les biais inconscients, partager des anecdotes/expériences et trouver collectivement des solutions concrètes en faveur de la mixité.\r\n\r\nUn atelier pratique basé sur des faits réels."
  },
  {
    "id": "482345",
    "name": "Suscitons des vocations dès le collège !",
    "event_start": "2023-06-29T13:05:00",
    "event_end": "2023-06-29T13:20:00",
    "event_type": "Autre...",
    "format": "Quicky",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Mélissa Cottin",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "L'évolution des pratiques numériques impacte l’ensemble des secteurs, des métiers et des compétences associées. \r\n\r\nAujourd’hui, la nécessité d'orienter et de former les jeunes s'impose plus que jamais pour accompagner la transition numérique de la société et de l'économie et agir face au déficit de compétences numériques. \r\n\r\nFace à ce constat, plusieurs organisations de l’écosystème numérique se mobilisent pour lancer la Semaine du numérique et des sciences informatiques : un rendez-vous national dédié à la promotion des débouchés possibles dans le numérique et l'informatique auprès des jeunes.\r\n\r\nElle se décline en actions locales gratuites organisées par l’écosystème numérique, afin de valoriser les métiers et les formations auprès des jeunes (du collège au lycée), afin les aider dans leur choix d'orientation  scolaire.\r\n\r\nLa première édition aura lieu du 04 au 09 décembre 2023 sur l'ensemble du territoire : France Métropolitaine et DROM-COM.\r\n\r\n Vous souhaitez contribuer à l’attractivité de la filière ? Envie de partager votre métier et votre quotidien ? Et pourquoi pas susciter des vocations ? Rejoignez la mobilisation !\r\n\r\nDécouvrez la Semaine du numérique et des sciences informatiques et les modalités de participation."
  },
  {
    "id": "482428",
    "name": "La recette ultiiiime pour foirer votre time-to-market 👌",
    "event_start": "2023-06-30T11:35:00",
    "event_end": "2023-06-30T12:30:00",
    "event_type": "Méthodologie",
    "format": "Conférence",
    "venue": "Amphi D",
    "venue_id": "4",
    "speakers": "Francois-Guillaume Ribreau",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "👋  Prenons quelques minutes pour nous détendre et rire un bon coup ! \r\n\r\nNous allons parler de l'infantilisation des devs, DevOps, FinOps, DevSecOps, cycle-time, lead-time, QA teams, GitOps, time-to-market à 2 mois voir au trimestre, gestion des incidents en prod, management, gestion de l'environnement, externalisation de l'infra, et bien plus encore ! 🤯\r\n\r\nSuivez ces e^12 étapes pour être sûr de ne jamais livrer quoi que ce soit en production, et encore moins de manière fiable.\r\n\r\nCette recette est 100% garantie, basée sur des cas réels observés et corrigés — quand c'était politiquement possible 🤫😓 — auprès de startups, scale-ups, grands groupes et services publics."
  },
  {
    "id": "482663",
    "name": "Interopérabilité Java / Code natif avec le projet Panama",
    "event_start": "2023-06-29T12:45:00",
    "event_end": "2023-06-29T13:00:00",
    "event_type": "Développement",
    "format": "Quicky",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Laurent Huet",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Le projet Panama facilite l'interopérabilité avec des librairies natives sans nécessiter de connaissances en C++ comme JNI. En preview dans le JDK 19, cette API s'annonce très intéressante pour ouvrir vos applications aux librairies tierces (C/C++, Rust, ...).\r\nL'objet de ce quickie est de montrer rapidement comment utiliser une librairie native et de vous donner envie d'aller plus loin."
  },
  {
    "id": "482676",
    "name": "3P pour sortir du Legacy",
    "event_start": "2023-06-29T10:30:00",
    "event_end": "2023-06-29T11:25:00",
    "event_type": "Développement",
    "format": "Conférence",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Johan Martinsson",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "\r\nQuand on écrit des tests ou fait du refactoring en fin de story, qui récolte les bénéfices? Et quand? \r\n\r\nC'est la prochaine personne qui touchera le code ... d'ici quelque temps ... avec un peu de chance. Pourvu que les tests resteront pertinents. Et que le refactoring facilitera bien la nouvelle fonctionnalité, que l'on ne connait pas encore ... 🤔\r\n\r\nSi nos efforts sont premièrement pour les autres, dans un futur incertain et de valeur incertaine. Est-ce étonnant si on ne fait pas beaucoup et qu'on laisse pourrir nos logiciels?\r\n\r\nUne autre approche serait la méthode des 3P 🧐. C'est à dire pour chaque story\r\n\r\n* Protéger\r\n* Préparer\r\n* Produire\r\n\r\nProtéger: Mise en place des tests manquants\r\n\r\nPréparer: Refactoring en profondeur pour rendre plus facile la nouvelle fonctionnalité\r\n\r\nProduire: Coder la nouvelle fonctionnalité en TDD\r\n\r\nÊtre les premiers bénéficiaires des tests et du refactoring que nous faisons, c'est plus de bonheur au travail. Avec un ROI bien meilleur sur les tests et le refactoring, le projet risque de mieux se porter dans le temps. Et pour les adeptes du TDD cela vous permettra de faire du TDD quelque soit la qualité du code.\r\n\r\nRegardons quelques exemples en code pour clarifier ce concept"
  },
  {
    "id": "482768",
    "name": "SvelteKit à l'attaque des dinosaures",
    "event_start": "2023-06-28T10:00:00",
    "event_end": "2023-06-28T12:00:00",
    "event_type": "Web",
    "format": "Université",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Maxime Dupont",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "10 minutes de théorie, 100 minutes de pratique pour mettre en place, développer et déployer une application SvelteKit depuis zéro.\r\n\r\nSvelte est un framework pour créer des applications légères et robustes tout en mettant en avant les bonnes pratiques (utilisation du javascript, accessibilité, etc.) dès la compilation !\r\n\r\nPrérequis : un pc avec git, et node"
  },
  {
    "id": "482791",
    "name": "sécurité + open source = ❤️",
    "event_start": "2023-06-30T12:45:00",
    "event_end": "2023-06-30T13:00:00",
    "event_type": "Autre...",
    "format": "Quicky",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Adrien Pessu",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Pour beaucoup de développeurs , l'open source ce sont des frameworks ou des librairies qui apportent des fonctionnalités. On parle peu de l'open source dans la sécurité et quand on en parle c'est pour dire qu'il y a des vulnérabilités. \r\nMais dans le domaine de la sécurité, l'open source fait partie intégrante de la blue team comme de la red team. \r\nDans cette présentation, je vais vous présenter les grandes initiatives open source orientées sécurité pour vous aider à sécuriser vos développements. De l'Open source security foundation à L'OWASP en passant par MITRE et pleins d'autres. "
  },
  {
    "id": "482806",
    "name": "Zod/ArkType, Comment typer vos applications JS au runtime ?",
    "event_start": "2023-06-29T13:05:00",
    "event_end": "2023-06-29T13:20:00",
    "event_type": "Web",
    "format": "Quicky",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Gregory Houllier",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "TypeScript permet de valider statiquement votre code, mais comment garder cette sécurité au runtime?\r\nDurant ce quicky nous verrons comment les outils comme Zod et ArkType peuvent nous aider à garantir la type safety de nos applications."
  },
  {
    "id": "482856",
    "name": "Discutons avec nos cartes bancaires depuis nos smartphones",
    "event_start": "2023-06-29T17:05:00",
    "event_end": "2023-06-29T17:30:00",
    "event_type": "Mobile",
    "format": "Tool in action",
    "venue": "Amphi B",
    "venue_id": "2",
    "speakers": "Antoine Robiez, Loïc Fallon",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Les terminaux de paiement, on connait.\r\nPour payer, le commerçant programme un montant, on passe sa carte, un BIP retentit et... la transaction est validée.\r\n\r\nMais comment le terminal de paiement connait-il votre compte en banque ? Lui, ne le connait pas. C'est votre carte qui donne certaines informations quand lui on lui demande.\r\n\r\nMais saviez-vous que votre carte attend aussi des informations avant de vous donner les siennes ? Qu'un protocole de paiement  sans contact existe ? Et encore mieux : étant basé le NFC - le même qui équipe tous nos smartphones aujourd'hui - saviez-vous que vous pouvez lire et donner des infos à votre carte bancaire depuis votre smartphone ?\r\n\r\nÀ travers un cas concret, nous verrons comment écrire une petite application Android qui lit le numéro d'une carte bancaire."
  },
  {
    "id": "482872",
    "name": "ecoCode : comment réduire l'empreinte carbone de vos projets en utilisant des outils open-source",
    "event_start": "2023-06-30T14:35:00",
    "event_end": "2023-06-30T15:30:00",
    "event_type": "Green",
    "format": "Conférence",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "David De Carvalho, Johanna Duigou",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "L'empreinte carbone des services numériques est en constante augmentation, ce qui entraîne des conséquences négatives sur notre environnement. Dans cette conférence, nous explorerons ecoCode, un projet open-source qui vise à réduire l'empreinte carbone des projets de développement en proposant des outils et des pratiques durables. Nous présenterons l’étendu de cet écosystème de plugins mobiles et web multilangages SonarQube et vous montrerons comment les utiliser pour mesurer l'empreinte carbone de votre code et réduire votre impact environnemental. Pour comprendre la mise en place et l’emploi des plugins ecoCode android (mobile) et Python (web) : rien de tel qu’un live coding !"
  },
  {
    "id": "482979",
    "name": "Spring et Virtual Threads : est-il possible d'optimiser les performances de votre application?",
    "event_start": "2023-06-29T13:05:00",
    "event_end": "2023-06-29T13:20:00",
    "event_type": "Développement",
    "format": "Quicky",
    "venue": "Amphi C",
    "venue_id": "3",
    "speakers": "Daria Hervieux",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Une nouvelle génération de threads appelée \"Virtual Threads\" a été introduite en aperçu dans JDK19. Cette fonctionnalité va définitivement faire partie de JDK21.\r\nLa promesse d’amélioration des performances  des applications utilisant Virtual Threads est une réalité. Est-ce que Spring, l'un des frameworks de développement d'applications Java les plus matures, nous permet d’en profiter ?\r\nNous allons explorer dans cette conférence comment les Virtual Threads fonctionnent et comment et dans quel contexte nous pouvons les utiliser avec Spring. Nous aborderons également des cas d'utilisation réels de Virtual Threads dans des projets Spring, avec des résultats de benchmarks concrets."
  },
  {
    "id": "482983",
    "name": "Comprendre eBPF, ses applications et ses limites",
    "event_start": "2023-06-30T13:30:00",
    "event_end": "2023-06-30T14:25:00",
    "event_type": "Autre...",
    "format": "Conférence",
    "venue": "Amphi A",
    "venue_id": "1",
    "speakers": "Paul Chaignon",
    "video_url": null,
    "files_url": null,
    "slides_url": null,
    "description": "Il n'est plus rare aujourd'hui t'entendre parler d'eBPF en conférence. Tantôt présenté comme LA solution monitoring pour Linux, tantôt mentionné dans un contexte DevOps ou sécurité, le terme et ce qu'il représente restent obscur pour beaucoup, l'acronyme n'aidant pas.\r\n\r\nDans cette présentation, nous repartirons des bases, un syscall Linux, pour expliquer ce qu'est concrètement eBPF, comment ça fonctionne dans les grandes lignes et ce que ça permet de faire.\r\nNous en profiterons pour aborder quelques fausses idées sur sa sécurité, ses limites et ses origines.\r\nLes principaux cas d'usages connus aujourd'hui permettront d'illustrer ce qu'eBPF permet ET ne permet pas de faire."
  }
]
