[
  {
    "id": 810,
    "lastname": "Ogloblinsky",
    "firstname": "Vincent",
    "company": "SII",
    "bio": "Architecte logiciel frontend au sein d'une ESN rennaise, j'évolue entre architecture de projets web, formations, animations techniques, support client et expertise technique. \nPassionné par le \"grand\" domaine du développement web frontend, j'affectionne particulièrement coder en (Type||Java)script, débugger HTML5, découvrir la capacité grandissante du navigateur à se rapprocher des capteurs (GPS, bluetooth, etc...), et participer à des projets open-source.",
    "twitter": "vogloblinsky",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/1847781003/Rothko3_copy_400x400.jpg",
    "language": "fr",
    "shortName": "V. Ogloblinsky"
  },
  {
    "id": 124,
    "lastname": "Bossard",
    "firstname": "Cécilia",
    "company": "CHU Nantes",
    "bio": "Développeuse, agiliste, boîte à outils, ... Je fais partie de l'équipe du laboratoire hôpital numérique du CHU Nantes. Notre but : améliorer la prise en charge des patients pour le futur hôpital.",
    "twitter": "ceciliaBossard",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/2212897799/cecilia_400x400.png",
    "language": "fr",
    "shortName": "C. Bossard"
  },
  {
    "id": 2,
    "lastname": "De Loof",
    "firstname": "Nicolas",
    "company": "CloudBees",
    "bio": "Hacker & DockerCaptain",
    "twitter": "ndeloof",
    "imageProfilURL": "https://lh5.googleusercontent.com/-Z9ZMAVrEX2U/AAAAAAAAAAI/AAAAAAAAIyI/4cOiiXrmDzQ/photo.jpg?sz=360",
    "language": "fr",
    "shortName": "N. De Loof"
  },
  {
    "id": 818,
    "lastname": "SIBER",
    "firstname": "Eric",
    "company": "Indépendant",
    "bio": "Dans le monde du développement depuis plus de 12 ans, actuellement :\n- Agile Java Craftsman & Creative Ecosystem Organizer en tant qu'indépendant\n- Formateur Java pour le réseau de fabriques Simplon, grande école du numérique, sur un dispositif de reconversion professionnelle\n- Runner et Papa 2.0\n\nPrécédemment pour Novedia (en plus de ma casquette de développeur) : Consultant Manager, responsable Expertise IT, Creative Ecosytem Architect.\n\nAncien membre actif, modérateur, rédacteur et responsable bénévole Java sur Developpez.com pendant 4 ans.\n\nMembre de l'équipe d'organisation conférence Agile France 2013.",
    "twitter": "https://twitter.com/esiber",
    "imageProfilURL": "https://eric.siber.fr/content/images/2016/10/RetraitDossardOCC2016Zoom.png",
    "language": "fr",
    "shortName": "E. SIBER"
  },
  {
    "id": 852,
    "lastname": "Mechling",
    "firstname": "Gautier",
    "company": "Baatch",
    "bio": "Il y a fort longtemps, Gautier rencontra Jeff Sutherland, un vieux monsieur, qui lui apprit à faire des avions en papier. Depuis, il est Scrum master certifié (enfin c'est ce qu'il croit)",
    "twitter": "http://twitter.com/Nilhcem",
    "imageProfilURL": "https://droidcon.at/img/people/GautierMechling.jpg",
    "language": "fr",
    "shortName": "G. Mechling"
  },
  {
    "id": 863,
    "lastname": "PAITRY",
    "firstname": "Fabien",
    "company": "Zenika",
    "bio": "Lead dev PHP / Symfony et Devops enthusiast",
    "twitter": "https://twitter.com/FabienPaitry",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/663477469987659776/Nh5KSiQP.jpg",
    "language": "fr",
    "shortName": "F. PAITRY"
  },
  {
    "id": 1522,
    "lastname": "Besson",
    "firstname": "Pierre",
    "company": "Ippon Technologies",
    "bio": "Développeur Java à Ippon Technologies, je participe depuis début 2016 au développement de JHipster. Particulièrement intéressé par les architectures distribuées, mes contributions au projet ont principalement porté sur les microservices (intégration de la stack Spring Cloud), le support de docker, le monitoring et plus récemment Kubernetes.",
    "twitter": "pibesson",
    "imageProfilURL": "https://avatars0.githubusercontent.com/u/513471?v=3&s=460",
    "language": "fr",
    "shortName": "P. Besson"
  },
  {
    "id": 872,
    "lastname": "Ono Dit Biot",
    "firstname": "Yoann",
    "company": "SYNHACK",
    "bio": "Co-fondateur et CTO de la société SYNHACK implantée à Rouen. Je suis consultant en sécurité informatique et pentester. Mon métier consiste pour résumer à trouver des failles dans les systèmes d'informations en utilisant les techniques d'attaques des hackers.",
    "twitter": "https://twitter.com/y0no",
    "imageProfilURL": "https://avatars1.githubusercontent.com/u/2242427?v=3&s=460",
    "language": "fr",
    "shortName": "Y. Ono Dit Biot"
  },
  {
    "id": 800,
    "lastname": "Sanglan-Charlier",
    "firstname": "Maxime",
    "company": "One Hundred Acorns",
    "bio": "Plus de 15 ans dans l'informatique et pas une ride (ou presque). Curieux de nature, je suis toujours à la recherche de tout ce qui peut nous rendre plus efficients en tant qu'individu, en équipe ou au sein d'une organisation.  Je co-organise la conférence [nCrafts](http://ncrafts.io) à Paris et suis co-fondateur du groupe [Software Crafts(wo)manship Nantes](http://www.meetup.com/fr-FR/nantes-software-crafts-wo-manship/).",
    "twitter": "@__MaxS__",
    "imageProfilURL": "http://www.brownbaglunch.fr/img/baggers/photo_maxime_s.jpg",
    "language": "fr",
    "shortName": "M. Sanglan-Charlier"
  },
  {
    "id": 46,
    "lastname": "Houllier",
    "firstname": "Grégory",
    "company": "ZetaPush",
    "bio": "Web Enthusiast, @RennesJS Co-Founder, JavaScript Addict",
    "twitter": "@ghoullier",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/789458717112672256/4UEXLXBL.jpg",
    "language": "fr",
    "shortName": "G. Houllier"
  },
  {
    "id": 889,
    "lastname": "Renaudin",
    "firstname": "Guillaume",
    "company": "SQLI",
    "bio": "11 ans d'expérience dans le service IT : stagiaire dev, dev, lead dev puis architecte Web&Cloud, le parcours tech classique !\nJe reste développeur par passion, de Java à Rust en essayant  C/C++, Groovy, Scala, Go, JS, Python ...\nGeek assumé, je vis la technologie en tant que dev mais aussi end user ...",
    "twitter": "https://twitter.com/rguillome",
    "imageProfilURL": "https://s.gravatar.com/avatar/c76ba02252a339b1e70bc56e4e3650b2?s=80",
    "language": "fr",
    "shortName": "G. Renaudin"
  },
  {
    "id": 911,
    "lastname": "LOURS",
    "firstname": "Guillaume",
    "company": "Saagie",
    "bio": "Developpeur Senior à Saagie, touchant aussi bien au backend qu'au front  \nCo-fondateur des conferences Lean Kanban France et Codeurs en Seine  \nRed Coat à Devoxx France",
    "twitter": "glours",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/717040748072448000/9wh_tuPy.jpg",
    "language": "fr",
    "shortName": "G. LOURS"
  },
  {
    "id": 71,
    "lastname": "Odye",
    "firstname": "Maxime",
    "company": "Zenika",
    "bio": "Maxime, consultant back-end chez Zenika Rennes.  Passionné techniquement, j'aime découvrir et re-découvrir les différentes technologies gravitant autour de l'écosystème Java.\nAmateur des différentes communautés (Jug, BreizhCamp, AgileTour), j'estime que le partage technique, et non technique, dans le secteur de l'Informatique est quelque chose d'extraordinaire. Découverte, progression et approfondissement, l'enrichissement personnel est grand et essentiel pour nous faire tous progresser.\nJe suis formateur ElasticSearch et ELK (ElasticSearch, Logstash, Kibana).",
    "twitter": "@MaxOdye",
    "imageProfilURL": "",
    "language": "fr",
    "shortName": "M. Odye"
  },
  {
    "id": 943,
    "lastname": "Magniez",
    "firstname": "Gabriel",
    "company": "SoLocal Group",
    "bio": "Architecte pluridisciplinaire, il travaille principalement sur des problématiques d'architectures à forte charge et haute disponibilité. Son quotidien: optimiser les performances de JVM, d'applications Java mais aussi concevoir des architectures résiliantes et performantes pour le compte d'un grand groupe numérique français.",
    "twitter": "https://twitter.com/gmagniez",
    "imageProfilURL": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/AAEAAQAAAAAAAAjwAAAAJGM1NTYyYzFiLTE5YmMtNGE4OS05NmU4LWJjNTY0NzFkOWJhOA.jpg",
    "language": "fr",
    "shortName": "G. Magniez"
  },
  {
    "id": 297,
    "lastname": "Stalin",
    "firstname": "Antoine",
    "company": "Norsys",
    "bio": "Développeur assumé et attaché aux développements orientés par les tests et le comportement, je porte un fort intérêt à la qualité logicielle. Toutefois, je considère que le premier facteur de qualité d'un produit reste la communication, sous toutes ses formes, et recherche constamment des methodes innovantes pour venir dynamiser et motiver les équipes qui entourent ce produit.",
    "twitter": "https://mobile.twitter.com/StalinAntoine",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/763705359878000640/5qBP4XAD_200x200.jpg",
    "language": "fr",
    "shortName": "A. Stalin"
  },
  {
    "id": 127,
    "lastname": "Especel",
    "firstname": "Cécile",
    "company": "Knp Labs",
    "bio": "J’ai découvert les méthodes agiles en 2009 alors que j’étais développeuse. 7 ans plus tard, je suis toujours convaincue par ses vertus et j’ai évolué vers le coaching agile et la facilitation.\n\nChez Knp Labs, j'accompagne, je soutiens, je motive nos Happy Awesome Developers et nos Supers Clients.\nPour cela j'applique les principes du manifeste agile le plus possible et j'utilise les outils de l'intelligence collaborative.",
    "twitter": "Cecile_Especel",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/689031412180103168/bq1EQbiy.jpg",
    "language": "fr",
    "shortName": "C. Especel"
  },
  {
    "id": 1027,
    "lastname": "Furmaniak",
    "firstname": "Christophe",
    "company": "Zenika",
    "bio": "Consultant Architecture et Culture DevOps chez [Zenika](http://www.zenika.com).\nJe suis avant tout un programmeur passionné avec une sensibilité particulière pour le cycle de build des projets, du poste de travail du développeur jusqu'au déploiement sur les environnements de production.\nLes sujets qui me tiennent particulièrement à cœur sont la gestion de la configuration des plateformes et des applications, le développement d'applications distribuées dans un environnement hybride (IaaS/PaaS/Legacy), et l'hypervision (génération, centralisation, alertes et rapports concernant les logs et les métriques générées par les applications et les plateformes).",
    "twitter": "cfurmaniak",
    "imageProfilURL": "http://plouf.nodevops.io/assets/cfk-pre-movember-CQPyzdLWwAAK9Aa.307x410.jpg",
    "language": "fr",
    "shortName": "C. Furmaniak"
  },
  {
    "id": 1058,
    "lastname": "Guillaume",
    "firstname": "Scheibel",
    "company": "Expedia",
    "bio": "Guillaume est développeur chez Expedia à Londres et a travaillé durant quelques années en France pour une grosse société de services. Il a également co-créé le JUG pour la région de Strasbourg (ElsassJUG) et contribue à 2 projets open-sources (Hibernate OGM et Infinispan). De temps en temps, il parle à différentes conférences (Soft-Shake, Devoxx FR et BE) ou JUGs.",
    "twitter": "@g_scheibel",
    "imageProfilURL": "http://www.gravatar.com/avatar/0d82c7c12dbc0a5f96e098d3e13b16c3.png",
    "language": "fr",
    "shortName": "S. Guillaume"
  },
  {
    "id": 546,
    "lastname": "Rousseau",
    "firstname": "michel",
    "company": "Microsoft",
    "bio": "Passionné par le design et l'UX, je travaille chez Microsoft à propager les messages inhérents à ce domaine auprès des développeurs, des décideurs, des startupeurs. Je suis avant tout un créateur de pixels le jour, en 2D, en 3D, en temps réel, en statique ou en dynamique, et destructeur de pixel la nuit, surtout sur les jeux vidéo à la première personne.",
    "twitter": "@rousseau_michel",
    "imageProfilURL": "https://michelrousseaufr.files.wordpress.com/2017/03/johmzwhp.jpeg",
    "language": "fr",
    "shortName": "m. Rousseau"
  },
  {
    "id": 251,
    "lastname": "Polaert",
    "firstname": "Guillaume",
    "company": "Logmatic.io",
    "bio": "Swiss army knife @logmatic",
    "twitter": "@gpolaert",
    "language": "fr",
    "shortName": "G. Polaert"
  },
  {
    "id": 147,
    "lastname": "REVEREAULT",
    "firstname": "Sylvain",
    "company": "Zenika Rennes",
    "bio": "Travaillant depuis une quinzaine d’années dans l’informatique, je me suis progressivement spécialisé dans les technologies systèmes et réseaux, en particulier autour des systèmes GNU/Linux, avant de m'orienter vers les problématiques d'industrialisation des environnements Web, puis vers les thématiques DevOps et agilité dans le monde \"Ops\". Je suis actuellement consultant DevOps et Infrastructure as Code chez Zenika, tout en portant la casquette de CTO de l'agence de Rennes.",
    "twitter": "@srevereault",
    "imageProfilURL": "http://0.gravatar.com/avatar/6bb659f89ed416dd611a28521557e1dc?s=200",
    "language": "fr",
    "shortName": "S. REVEREAULT"
  },
  {
    "id": 973,
    "lastname": "Philippot",
    "firstname": "Olivier",
    "company": "Greenspector",
    "bio": "Olivier est CTO chez Greenspector. Il aime les technologies mais surtout les optimiser. Il est fortement engagé dans les actions de sensibilisation à l'efficience et l'éco-conception logicielle comme le Geen Code Lab Challenge.",
    "twitter": "https://twitter.com/simplygreenit",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/675219125782847488/2OYzmpoy_400x400.jpg",
    "language": "fr",
    "shortName": "O. Philippot"
  },
  {
    "id": 571,
    "lastname": "Briand",
    "firstname": "Eric",
    "company": "Zenika",
    "bio": "Développeur touche à tout depuis plus de 10 ans, il travaille actuellement à Zenika Nantes. Ses sujets du moments sont le Cloud, Golang, l’industrialisation du JS, Electron et Docker. Il est formateur officiel Docker et co-organisateur du Docker Meetup Nantes.",
    "twitter": "@eric_briand",
    "imageProfilURL": "http://www.gravatar.com/avatar/d8475326bb94197fab3f6962d110bac3?size=400",
    "language": "fr",
    "shortName": "E. Briand"
  },
  {
    "id": 1222,
    "lastname": "Chegham",
    "firstname": "Wassim",
    "company": "SFEIR",
    "bio": "Wassim (aka manekinekko on Twitter/Github) is a Developer Advocate nominated by Google that spends most of his time working on large scale entreprise apps, helping developers write better code and provide training on mastering Web technologies (Angular 2, Polymer, PWA, Web Components...). He enjoys writing technical articles, meeting developers at events, speaking at conferences and contributing to open source projects.\n\nWassim loves the Web Platform and works hard to move the Web forward",
    "twitter": "manekinekko",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/734861801431674883/S93LQYOa.jpg",
    "language": "fr",
    "shortName": "W. Chegham"
  },
  {
    "id": 549,
    "lastname": "Sebrien",
    "firstname": "Julien",
    "company": "GENETICIO EXPERTISE",
    "bio": "Passionné de technologies orientées NoSQL, je travaille depuis plus de 12 ans sur des projets s'articulant autour des technologies Java.\n\nTravaillant sur Cassandra depuis la periode thrift avec hector, sur ElasticSearch depuis les facettes, je m'intéresse aux problématiques liées à l'intelligence artificielle, et plus particulièrement les algorithmes génétiques.",
    "twitter": "https://twitter.com/jsebrien",
    "imageProfilURL": "https://cloudinary-a.akamaihd.net/hopwork/image/upload/w_360,h_340,c_thumb,g_auto/nmsr9gkp89ch0dz7cyzt.jpg",
    "language": "fr",
    "shortName": "J. Sebrien"
  },
  {
    "id": 369,
    "lastname": "Gouigoux",
    "firstname": "Jean-Philippe",
    "company": "MGDIS / MVP",
    "bio": "Architecte logicielle et CTO d'un éditeur de logiciels de gestion, auteur de plusieurs livres sur la BI, la performance en .NET et Docker. Intéressé par les architectures SOA / microservices, je les mets actuellement en production pour mon entreprise avec Docker et une approche d'urbanisation de SI stricte (cartographie 4 strates). En dehors de l'informatique, je bricole (manoir breton, roulotte, gites & chambres d'hôtes)",
    "twitter": "https://twitter.com/JPGouigoux",
    "imageProfilURL": "http://gouigoux.com/download/Bouba.png",
    "language": "fr",
    "shortName": "J. Gouigoux"
  },
  {
    "id": 1313,
    "lastname": "MICHEL",
    "firstname": "Clément",
    "company": "SYNHACK",
    "bio": "Clément MICHEL est l’un des co-fondateurs de la société SYNHACK, cabinet de consultants spécialisé en cybersécurité.\nVéritable passionné de l’informatique, Clément traite essentiellement des problématiques de sécurité dans les entreprises. Il considère que les nouveaux challenges de sécurité pour les entreprises sont avant tout stratégiques, humains et surtout organisationnels (sans en oublier la technique bien entendu).\nDe formation « Manager IT », Clément a déjà eu l’occasion de travailler dans le milieu industriel, dans le monde des sociétés de services ainsi que celui des télécommunications.",
    "twitter": "https://twitter.com/clement_michel",
    "imageProfilURL": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/AAEAAQAAAAAAAAkvAAAAJGI5MjgxOTJiLTU2NTEtNGY2My1iYTQ2LTIzMDMzZjZjMTA0Mw.jpg",
    "language": "fr",
    "shortName": "C. MICHEL"
  },
  {
    "id": 652,
    "lastname": "AVERTY",
    "firstname": "Benoit",
    "company": "Zenika",
    "bio": "Consultant / Formateur chez Zenika, Je suis passionné de programmation et des nouvelles tendances, patterns et paradigmes. J'aime comprendre comment fonctionnent les outils que j'utilise, à quels besoins ils répondent et quelle est leur raison d'être. Mes derniers centres d'intérêts : Programmation Réactive, Programmation fonctionnelle, Moteurs de recherche...",
    "twitter": "Kaidjin",
    "imageProfilURL": "https://avatars3.githubusercontent.com/u/17006335?v=3&s=466",
    "language": "fr",
    "shortName": "B. AVERTY"
  },
  {
    "id": 1312,
    "lastname": "Guo",
    "firstname": "Yufeng",
    "company": "Google",
    "bio": "Yufeng is a Developer Advocate for the Google Cloud Platform, where he bridges the gap between the developer community and engineering teams.\nHe is interested in finding new and interesting applications of machine learning. You can find him on Twitter @YufengG",
    "twitter": "yufengg",
    "imageProfilURL": "https://storage.googleapis.com/yufengg-slides/headshot2.png",
    "language": "fr",
    "shortName": "Y. Guo"
  },
  {
    "id": 1421,
    "lastname": "POUSSE",
    "firstname": "Mathieu",
    "company": "Zenika",
    "bio": "Développeur / Formateur backend autour de Java et son ecosytème, de la conception à l'industrialisation, du déploiement au monitoring, j'aime le code bien fait et comprendre les paradigmes des outils pour en tirer le meilleur",
    "twitter": "m_pousse",
    "imageProfilURL": "https://avatars0.githubusercontent.com/u/2642023?v=3&s=400",
    "language": "fr",
    "shortName": "M. POUSSE"
  },
  {
    "id": 699,
    "lastname": "balit",
    "firstname": "cyril",
    "company": "Sfeir",
    "bio": "Cyril Balit est CTO Front chez SFEIR et Goole Developer Expert sur les technologies Web. Développeur passionné, il construit des Single Page Application en javascript depuis 2003 et tombe amoureux d’Angular en 2013. Il est un membre actif de la communauté web français sur plusieurs sujets comme Angular, Polymer  et les Progressives Web App . Organisateur de conférences et de meetups , speaker et formateur , Cyril aime partager avec les communautés.",
    "twitter": "cbalit",
    "imageProfilURL": "http://www.gravatar.com/avatar/2bacdce483ae07e586c9593312c8dad4.png",
    "language": "fr",
    "shortName": "c. balit"
  },
  {
    "id": 270,
    "lastname": "Youen",
    "firstname": "Chéné",
    "company": "Saagie",
    "bio": "CTO chez [Saagie](http://www.saagie.com).\nPassionné d'informatique et de programmation depuis le CE2 (génération MO5/TO7), je suis un des activistes au sein du Normandy JUG, Devoxx4Kids et de [Codeurs en Seine](http://www.codeursenseine.com).\nJ'ai fait 7 ans de prestation et de consulting en région parisienne, je suis passé développeur-manager chez Masternaut et je suis maintenant CTO chez Saagie, une plateforme big data prête à l'emploi.",
    "twitter": "youen_chene",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/710193564974784512/GQ6o6uSP.jpg",
    "language": "fr",
    "shortName": "C. Youen"
  },
  {
    "id": 1403,
    "lastname": "Bourgain",
    "firstname": "Olivier",
    "company": "OBMG",
    "bio": "Développeur, formateur, freelance, conférencier et troll. Je m'intéresse beaucoup aux problématiques bas niveau, de performance et d'optimisation ainsi qu'aux systèmes distribués, que ce soit au niveau de la JVM, du système et des bases de données.",
    "twitter": "https://twitter.com/olivierbourgain",
    "language": "fr",
    "shortName": "O. Bourgain"
  },
  {
    "id": 1465,
    "lastname": "Simard",
    "firstname": "Benoit",
    "company": "Neo4j",
    "bio": "Benoît est un développeur, spécialisé en logiciel libre, Java & data. En dehors de son goût pour le café et la data (et en particulier l'open), Benoît est consultant chez Neo4j, le spécialiste de la bases de données orientées graphes.",
    "twitter": "logisima",
    "imageProfilURL": "https://media.licdn.com/mpr/mpr/shrinknp_200_200/AAEAAQAAAAAAAAjeAAAAJGJmZDFkYzc1LWRmMmItNDBmYS05YjE5LWM2YTVhYmQzN2VjYg.jpg",
    "language": "fr",
    "shortName": "B. Simard"
  },
  {
    "id": 255,
    "lastname": "Leplus",
    "firstname": "Olivier",
    "company": "",
    "bio": "My day to day my mission is to help developers to create successful and quality apps.\nAs a passionate web developer, I am always discovering and playing with new web technologies !",
    "twitter": "https://twitter.com/olivierleplus",
    "imageProfilURL": "",
    "language": "fr",
    "shortName": "O. Leplus"
  },
  {
    "id": 1393,
    "lastname": "Bouchery",
    "firstname": "Frédéric",
    "company": "Figaro-CCMBenchmark Group",
    "bio": "Développeur PHP depuis 18 ans, je suis aujourd'hui team leader et architecte pour le groupe Figaro-CCMBenchmark (Le Figaro, commentcamarche.net, journaldunet.com, linternaute.com, journaldesfemmes.com, etc.). Je participe activement à d'optimisation des performances d'applications Web PHP qui rassemblent plus de 65 millions de visiteurs uniques par mois.",
    "twitter": "FredBouchery",
    "language": "fr",
    "shortName": "F. Bouchery"
  },
  {
    "id": 764,
    "lastname": "ADAM",
    "firstname": "Quentin",
    "company": "Clever Cloud",
    "bio": "Quentin ADAM is the CEO of Clever Cloud: an IT automation company, running a Platform as a Service allowing you to run java, scala, ruby, node.js, php, python or go applications, with auto scaling and auto healing features. This position allow him to study lots of applications, code, practice, and extract some talks and advises. Regular speaker at various tech conference, he’s focused to help developers to deliver quickly and happily good applications.",
    "twitter": "https://twitter.com/waxzce",
    "imageProfilURL": "http://i.imgur.com/YdzlEj0.jpg",
    "language": "fr",
    "shortName": "Q. ADAM"
  },
  {
    "id": 1109,
    "lastname": "LECAN",
    "firstname": "Damien",
    "company": "SQLI",
    "bio": "Passionné pour le code et l'open-source, je suis un peu touche-à-tout : Linux, Java, Rust ou Node et surtout le Web et l'immensité des possibilités qu'il offre !\n\nPar ailleurs directeur Technique à SQLI Nantes, j'anime des équipes de passionnés qui développent des projets autour des architectures microservices, Docker et la Blockchain.",
    "twitter": "https://twitter.com/dlecan",
    "imageProfilURL": "https://en.gravatar.com/userimage/896246/a63bea6c4ef8860fb382c9234400b97f.jpg?size=350",
    "language": "fr",
    "shortName": "D. LECAN"
  },
  {
    "id": 615,
    "lastname": "Champeau",
    "firstname": "Cédric",
    "company": "Gradle, Inc.",
    "bio": "Cédric Champeau travaille chez Gradle Inc. sur l’outil de build open source éponyme. Il est en particulier intéressé par l’amélioration des performances et la modélisation. \nCédric est aussi committer sur le langage Apache Groovy, qu’il a développé pendant plus de 3 ans au sein de Pivotal: créateur du compilateur statique, les traits, le support Android et autres fonctionnalités liées aux DSLs. Passionné par le métier, en particulier tout ce qui touche à l’outillage, Cédric aime avant tout développer des outils qui simplifient la vie des autres développeurs : langages, frameworks, build system, …",
    "twitter": "@CedricChampeau",
    "imageProfilURL": "https://lh3.googleusercontent.com/-G_v8HTWswjo/V6g0d2DAjKI/AAAAAAAAAIg/Bk4Al3torrEC1laV5BJgO82uHgdQ-AkPgCEw/w280-h278-p/IMG_4341.JPG",
    "language": "fr",
    "shortName": "C. Champeau"
  },
  {
    "id": 120,
    "lastname": "Gonzalez",
    "firstname": "Horacio",
    "company": "Cityzen Data",
    "bio": "Malgré ce que son accent espagnol bien prononcé peut suggérer, Horacio est arrivé en France il y a une quinzaine d'années déjà. Passionné d'informatique, dans laquelle il est tombé depuis tout petit, il a découvert Java en 1997 et depuis il n'a pas arrêté de bosser autour. \n\nAprès quelques années comme architecte technique au Crédit Mutuel Arkea, Horacio travaille actuellement à Cityzen Data, éditeurs de Warp10, plateforme open source pour les données de capteurs. Il est aussi leader et cofondateur du FinistJUG, le JUG francophone le plus proche de la Silicon Valley. \n\nPassionné par le développement web et tout ce qui gravite autour des composants web, Horacio a été nommé Google Developer Expert (GDE) en Web Technologies et Polymer.",
    "twitter": "https://twitter.com/LostInBrittany",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/780449624540708865/6V-wTMf7.jpg",
    "language": "fr",
    "shortName": "H. Gonzalez"
  },
  {
    "id": 1571,
    "lastname": "Menou",
    "firstname": "Frédéric",
    "company": "Fretlink",
    "bio": "CTO Fretlink, lazy developer, Haskell advocate",
    "twitter": "https://twitter.com/ptit_fred",
    "imageProfilURL": "https://secure.gravatar.com/avatar/252ef00042fda3ab4cf67a36b956fa33?size=360",
    "language": "fr",
    "shortName": "F. Menou"
  },
  {
    "id": 1240,
    "lastname": "Dubreuil",
    "firstname": "Alexandre",
    "company": "LesFurets.com",
    "bio": "Alexandre DuBreuil est un développeur québécois vivant en France et travaillant comme architecte Java chez LesFurets.com. Il aime écrire du code, et parler de code lors de meetups, BBL et conférences.",
    "twitter": "https://twitter.com/dubreuia",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/433889987814105089/wKuACKaO.jpeg",
    "language": "fr",
    "shortName": "A. Dubreuil"
  },
  {
    "id": 1622,
    "lastname": "Rodriguez",
    "firstname": "Tomas",
    "company": "Xebia France",
    "bio": "Issu du monde Java, Tomas a découvert la beauté et la simplicité de la programmation fonctionnelle à travers Scala, langage qu'il pratique depuis plus d'un an. Depuis il s'intéresse aux Systèmes Distribuées, Architectures Réactives, Microservices et Big Data.",
    "twitter": "@rstomasalberto",
    "imageProfilURL": "https://lh6.googleusercontent.com/-Cw39mtCiZew/AAAAAAAAAAI/AAAAAAAAAtE/8FPRENFTNVg/photo.jpg",
    "language": "fr",
    "shortName": "T. Rodriguez"
  },
  {
    "id": 1624,
    "lastname": "Sallat",
    "firstname": "Quentin",
    "company": "iD.apps",
    "bio": "Quentin Sallat is an Android tech lead at iD.apps. He has been passionate about mobile development for several years. He loves to create smart and user-centric applications, focusing on user experience and little design details.",
    "twitter": "@Aerilys",
    "imageProfilURL": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/p/5/005/080/391/1bba6d9.jpg",
    "language": "fr",
    "shortName": "Q. Sallat"
  },
  {
    "id": 740,
    "lastname": "HARDY",
    "firstname": "Serge",
    "company": "Zenika",
    "bio": "Je suis consultant en développement PHP/Symfony au sein de Zenika Rennes.\n\nAgiliste passionné, je m'intéresse également à la qualité logicielle et aux pratiques d'industrialisation.\n\nJe fais partie de l'organisation d'Agile Tour Rennes depuis 4 ans.",
    "twitter": "@sergehardy",
    "imageProfilURL": "https://media.licdn.com/mpr/mpr/shrinknp_200_200/p/5/000/221/164/3791c34.jpg",
    "language": "fr",
    "shortName": "S. HARDY"
  },
  {
    "id": 1529,
    "lastname": "GREAU",
    "firstname": "Maxime",
    "company": "eXo Platform",
    "bio": "Technology enthusiast: Java (EE), Docker, Git, Asciidoctor and Web\n\nI'm actually Software Factory Manager at eXo.\nI'm a Software Developer with 13+ years of experience.\n\nPassionate about IT, I contribute to Open Source projects in different ways (coding, speaking...) I wrote a French book about Apache Maven 3 in 2011.\nI'm speaker at conferences on Java, Web and Cloud technologies like DevNation, DevFest or Devoxx\nI blog about all those technologies on my personal website : http://mgreau.com/posts",
    "twitter": "https://twitter.com/mgreau",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/588747726910857216/b0nJW3an_400x400.jpg",
    "language": "fr",
    "shortName": "M. GREAU"
  },
  {
    "id": 832,
    "lastname": "Bonnin",
    "firstname": "Bruno",
    "company": "MyScript",
    "bio": "Polymorphic developer. Dashboard builder. Data fan @MyScript.",
    "twitter": "@_bruno_b_",
    "imageProfilURL": "http://www.gravatar.com/avatar/bc34f46fdfa199da05a78f26584ecec3",
    "language": "fr",
    "shortName": "B. Bonnin"
  },
  {
    "id": 1714,
    "lastname": "Vitard",
    "firstname": "Sébastien",
    "company": "Kristal",
    "bio": "Couteau-suisse du développement mobile natif (iOS, Android, feu BB10 et \"mort dans l'oeuf\" Tizen) et co-gérant chez Kristal.io, je rends accessible l'interface native de chaque plateforme aux développeurs Web qui utilisent [Cobalt](https://cobaltians.org/).",
    "twitter": "@Doc_1faux",
    "imageProfilURL": "https://kristal.io/img/cms/kristal/photo-sebastien2.jpg",
    "language": "fr",
    "shortName": "S. Vitard"
  },
  {
    "id": 1263,
    "lastname": "Abrahamson",
    "firstname": "Jeff",
    "company": "Jellybooks",
    "bio": "Jeff Abrahamson (ré)invente l'analyse de livres électroniques chez Jellybooks.\nDerrière chaque livre se cache une histoire dans les données de lecture : à trouver, à éclairer, à visualiser.\nJeff anime le Nantes Machine Learning Meetup et co-organise des formations professionnelles en DataScience à travers l'initiative ML Week.",
    "twitter": "https://twitter.com/#!/Jeff_Abrahamson",
    "imageProfilURL": "https://avatars0.githubusercontent.com/u/1220683?v=3&s=400",
    "language": "fr",
    "shortName": "J. Abrahamson"
  },
  {
    "id": 1744,
    "lastname": "Pennec",
    "firstname": "Nicolas",
    "company": "OVH",
    "bio": "Mercenaire codeur chez [OVH](https://www.ovh.com), passionné par le dév web front-end depuis IE6, co-fondateur du [RennesJS](http://rennesjs.org) et collectionneur de side-projects inachevés... \n  \nRetrouvez-moi sur [@NicoPennec](https://twitter.com/NicoPennec) ou [pennec.io](http://pennec.io)",
    "twitter": "https://twitter.com/NicoPennec",
    "imageProfilURL": "https://avatars2.githubusercontent.com/u/493223?v=3&u=c2ed22aedc21d4b43fdd99f8c9003e3461dac9a7",
    "language": "fr",
    "shortName": "N. Pennec"
  },
  {
    "id": 780,
    "lastname": "JUIF",
    "firstname": "Fabien",
    "company": "Zenika",
    "bio": "Fabien JUIF a baigné dans l’informatique depuis son adolescence. Il installait sa première Gentoo stage 1 en 1ère pour migrer vers Archlinux quelques années après.\nPour lui pacman n’est pas un jeu, on ne rigole pas avec ça.\n\nPassioné par la création de jeux vidéos, il s’intéressa très rapidement au développement logiciel. Avec 6 années dans le métier et une veille technologique personnelle depuis son plus jeune âge, il est devenu un peu touche à tout _GNU+Linux, Docker, développement backend, développement frontend, etc_\n\nChez Zenika, son attrait du moment c'est le Web, et plus précisément le développement ReactJS.\n\nIl espère pouvoir partager un peu de sa passion avec vous !",
    "twitter": "@fabienjuif",
    "imageProfilURL": "https://avatars0.githubusercontent.com/u/17828231?v=3&u=00cbd55c16ea7e7f6e7aedaa25e3045a9e601a30&s=400",
    "language": "fr",
    "shortName": "F. JUIF"
  },
  {
    "id": 1768,
    "lastname": "Bianchi",
    "firstname": "Giulia",
    "company": "Xebia",
    "bio": "Giulia est Data Scientist à Xebia depuis un an. Après deux ans d'experience professionnelle en bioinformatique, elle travaille actuellement sur des volumes de données plus importants en mettant en place des algorithmes de machine learning et en participant aux discussions avec les data ingénieurs pour la mise en production des modèles. Elle travaille surtout avec Python, Spark et R.\nElle est passionnée par l'IoT et elle suit les nouvelles tendances du monde de la data en participant aux différents Meetups et en suivant des blogs.",
    "twitter": "@GiuliabianchI",
    "language": "fr",
    "shortName": "G. Bianchi"
  },
  {
    "id": 1772,
    "lastname": "Charrière",
    "firstname": "Philippe",
    "bio": "- Eleveur de bots\n- Golo tech-evangelist-dev-relation-advocate :p @TypeUnsafe\n- Geek officiel d'entreprise\n- @ScalaIO_FR member\n- @MixIT_Lyon member\n- Solutions engineer @GitHub",
    "twitter": "@k33g_org",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/780741273942626306/T5ky8w3k.jpg",
    "language": "fr",
    "shortName": "P. Charrière"
  },
  {
    "id": 1051,
    "lastname": "Diez",
    "firstname": "Nicolas",
    "company": "Wescale",
    "bio": "Nicolas a acquis une forte expérience dans l'administration de systèmes hautement disponibles. Fervent adepte de la philosophie DevOps, ses différentes missions en assurance qualité ont permis à Nicolas de démontrer ses compétences dans l'automatisation des SI et des tests ainsi que ses capacités de médiation entre les équipes Dev et Ops.\nSon credo : \"Automatiser, tester, déployer\"",
    "twitter": "@claque2000",
    "imageProfilURL": "https://media.licdn.com/media/AAEAAQAAAAAAAAlPAAAAJGZiMDI4YTM1LThkNzUtNDZlZi05YTU4LTFmOThiYjA2MzBhMA.jpg",
    "language": "fr",
    "shortName": "N. Diez"
  },
  {
    "id": 566,
    "lastname": "Verriez",
    "firstname": "Manuel",
    "company": "Zenika",
    "bio": "Software engineer @ Zenika Lille, machine learning enthusiast.",
    "twitter": "mverriez",
    "imageProfilURL": "https://media.licdn.com/mpr/mpr/shrinknp_400_400/AAEAAQAAAAAAAAlqAAAAJGM3ZGZiZmY1LWQ5NjgtNDg3My04ZTdjLWVkMWUwMjhmMTcwMw.jpg",
    "language": "fr",
    "shortName": "M. Verriez"
  },
  {
    "id": 222,
    "lastname": "Roquelaure",
    "firstname": "Jonathan",
    "company": "JFrog",
    "bio": "Jonathan Roquelaure est ingénieur solutions chez JFrog, éditeur de produits récompensés - JFrog Artifactory, JFrog Bintray, JFrog Mission Control et JFrog Xray.\nBasé en France, développeur touche à tout, co-fondateur de TableOnline, agiliste et spécialisé dans l’industrialisation logicielle et le déploiement continu. Son credo est la facilitation du quotidien des projets informatiques et la fluidification des processus de distribution.",
    "twitter": "@roquelaurej",
    "imageProfilURL": "https://avatars0.githubusercontent.com/u/12458722?v=3&s=460",
    "language": "fr",
    "shortName": "J. Roquelaure"
  },
  {
    "id": 1061,
    "lastname": "Ledez",
    "firstname": "Nicolas",
    "company": "Cozy Cloud",
    "bio": "Nicolas Ledez a deux vies, le jour il travaille comme administrateur système pour Cozy Cloud et dans le passé d'autres sociétés plus grosses.\n\nAprès plusieurs années d'expérience, il est devenu architecte et consultant technique.\n\nEt la nuit, il aime écrire des applications en Python, Ruby ou d'autres langages. Et tout cela pour assouvir sa soif de curiosité et créer des choses.\n\nIl aime bien définir son travail comme \"ingénieur Lego\", d'autres personnes appellent ça devops.\n\nIl a aussi co-lancé une communauté devops à Rennes (ou il vit). Il contribue également à plusieurs communautés logicielles. Breizhcamp http://breizhcamp.org/, DevCamp Rennes http://devcamp.fr/, LabFab http://www.labfab.fr/, Devoxx4kids http://www.devoxx4kids.org/france/, etc.",
    "twitter": "nledez",
    "imageProfilURL": "https://www.gravatar.com/avatar/6a76cfa40e96d103935cf3093ed2bb49?size=2048",
    "language": "fr",
    "shortName": "N. Ledez"
  },
  {
    "id": 510,
    "lastname": "Pilato",
    "firstname": "David",
    "company": "elastic",
    "bio": "Depuis 2013, David Pilato est développeur et évangéliste chez elastic.co, après avoir passé les deux années précédentes à promouvoir le projet open-source Elasticsearch. Il en anime la communauté française.",
    "twitter": "https://twitter.com/dadoonet",
    "imageProfilURL": "https://dl.dropboxusercontent.com/u/41530933/elastic/PhotoSlack.jpeg",
    "language": "fr",
    "shortName": "D. Pilato"
  },
  {
    "id": 976,
    "lastname": "Ribreau",
    "firstname": "Francois-Guillaume",
    "company": "iAdvize / Redsmin",
    "bio": "Architect & lead-dev @iAdvize ? CTO @image-charts @Redsmin founder ? @RedisWeekly editor ? #FullStackHacker",
    "twitter": "FGRibreau",
    "imageProfilURL": "https://avatars.io/twitter/fgribreau?size=medium",
    "language": "fr",
    "shortName": "F. Ribreau"
  },
  {
    "id": 1461,
    "lastname": "Sfartz",
    "firstname": "Stève",
    "company": "CISCO",
    "bio": "Développeur NeXT à ses premières heures, Stève a vu naître Java, évangélisé les architectures .Net, lancé le Cloud Microsoft Azure, créé le SaaS Kosmos \"Education Numérique\" et monté les équipes R&D et la plateforme PaaS APISpark de Restlet. En 2016, Stève rejoint les équipes Cisco DevNet - le programme Développeurs de Cisco. Ses dadas : les architectures distribuées, l'interopérabilité, scalabilité et résilience. wwitter://@SteveSfartz, github://ObjectIsAdvantag",
    "twitter": "https://twitter.com/SteveSfartz",
    "imageProfilURL": "https://cdn-images-1.medium.com/max/1000/1*Iel5Q6qAxgBdl_IHUx3scA.jpeg",
    "language": "fr",
    "shortName": "S. Sfartz"
  },
  {
    "id": 1213,
    "lastname": "Mainaud",
    "firstname": "Jérôme",
    "company": "Ippon Technologies",
    "bio": "Architecte Java chez Ippon Technologies, Jérôme intervient en mode JAAS (Jérôme As A Service) sur des missions de conseil, de conception, de développement ou de formation. Ses domaines de prédilection sont les applications Java et les bases de données NoSQL comme Cassandra et les moteurs de recherche comme Elasticsearch et les systèmes de calcul distribués comme Spark.",
    "twitter": "jxerome",
    "imageProfilURL": "https://secure.gravatar.com/avatar/4f9deaec42efccd26cb9af839b3afde2?s=500",
    "language": "fr",
    "shortName": "J. Mainaud"
  },
  {
    "id": 1808,
    "lastname": "Gandin",
    "firstname": "Mathieu",
    "company": "lesfurets.com",
    "bio": "Je m'appelle Mathieu Gandin et je suis tech-lead chez lesfurets.com.  Depuis 16 ans, je développe des applications, travaille sur le Design de code, la transmission de pratiques de développement logiciel, l’implication de l’équipe sur le produit, et le refactoring de code existant.",
    "twitter": "@m_gandin",
    "imageProfilURL": "6 Avenue de Verdun",
    "language": "fr",
    "shortName": "M. Gandin"
  },
  {
    "id": 1813,
    "lastname": "Blind",
    "firstname": "Adrien",
    "company": "Société Générale",
    "bio": "J'ai d'abord travaillé pendant huit ans comme consultant, principalement dans le domaine de l'infra et du cloud avant de m'intéresser plus largement aux problématiques DevOps. J'ai depuis rejoint Société Générale pour contribuer à leur transformation vers le Continuous Delivery ; mon job consiste à évangéliser et intégrer ces pratiques et outils au sein de la DSI.\n\nGrand fan de Docker, je suis également [Docker Captain](https://www.docker.com/community/docker-captains), et co-organisateur de la communauté [Meetup Docker de Paris](https://www.meetup.com/fr-FR/Docker-Paris/).",
    "twitter": "@adrienblind",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/618386388002701312/U8C1qDpi.jpg",
    "language": "fr",
    "shortName": "A. Blind"
  },
  {
    "id": 1763,
    "lastname": "SAMIN",
    "firstname": "François",
    "company": "OVH",
    "bio": "Développeur et chef de projet dans une grande SSII européenne pendant 10 ans, j'ai rejoint OVH en 2016 pour travailler sur les problématiques de Continuous Delivery *At Scale*.",
    "twitter": "https://twitter.com/francoissamin",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/751723778988732416/Z50KXtxa.jpg",
    "language": "fr",
    "shortName": "F. SAMIN"
  },
  {
    "id": 1635,
    "lastname": "Gomes Rodrigues",
    "firstname": "Antonio",
    "company": "OCTO",
    "bio": "Antonio possède plus de 15 ans d’expérience dans des grands groupes, SSII, éditeurs de logiciel, structures de petite taille et startup.\nSes missions l’ont amené à travailler sur : \nLa définition et la mise en place d’architectures\nDes audits d’architecture\nDes transformations des méthodes de travail\nLes performances des sites web à fort trafic /applications pour courtiers/applications Cloud\n\nAfin de rester près du développement, il est commiter du projet Apache JMeter.\nIl réalise régulièrement des publications, participe à des  conférences et est relecteur technique pour divers livres. Il a notamment été co-auteur de l’ouvrage « Maîtriser JMeter : Du test de charge à Devops » en 2015.",
    "twitter": "@ra0077",
    "language": "fr",
    "shortName": "A. Gomes Rodrigues"
  },
  {
    "id": 1820,
    "lastname": "BOCHET",
    "firstname": "Charles",
    "company": "THEODO",
    "bio": "- 23 ans, de Lyon, diplômé des Ponts & Chaussées (Génie civil & Architecture)\n- Développeur web agile chez [Theodo](https://www.theodo.fr/en/)\n- Apprenti hacker à mes heures perdues",
    "twitter": "https://twitter.com/charlesbochet",
    "imageProfilURL": "https://media.licdn.com/mpr/mpr/shrinknp_200_200/AAEAAQAAAAAAAAeMAAAAJGI0NTE2Y2NiLTk2ZTAtNDBlMS1iNDljLWVlMjgxMDg0OWU4MA.jpg",
    "language": "fr",
    "shortName": "C. BOCHET"
  },
  {
    "id": 1541,
    "lastname": "Fournaise",
    "firstname": "Thomas",
    "company": "La Poste",
    "bio": "Après avoir commencé à développer sur CPC 6128. J'ai choisi de bosser dans l'informatique.\n\nJ'ai fait 10 ans d'architecture technique SAP avant de devenir chef de projet innovation au sein du groupe La Poste. Je m'occupe entre autre de l'opendata et de certaines applis bigdata. J'ai également réalisé des dataviz utilisées en interne du groupe : https://datanova.laposte.io/DatavizRSE/index.html\n\nA mes heures \"perdues\" je fais un peu de développement sur différentes technos.\nwww.evhunt.com\nmacarto.evhunt.com",
    "twitter": "https://twitter.com/FournaiseThomas",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/537329173891522560/Zx9F5Lyu_400x400.jpeg",
    "language": "fr",
    "shortName": "T. Fournaise"
  },
  {
    "id": 1615,
    "lastname": "MOURA",
    "firstname": "Romeu",
    "company": "Arolla",
    "bio": "Endless conversation — with friends & compilers — on art, crafts, dialectic, paradigm jump, serendipity.",
    "twitter": "https://twitter.com/malk_zameth",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/826439961314484224/j_9ozzLj_400x400.jpg",
    "language": "fr",
    "shortName": "R. MOURA"
  },
  {
    "id": 1572,
    "lastname": "BRECHET",
    "firstname": "Matthieu",
    "company": "SII",
    "bio": "Architecte logiciel expérimenté et polyvalent, je me suis spécialisé dans la conception d’application Web. \n\nJ'affectionne particulièrement le développement frontEnd autour des langages comme javascript, typescript et des API HTML5. Passionné par les différentes problématiques du web (performance, RWD, mobile, référencement, accessibilité…), j'aime croire que tout est réalisable dans un navigateur.\nToujours très curieux d’apprendre de nouvelles choses, je participe régulièrement aux conférences nationales en tant que spectateur et parfois en tant que speaker",
    "twitter": "@mbrechet",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/554555557320085506/RESH2yqu.jpeg",
    "language": "fr",
    "shortName": "M. BRECHET"
  },
  {
    "id": 1028,
    "lastname": "Laforge",
    "firstname": "Guillaume",
    "company": "Google",
    "bio": "Le jour, Guillaume Laforge est Developer Advocate chez Google, sur les solutions cloud, et de nuit, il reprends sa casquette de contributeur au projet Apache Groovy. Guillaume est également un des membres du podcast Les Cast Codeurs",
    "twitter": "@glaforge",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/515401943384989697/ajOdQVI9.jpeg",
    "language": "fr",
    "shortName": "G. Laforge"
  },
  {
    "id": 1847,
    "lastname": "LECACHEUR",
    "firstname": "Sébastien",
    "bio": "Très attaché au logiciel libre pour découvrir comment les autres développeurs programment et comment ces projets fonctionnent, j’aime le code !\n\nDéveloppeur C, puis web, puis Java EE, puis PHP, puis Android, puis… Le langage de programmation n’est qu’un moyen pour moi.\n\nEn tant qu’architecte je suis continuellement partagé entre “aller vite” et “s’attarder sur les détails”.",
    "twitter": "slecache",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/722358213836992512/nfBoZl5a_400x400.jpg",
    "language": "fr",
    "shortName": "S. LECACHEUR"
  },
  {
    "id": 1850,
    "lastname": "Pietrowska",
    "firstname": "Sandra",
    "company": "Xebia",
    "bio": "data scientist, passionnée par le machine learning et le text mining",
    "imageProfilURL": "http://en.gravatar.com/userimage/115167570/c596ccd3b87229b6e2f09e500ce38581.jpg?size=200",
    "language": "fr",
    "shortName": "S. Pietrowska"
  },
  {
    "id": 1780,
    "lastname": "Groléat",
    "firstname": "Tristan",
    "company": "OVH",
    "bio": "Suite à un doctorat sur l'accélération matérielle pour la surveillance de trafic, Tristan a rejoint OVH pour contribuer au développement de la nouvelle génération d'anti-DDoS. Il s'occupe maintenant des besoins d'OVH et ses clients en accélérateurs matériels sur FPGA.",
    "twitter": "twisterss",
    "language": "fr",
    "shortName": "T. Groléat"
  },
  {
    "id": 498,
    "lastname": "LEMAIRE",
    "firstname": "Arnaud",
    "company": "Arpinum",
    "bio": "J’ai été tour à tour (et pas dans le bon ordre) : CTO d’une startup, directeur de la production chez un éditeur logiciel, architecte logiciel, consultant et développeur.\n\nAprès avoir travaillé pour des Startups, des PME, des grands groupes et le secteur public, je suis maintenant membre d’un bureau d’étude pour aider des clients de toute taille à réussir leurs projets logiciels depuis la conception jusqu’au déploiement en production. \n\nAu quotidien je pratique du JS, PHP, le Python, Java et Ruby et tout les outils qui me permettent de répondre au mieux à la problématique métier du moment.\n\nC’est ce mélange d’expérience que je souhaite partager et transmettre lors des évènements auxquelles je participe (PyConFr, Breizhcamp, Agile France, nCraft, RivieraDev, Bdx.io, FPDays, Socrates …). En parlant de bonnes pratiques, de programmation fonctionnelle, d’agilité et de software craftsmanship.",
    "twitter": "twitter.com/lilobase",
    "imageProfilURL": "https://scontent-fra3-1.xx.fbcdn.net/v/t31.0-8/15723446_10154866679837264_8526737397678099706_o.jpg?oh=900b7d3a43e4f78657afc549c7ef02bb&oe=5934DBCC",
    "language": "fr",
    "shortName": "A. LEMAIRE"
  },
  {
    "id": 1867,
    "lastname": "Vanderstockt",
    "firstname": "Yann",
    "company": "Pagesjaunes",
    "bio": "Après plus de 11 ans en Irlande a travailler pour des start-ups notamment sur du e-Learning, et pas mal d'intelligence artificielle, Yann est rentré en France fin 2008 dans une SSII de Rennes. Il travaille chez Solocal / PagesJaunes depuis Février 2011 d'abord comme Architecte Java puis comme Technical Leader Big Data. Yann est passionné par les systèmes distribués, et tout ce qui touche au BigData.",
    "twitter": "@yannvds",
    "imageProfilURL": "https://goo.gl/IObRZL",
    "language": "fr",
    "shortName": "Y. Vanderstockt"
  },
  {
    "id": 1595,
    "lastname": "Paliès",
    "firstname": "Jean",
    "company": "Palies Consulting",
    "bio": "Développeur Java depuis 12 ans, indépendant. Ça, c'est en temps normal. Le reste c'est scratch, blockly, robots, devoxx4kids, coding goûters, Cap sur le code, et diversité.",
    "twitter": "@jpalies",
    "language": "fr",
    "shortName": "J. Paliès"
  },
  {
    "id": 292,
    "lastname": "Matagne",
    "firstname": "Yan",
    "company": "norsys",
    "bio": "Yan est développeur depuis une petite dizaine d'années et navigue de projets en projets pour aider et animer les équipes. Passionné par l'automatisation des projets, il rend accessible le projet à l'ensemble des équipiers.",
    "twitter": "https://twitter.com/ymatagne",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/670598827561328640/1gZ374Aq.png",
    "language": "fr",
    "shortName": "Y. Matagne"
  },
  {
    "id": 1116,
    "language": "fr",
    "shortName": ""
  },
  {
    "id": 570,
    "lastname": "FRIN",
    "firstname": "Yvonnick",
    "company": "Zenika",
    "bio": "Yvonnick développeur javascript chez Zenika Nantes. Curieux et passionné, il aime découvrir les dernières technologies du Web. Adepte d’AngularJs depuis déjà deux ans, il se met à explorer le Flux avec React. Social, il écume les meetups nantais en quête de nouveautés.",
    "twitter": "@YvonnickFrin",
    "imageProfilURL": "https://lh3.googleusercontent.com/-8MdKrB23rMw/WAyFJYGOSPI/AAAAAAAAASA/5J_pyB2M06EiOLTuATb4dxtgjUUHvejpQCEw/w278-h280-p/face.jpg",
    "language": "fr",
    "shortName": "Y. FRIN"
  },
  {
    "id": 1449,
    "lastname": "Vandel",
    "firstname": "Aurélien",
    "company": "Saagie",
    "bio": "Nosql, data processing, scala and spark fanboy. Certified as developer and admin on MongoDB.",
    "twitter": "@aurevandel",
    "imageProfilURL": "https://www.saagie.com/user/pages/team/Aurelien.jpg",
    "language": "fr",
    "shortName": "A. Vandel"
  },
  {
    "id": 1431,
    "lastname": "Petit",
    "firstname": "Jean-Baptiste",
    "company": "Xebia",
    "bio": "Développeur Java en perpétuelle formation. Intérêts pour Rust, Golang, PonyLang...",
    "imageProfilURL": "https://avatars0.githubusercontent.com/u/5137306?v=3&s=460",
    "language": "fr",
    "shortName": "J. Petit"
  },
  {
    "id": 1557,
    "lastname": "NICOLAS",
    "firstname": "Guillaume",
    "company": "SQLI",
    "bio": "Depuis longtemps adepte des nouvelles technologies, j'ai découvert récemment le concept de blockchain. Depuis ce jour, je travail au quotidien sur la formalisation des concepts associés, en développant des cas d'usages destinés au grand public. \nJe suis également lead developer des projets open-source Ethereum-[java/android] et diffuse régulièrement mes compétences à travers différents médias (vidéo et articles).\nLa mobilité, l'IoT et les nouveaux modes d'intéraction, sont égalements des sujets qui me passionnent. Mon souhait est de fusionner tout ces sujets pour faire émerger de nouveaux usages.",
    "twitter": "@GuiillaumeN",
    "imageProfilURL": "https://avatars0.githubusercontent.com/u/6088236?v=3&s=460",
    "language": "fr",
    "shortName": "G. NICOLAS"
  },
  {
    "id": 1734,
    "lastname": "Le Coz",
    "firstname": "Fabrice",
    "company": "Telecom Sante",
    "bio": "Amoureux du web depuis la préhistoire, J'en ai fait mon métier. A l'origine développeur Java et PHP, je me suis converti a JavaScript en 2009 et depuis je ne jure que par ce langage.",
    "imageProfilURL": "https://a248.e.akamai.net/secure.meetupstatic.com/photos/member/e/9/d/6/highres_203939862.jpeg",
    "language": "fr",
    "shortName": "F. Le Coz"
  },
  {
    "id": 1354,
    "lastname": "Claramonte",
    "firstname": "Jean-Baptiste",
    "company": "Xebia",
    "bio": "Jean-Baptiste est développeur back depuis plus de 15 ans. Depuis 2 ans il s'intéresse plus particulièrement à l'actualité des containers et de leurs impacts pour les développeurs.",
    "twitter": "@jbclaramonte",
    "imageProfilURL": "https://lh6.googleusercontent.com/-SkhFTSbbbfM/AAAAAAAAAAI/AAAAAAAAABY/OrqYF9I4LA0/photo.jpg",
    "language": "fr",
    "shortName": "J. Claramonte"
  },
  {
    "id": 1677,
    "lastname": "Saby",
    "firstname": "Nastasia",
    "company": "Zenika",
    "bio": "Développeur, membre de l'Association Française des Utilisateurs du PHP, passionnée de programmation en général et toujours en quête de perfectionnement, après avoir fait des études un peu partout (Toulon, Argentine, ...) j'ai commencé mes premières années chez CGI Lyon avant d'arriver chez Zenika toujours à Lyon en tant que consultante.",
    "twitter": "https://twitter.com/saby_nastasia",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/771753987410432000/4UFljf1u.jpg",
    "language": "fr",
    "shortName": "N. Saby"
  },
  {
    "id": 1725,
    "lastname": "Gendre",
    "firstname": "Guillaume",
    "company": "Kristal",
    "bio": "Développeur web mobile et co-gérant chez Kristal.io, je suis le Guru web à l'origine de Cobalt. J'ai un cerveau hybride dopé aux particules de natif. Sinon ça va, tout baigne.",
    "twitter": "@ggendre",
    "imageProfilURL": "https://kristal.io/img/cms/kristal/photo-guillaume.jpg",
    "language": "fr",
    "shortName": "G. Gendre"
  },
  {
    "id": 867,
    "lastname": "PATCHANE",
    "firstname": "Cédric",
    "company": "Cozy Cloud",
    "bio": "Développeur passionné de JavaScript et d'OpenSource. Actuellement développeur full-stack chez CozyCloud.",
    "twitter": "https://twitter.com/CPatchane",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/702282382855041024/PUFJGWWB.jpg",
    "language": "fr",
    "shortName": "C. PATCHANE"
  },
  {
    "id": 439,
    "lastname": "Grangeau",
    "firstname": "Laurent",
    "company": "Finaxys",
    "bio": "Laurent Grangeau is a devops coach at Finaxys. He coaches applications to move to continuous delivery in a French bank. Docker enthusiast from the beginning, he participates actively at co-organizing meetups. Occasional speaker, he speaks about continuous delivery and deploying apps at scale.",
    "twitter": "laurentgrangeau",
    "imageProfilURL": "https://pbs.twimg.com/profile_images/593533853383299072/172hHzea.jpg",
    "language": "fr",
    "shortName": "L. Grangeau"
  },
  {
    "id": 1857,
    "language": "fr",
    "shortName": ""
  },
  {
    "id": 813,
    "lastname": "Esnault",
    "firstname": "Yvonnick",
    "company": "OVH",
    "bio": "Dev",
    "twitter": "@yesnault",
    "language": "fr",
    "shortName": "Y. Esnault"
  },
  {
    "id": 1824,
    "lastname": "Guiheux",
    "firstname": "Steven",
    "company": "OVh",
    "bio": "CDS maintener",
    "twitter": "@sguiheux",
    "language": "fr",
    "shortName": "S. Guiheux"
  },
  {
    "id": 1577,
    "lastname": "mabrouk",
    "firstname": "safa",
    "company": "octo technology",
    "bio": "J'ai toujours fait de la soa et de l’intégration du SI: les services, les messages, le mode synchrone, le mode asynchrone, les applications à communiquer, les protocoles, la gouvernance des données,les différents produits ESB, les multiples outils de messaging en particulier les moms et leurs différentes architecture et implémentations.",
    "twitter": "https://twitter.com/MABROUKSafa",
    "imageProfilURL": "file:///home/saf/T%C3%A9l%C3%A9chargements/photo.jpg",
    "language": "fr",
    "shortName": "s. mabrouk"
  },
  {
    "id": 381,
    "lastname": "Jegat",
    "firstname": "David",
    "company": "KNPLabs",
    "bio": "Happy Developer @KnpLabs enjoying music, KISS, programming, discovering, learning, agility ...",
    "imageProfilURL": "https://avatars2.githubusercontent.com/u/1638230?v=3&s=460",
    "language": "fr",
    "shortName": "D. Jegat"
  },
  {
    "id": 948,
    "lastname": "Guélé",
    "firstname": "Anthony",
    "company": "SII ouest",
    "bio": "Développeur depuis plus de 10 ans, je me suis spécialisé dans les technos du web avec un coup de coeur pour NodeJs et AngularJS",
    "language": "fr",
    "shortName": "A. Guélé"
  },
  {
    "id": 1859,
    "lastname": "Roussel",
    "firstname": "Nicolas",
    "company": "SII",
    "bio": "Architecte logiciel à forte tendance back-end et brasseur invétéré",
    "twitter": "leguaguigo",
    "imageProfilURL": "https://lh6.googleusercontent.com/xVeU748ToNr2KgxxRUbG6MGD34KB4qUm_j_JYshRY3mOtBPwSJZaxAR_II92iA0sm_U22jK6eStZ8aU=w1920-h939",
    "language": "fr",
    "shortName": "N. Roussel"
  },
  {
    "id": 1851,
    "lastname": "Michaud",
    "firstname": "Antoine",
    "company": "Xebia France",
    "bio": "Développeur web, ingénieur data et craftsman enthousiaste",
    "twitter": "@AMichaud34",
    "imageProfilURL": "https://www.gravatar.com/avatar/e6b31f424660d683ad26673ee6ecebe9",
    "language": "fr",
    "shortName": "A. Michaud"
  },
  {
    "id": 1860,
    "language": "fr",
    "shortName": ""
  }
]
